Repository: nizomovasadbek/i10n
Catalog: gnome/43/cheese.master.po
Languages: uz

source: Photo mode
uz: Rasm rejimi

source: Photo
uz: Rasm

source: Video mode
uz: Video rejimi

source: Take a photo using a webcam
uz: Veb-kamera yordamida suratga olish

source: Navigate to the previous page of effects
uz: Effektlarning oldingi sahifasiga o'tish

source: Effects
uz: Effektlar

source: _Effects
uz: _Effektlar

source: Navigate to the next page of effects
uz: Effektlarning keyingi sahifasiga o'tish

source: Leave fullscreen mode and go back to windowed mode
uz: To'liq ekran rejimidan chiqish va oyna rejimiga qaytish

source: Preferences
uz: Parametrlar

source: _Help
uz: _Yordam

source: _Close
uz: _Yopish

source: Device
uz: Qurilma

source: Photo resolution
uz: Rasm o'lchami

source: Video resolution
uz: Video o'lchami

source: Webcam
uz: Veb-kamera

source: Brightness
uz: Yorqinlik

source: Saturation
uz: To'yinganlik

source: Hue
uz: Rang

source: Contrast
uz: Kontrast

source: Image
uz: Rasm

source: _Countdown
uz: _Ortga hisoblash

source: Fire _flash
uz: Yong'in _chirog'i

source: Number of photos
uz: Rasmlar soni

source: Delay between photos (seconds)
uz: Rasmlar orasidagi kechikish (soniya)

source: _Fullscreen
uz: _To'liq ekran

source: P_references
uz: P_arametrlar

source: _Keyboard Shortcuts
uz: _Klavitura yorliqlari

source: _About Cheese
uz: _Cheese haqida

source: Take a Photo
uz: Rasmga olish

source: Open
uz: Ochish

source: Save _As…
uz: Quyidagicha _saqlash

source: Move to _Trash
uz: Chiqitdonga ko'chirish

source: Delete
uz: O'chirish

source: Take photos and videos with your webcam, with fun graphical effects
uz: Qiziqarli grafik effektlar bilan veb-kamerangiz yordamida fotosuratlar va videolar oling

source: Cheese uses your webcam to take photos and videos, applies fancy special effects and lets you share the fun with others.
uz: Cheese veb-kamerangizdan rasm va video olish uchun foydalanadi, ajoyib maxsuseffektlarni qo‘llaydi va zavqni boshqalar bilan ulashish imkonini beradi.

source: Under the hood, Cheese uses GStreamer to apply fancy effects to photos and videos. With Cheese it is easy to take photos of you, your friends, pets or whatever you want and share them with others.
uz: Kaput ostida Cheese foto va videolarga ajoyib effektlarni qo‘llash uchun GStreamer’dan foydalanadi.Cheese yordamida siz, do'stlaringiz, uy hayvonlaringiz yoki xohlagan narsangizni suratga olishva ularni boshqalar bilan ulashish oson.

source: Use a countdown
uz: Ortga hisoblashdan foydalanish

source: Set to true to show a countdown before taking a photo
uz: Suratga olishdan oldin ortga hisoblashni ko‘rsatish uchun rost qiymatini o‘rnating

source: Countdown length
uz: Ortga hisoblash uzunligi

source: The duration of the countdown before taking a photo, in seconds
uz: Suratga olishdan oldingi ortga hisoblash davomiyligi, soniyada

source: Camera device string indicator
uz: Kamera qurilmasi satri ko'rsatkichi

source: Last selected effect
uz: Oxirgi tanlangan effekt

source: Name of the installed effect that was selected last
uz: Oxirgi tanlangan o'rnatilgan effekt nomi

source: Photo width
uz: Rasmning eni

source: The width of the image captured from the camera, in pixels
uz: Kamerada olingan rasmning eni, piksellarda

source: Photo height
uz: Rasmning bo'yi

source: The height of the image captured from the camera, in pixels
uz: Kamerada olingan rasmning bo'yi, piksellarda

source: Video width
uz: Videoning eni

source: The width of the video captured from the camera, in pixels
uz: Kamerada olingan videoning eni, piksellarda

source: Video height
uz: Videoning bo'yi

source: The height of the video captured from the camera, in pixels
uz: Kamerada olingan rasmning bo'yi, piksellarda

source: Image brightness
uz: Rasm yorqinligi

source: Adjusts the brightness of the image coming from the camera
uz: Kameradan kelayotgan tasvirning yorqinligini sozlaydi

source: Image contrast
uz: Rasm kontrasti

source: Adjusts the contrast of the image coming from the camera
uz: Kameradan kelayotgan tasvirning kontrastini sozlaydi

source: Image saturation
uz: Rasm to'yinganligi

source: Adjusts the saturation of the image coming from the camera
uz: Kameradan kelayotgan tasvirning to'yinganligini sozlaydi

source: Image hue
uz: Rasm rangi

source: Adjusts the hue (color tint) of the image coming from the camera
uz: Kameradan kelayotgan tasvirning rangini (rang rangini) sozlaydi

source: Video path
uz: Videoning yo'li

source: Defines the path where the videos are stored. If empty, “XDG_VIDEOS_DIR/Webcam” will be used.
uz: Videolar saqlanadigan yo'lni belgilaydi. Agar bo'sh bo'lsa, “XDG_VIDEOS_DIR/Webcam” ishlatiladi.

source: Photo path
uz: Rasmning yo'li

source: Defines the path where the photos are stored. If empty, “XDG_PICTURES_DIR/Webcam” will be used.
uz: Rasmlar saqlanadigan yo'lni belgilaydi. Agar bo'sh bo'lsa, “XDG_PICTURES_DIR/Webcam” ishlatiladi.

# shortcut window
source: Overview
uz: Umumiy koʻrinish

# shortcut window
source: Fullscreen on / off
uz: To'liq ekran yoqish / o'chirish

# shortcut window
source: Quit the application
uz: Ilovadan chiqish

# shortcut window
source: Thumbnails
uz: Eskizlar

# shortcut window
source: Open
uz: Ochish

# shortcut window
source: Save As
uz: Quyidagicha saqlash

# shortcut window
source: Move to Trash
uz: Chiqitdonga ko'chirish

# shortcut window
source: Delete
uz: O'chirish

source: _Cancel
uz: _Bekor qilish

source: _Select
uz: _Tanlash

source: _Take Another Picture
uz: _Boshqa rasm oling

source: One or more needed GStreamer elements are missing:
uz: Bir yoki bir nechta kerakli GStreamer elementlari yetishmayapti:

source: No device found
uz: Qurilma topilmadi

source: Device capabilities not supported
uz: Qurilma imkoniyatlari qo'llab-quvvatlanmaydi

source: Unknown device
uz: Noma'lum qurilma

source: Device to use as a camera
uz: Kamera sifatida foydalanish uchun qurilma

source: DEVICE
uz: QURILMA

source: Output version information and exit
uz: Versiya ma'lumotlarini chiqarish va chiqish

source: Start in fullscreen mode
uz: To'liq ekram rejimida boshlash

source: Webcam in use
uz: Amaldagi veb-kamera

source: Cheese Website
uz: Cheese veb-sayti

source: No Effect
uz: Effekt yo'q

source: Could not open %s
uz: %s ni ochib bo'lmadi

source: Are you sure you want to permanently delete the file?
uz: Haqiqatan ham faylni butunlay oʻchirib tashlamoqchimisiz

source: _Delete
uz: _O'chirish

source: If you delete an item, it will be permanently lost
uz: Agar elementni o'chirsangiz, u butunlay yo'qoladi

source: Could not delete %s
uz: %s ni o'chirib bo'lmadi

source: Skip
uz: O'tkazib yuborish

source: Skip all
uz: Barchasini o'tkazib yuborish

source: Could not move %s to trash
uz: %s ni chiqitdonga ko'chirib bo'lmadi

source: Save File
uz: Faylni saqlash

source: Save
uz: Saqlash

source: Could not save %s
uz: %s ni saqlab bo'lmadi

source: Stop recording
uz: Yozishni to'xtatish

source: Record a video
uz: Video yozib olish

source: Stop taking pictures
uz: Rasmga olishni to'xtatish

source: Take multiple photos
uz: Bir nechta suratga olish

source: No effects found
uz: Effektlar topilmadi

source: There was an error playing video from the webcam
uz: Veb-kameradan videoni ijro etishda xatolik yuz berdi

source: Record a video using a webcam
uz: Veb-kamera yordamida video yozib olish

source: Take multiple photos using a webcam
uz: Veb-kamera yordamida bir nechta suratga olish

source: Choose an Effect
uz: Effektni tanlang

source: Record a Video
uz: Video yozib olish

source: Take Multiple Photos
uz: Bir nechta suratga olish
