Repository: nizomovasadbek/i10n
Catalog: gnome/43/connections.gnome-43.po
Languages: uz

source: View and use other desktops
uz: Boshqa ish stollarini ko'ring va foydalaning

source: Connections allows you to connect to and use other desktops. This can be a great way to access content or software on a different desktop operating system. It can also be used as a way to provide support to users who might need help.
uz: Connections sizga boshqa ish stollariga ulanish va ulardan foydalanish imkonini beradi. Bu Boshqa ish stolidagi kontent yoki dasturiy ta'minotga kirishning ajoyib usulitizim. Bundan tashqari, u foydalanuvchilarga yordam berish usuli sifatida ham foydalanish mumkin Yordam kerak.

source: A range of different operating systems can be connected to, including Linux and Windows desktops. You can also connect to virtual machines.
uz: Bir qator turli xil operatsion tizimlar, jumladan, Linuxga ulanishi mumkinva Windows ish stollari. Siz virtual mashinalarga ham ulanishingiz mumkin.

source: Connections uses the widely supported VNC and RDP protocols, and one of these must be enabled on the desktop that you want to connect to.
uz: Connections keng qo'llab-quvvatlanadigan VNC va RDP protokollaridan foydalanadi va Bular siz ulanmoqchi bo'lgan ish stolida yoqilgan bo'lishi kerak.

source: The GNOME Project
uz: GNOME loyihasi

source: Remote Desktop (VNC) file
uz: Remote Desktop (VNC) fayli

source: Delete
uz: Oʻchirish

source: Properties
uz: Xususiyatlari

source: A remote desktop client for the GNOME desktop environment
uz: GNOME ish stoli muhiti uchun masofaviy ish stoli mijozi

source: Couldn’t open file of unknown mime type %s
uz: Nomaʼlum mim turidagi %s faylni ochib boʻlmadi

source: Connection to “%s” has been deleted
uz: “%s” ga ulanish o‘chirildi

source: Undo
uz: Bekor qilish

source: URL to connect
uz: Ulanish uchun URL

source: Open .vnc or .rdp file at the given PATH
uz: Berilgan PATHda .vnc yoki .rdp faylini oching

source: Open in full screen
uz: Toʻliq ekranda oching

source: Too many command-line arguments specified.
uz: Juda koʻp buyruq qatori argumentlari koʻrsatilgan.

source: Screenshot from %s
uz: %s dan skrinshot

source: Screenshot taken
uz: Skrinshot olingan

source: Open
uz: Ochiq

source: “%s” requires authentication
uz: “%s” autentifikatsiyani talab qiladi

source: Authentication failed: %s
uz: Autentifikatsiya amalga oshmadi: %s

source: No Thanks
uz: Yo'q, rahmat

source: Close
uz: Yopish

source: Take Screenshot
uz: Skrinshot oling

source: Fullscreen
uz: To'liq ekran

source: Enter the network identifier of the remote desktop to connect to:
uz: Ulanish uchun masofaviy ish stolining tarmoq identifikatorini kiriting:

source: Connection Type
uz: Ulanish turi

source: RDP (standard for connecting to Windows)
uz: RDP (Windows-ga ulanish uchun standart)

source: VNC (standard for connecting to Linux)
uz: VNC (Linuxga ulanish uchun standart)

source: Help
uz: Yordam

source: Connect
uz: Ulanish

source: _Username
uz: _Foydalanuvchi

source: _Password
uz: _Parol

source: Sign In
uz: Tizimga kirish

source: Welcome to Connections
uz: Connections-ga xush kelibsiz

source: Learn about how Connections works.
uz: Connections qanday ishlashi haqida bilib oling.

source: Use other desktops, remotely
uz: Boshqa ish stollarini masofadan turib foydalaning

source: Use Connections to view the screen of other desktops. You can control them using the pointer and keyboard, too!
uz: Boshqa ish stollari ekranini ko'rish uchun Connections-dan foydalaning. Siz ularni boshqarishingiz mumkinKo'rsatkich va klaviatura yordamida ham!

source: Connect to different operating systems
uz: Turli xil operatsion tizimlarga ulaning

source: Access Linux, Mac, and Windows desktops using Connections.
uz: Connections yordamida Linux, Mac va Windows ish stollariga kiring.

source: Enable remote desktop before connecting
uz: Ulanishdan oldin masofaviy ish stolini yoqing

source: Computers need to be set up for remote desktop before you can connect to them.
uz: Ulanishdan oldin kompyuterlar masofaviy ish stoli uchun sozlanishi kerak

source: We hope that you enjoy Connections!
uz: Umid qilamizki, Connections sizga yoqadi!

source: More information can be found in the help.
uz: Qo'shimcha ma'lumotni yordamda topishingiz mumkin.

source: Connection preferences
uz: Ulanish sozlamalari

source: Address
uz: Manzil

source: Name
uz: Nom

source: Scaling
uz: Masshtablash

source: New
uz: Yangi

source: Application Menu
uz: Ilova menyusi

source: Search
uz: Qidirov

source: Go Back
uz: Ortga qaytish

source: Display Menu
uz: Displey Menyusi

source: Disconnect
uz: Uzish

source: Keyboard shortcuts
uz: Klaviatura yorliqlari

source: Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: About Connections
uz: Connections haqida

source: Display
uz: Displey

source: View only
uz: Faqat koʻrish

source: Show local pointer
uz: Mahalliy ko'rsatkichni ko'rsatish

source: Enable audio
uz: Audioni yoqish

source: Bandwidth
uz: Tarmoqli kengligi

source: High quality
uz: Yuqori sifatli

source: Fast refresh
uz: Tez yangilash

source: Scale mode
uz: Masshtab rejimi

source: Fit window
uz: Moslash oynasi

source: Original size
uz: Asl o'lcham

source: Just hit the <b>+</b> button to make your first connection.
uz: Birinchi ulanishni amalga oshirish uchun <b>+</b> tugmasini bosing.

source: Couldn’t parse the file
uz: Faylni tahlil qilib bo‘lmadi

source: VNC File is missing key “%s”
uz: VNC faylida “%s” kaliti yetishmayapti
