Repository: nizomovasadbek/i10n
Catalog: gnome/43/devhelp.main.po
Languages: uz

source: A developer tool for browsing and searching API documentation
uz: API texnik hujjatlarini ko'rib chiqish va qidirish uchun ishlab chiquvchi vosita

source: Devhelp is a developer tool for browsing and searching API documentation. It provides an easy way to navigate through libraries and to search by function, struct, or macro.
uz: Devhelp - bu API texnik hujjatlarini ko'rib chiqish va qidirish uchun ishlab chiquvchi vosita. Bu kutubxonalar bo'ylab harakat qilish va qidirishning oson usulini taqdim etadifunktsiya, struktura yoki makro.

source: The documentation must be installed locally, so an internet connection is not needed to use Devhelp.
uz: Texnik hujjatlar mahalliy sifatida o'rnatilishi kerak, shuning uchun internet aloqasiDevhelp-dan foydalanish shart emas.

source: Devhelp works natively with GTK-Doc, so the GTK and GNOME libraries are well supported. But other development platforms can be supported as well, as long as the API documentation is available in HTML and a *.devhelp2 index file is generated.
uz: Devhelp GTK-Doc bilan ishlaydi, shuning uchun GTK va GNOME kutubxonalari yaxshiqo'llab-quvvatlanadi. Lekin boshqa ishlab chiqish platformalari ham qo'llab-quvvatlanishi mumkin, uzoq vaqt chunki API texnik hujjatlari HTMLda mavjud va *.devhelp2 indeks fayliyaratilgan.

source: Devhelp integrates with other applications such as Glade, Builder or Anjuta, and plugins are available for different text editors (gedit, Vim, Emacs, Geany, …).
uz: Devhelp Glade, Builder yoki Anjuta kabi boshqa ilovalar bilan birlashadi,va plaginlar turli matn muharrirlari uchun mavjud (gedit, Vim, Emacs,Geany, ...).

source: Devhelp's main window
uz: Devhelpning asosiy oynasi

source: Devhelp's main window with an open book
uz: Devhelpning ochiq kitobli asosiy oynasi

source: Devhelp supports opening multiple books
uz: Devhelp bir nechta kitoblarni ochishni qo'llab-quvvatlaydi

source: Devhelp supports HTML documentation formats
uz: Devhelp HTML hujjat formatlarini qo'llab-quvvatlaydi

source: API Documentation Browser
uz: API texnik hujjatlar brauzeri

source: Main window maximized state
uz: Asosiy oynaning maksimal holati

source: Whether the main window should start maximized.
uz: Asosiy oynani maksimal darajada boshlash kerakmi.

source: Width of the main window
uz: Asosiy oynaning kengligi

source: The width of the main window.
uz: Asosiy oynaning kengligi.

source: Height of main window
uz: Asosiy oynaning balandligi

source: The height of the main window.
uz: Asosiy oynaning balandligi.

source: Width of the index and search pane
uz: Indeks va qidiruv panelining kengligi

source: The width of the index and search pane.
uz: Indeks va qidiruv panelining kengligi.

source: Width of the assistant window
uz: Yordamchi oynasining kengligi

source: The width of the assistant window.
uz: Yordamchi oynasining kengligi.

source: Height of assistant window
uz: Yordamchi oynaning balandligi

source: The height of the assistant window.
uz: Yordamchi oynaning balandligi.

source: Books disabled
uz: Kitoblar o'chirilgan

source: List of books disabled by the user.
uz: Foydalanuvchi tomonidan o'chirilgan kitoblar ro'yxati.

source: Group books by language
uz: Kitoblarni til bo'yicha guruhlash

source: Whether books should be grouped by programming language in the user interface.
uz: Kitoblarni foydalanuvchida dasturlash tili bo'yicha guruhlash kerakmi

source: Use system fonts
uz: Tizim shriftlaridan foydalaning

source: Use the system default fonts.
uz: Tizimning standart shriftlaridan foydalaning.

source: Font for text
uz: Matn uchun shrift

source: Font for text with variable width.
uz: O'zgaruvchan kenglikdagi matn uchun shrift.

source: Font for fixed width text
uz: Ruxsat etilgan kenglikdagi matn uchun shrift

source: Font for text with fixed width, such as code examples.
uz: Ruxsat etilgan kenglikdagi matn uchun shrift, masalan, kod misollari.

source: Book:
uz: Kitob:

source: Language: %s
uz: Til: %s

source: Language: Undefined
uz: Til: Aniqlanmagan

source: _Collapse All
uz: _Hammasini yig'ish

source: Book
uz: Kitob

source: Page
uz: Sahifa

source: Keyword
uz: Kalit so'z

source: Function
uz: Funktsiya

source: Struct
uz: Tuzulish

source: Type
uz: Turi

source: Property
uz: Xususiyat

source: Empty Page
uz: Bo'sh sahifa

source: Devhelp support
uz: Devhelp qo'llab-quvvatlash

source: Show API Documentation
uz: API texnik hujjatlarini ko'rsatish

source: translator-credits
uz: tarjimon-kreditlar

source: Devhelp Website
uz: Devhelp veb-sayti

source: Opens a new Devhelp window
uz: Yangi Devhelp oynasini ochish

source: Search for a keyword
uz: Kalit so'zni qidiring

source: KEYWORD
uz: KALIT SO'Z

source: Search and display any hit in the assistant window
uz: Yordamchi oynasida istalgan zarbani qidiring va ko'rsating

source: Display the version and exit
uz: Versiyani ko'rsating va chiqing

source: Quit any running Devhelp
uz: Barcha ishlayotgan Devhelp dasturidan chiqing

source: Devhelp — Assistant
uz: Devhelp - Yordamchi

source: Enabled
uz: Yoqilgan

source: Title
uz: Sarlavha

source: Preferences
uz: Afzalliklar

source: _Group by language
uz: _Til bo'yicha guruhlash

source: Book Shelf
uz: Kitob javoni

source: _Use system fonts
uz: _Tizim shriftlaridan foydalaning

source: _Variable width:
uz: _Oʻzgaruvchan kenglik:

source: _Fixed width:
uz: _Ruxsat etilgan kenglik:

source: Fonts
uz: Shriftlar

source: New _Window
uz: Yangi _Oyna

source: _Print
uz: _Chop etish

source: _Find
uz: _Topish

source: _Larger Text
uz: _Kattaroq matn

source: S_maller Text
uz: _Kichikroq matn

source: _Normal Size
uz: _O'rtacha o'lcham

source: _Preferences
uz: _Afzalliklar

source: _Keyboard Shortcuts
uz: _Klaviatura yorliqlari

source: _Help
uz: _Yordam

source: _About Devhelp
uz: _Devhelp haqida

source: Back
uz: Orqaga

source: Forward
uz: Oldinga

source: Toggle Side Panel
uz: Yon panelni almashtirish

source: New Tab
uz: Yangi tab

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Focus global search
uz: Global qidiruvga e'tibor qarating

# shortcut window
source: Find in current page
uz: Joriy sahifada toping

# shortcut window
source: Find the next match
uz: Keyingi moslikni toping

# shortcut window
source: Find the previous match
uz: Oldingi moslikni toping

# shortcut window
source: Open a new window
uz: Yangi oyna oching

# shortcut window
source: Open a new tab
uz: Yangi tab oching

# shortcut window
source: Toggle side panel visibility
uz: Yon panel ko'rinishini o'zgartirish

# shortcut window
source: Go back
uz: Ortga qaytish

# shortcut window
source: Go forward
uz: Olg'a yurish

# shortcut window
source: Print
uz: Chop etish

# shortcut window
source: Close the current window
uz: Joriy oynani yoping

# shortcut window
source: Close all windows
uz: Barcha oynalarni yoping

# shortcut window
source: Zoom
uz: Kattalashtirish

# shortcut window
source: Zoom in
uz: Kattalashtirish

# shortcut window
source: Zoom out
uz: Kichraytirish

# shortcut window
source: Reset Zoom
uz: Masshtabni tiklash
