Repository: nizomovasadbek/i10n
Catalog: gnome/43/epiphany.gnome-43.*.po
Languages: uz

source: Central European (_Windows-1250)
uz: Markaziy Yevropa (_Windows-1250)

source: Chinese Simplified (_GB18030)
uz: Xitoycha soddalashtirilgan (_GB18030)

source: Chinese Simplified (G_B2312)
uz: Xitoycha soddalashtirilgan (G_B2312)

source: Chinese Simplified (GB_K)
uz: Xitoycha soddalashtirilgan (GB_K)

source: Chinese Simplified (_HZ)
uz: Xitoycha soddalashtirilgan (_HZ)

source: Chinese Simplified (_ISO-2022-CN)
uz: Xitoycha soddalashtirilgan (_ISO-2022-CN)

source: Chinese Traditional (Big_5)
uz: An'anaviy xitoycha (Big_5)

source: Chinese Traditional (Big5-HK_SCS)
uz: An'anaviy xitoycha (Big5-HK_SCS)

source: Chinese Traditional (_EUC-TW)
uz: An'anaviy xitoycha (_EUC-TW)

source: Cyrillic (_IBM-855)
uz: Kirilcha (_IBM-855)

source: Cyrillic (I_SO-8859-5)
uz: Kirilcha (I_SO-8859-5)

source: Cyrillic (IS_O-IR-111)
uz: Kirilcha (IS_O-IR-111)

source: Cyrillic (_KOI8-R)
uz: Kirilcha (_KOI8-R)

source: Cyrillic (_MacCyrillic)
uz: Kirilcha (_MacCyrillic)

source: Cyrillic (_Windows-1251)
uz: Kirilcha (_Windows-1251)

source: Cyrillic/_Russian (IBM-866)
uz: Kirilcha/_Ruscha (IBM-866)

source: Greek (_ISO-8859-7)
uz: Yunoncha (_ISO-8859-7)

source: Greek (_MacGreek)
uz: Yunoncha (_MacGreek)

source: Greek (_Windows-1253)
uz: Yunoncha (_Windows-1253)

source: Hindi (Mac_Devanagari)
uz: Hind (Mac_Devanagari)

source: Hebrew (_IBM-862)
uz: Yahudiy (_IBM-862)

source: Hebrew (IS_O-8859-8-I)
uz: Yahudiycha (IS_O-8859-8-I)

source: Hebrew (_MacHebrew)
uz: Yahudiy (_MacHebrew)

source: Hebrew (_Windows-1255)
uz: Yahudiy (_Windows-1255)

source: Japanese (_EUC-JP)
uz: Yaponcha (_EUC-JP)

source: Japanese (_ISO-2022-JP)
uz: Yaponcha (_ISO-2022-JP)

source: Japanese (_Shift-JIS)
uz: Yaponcha (_Shift-JIS)

source: Korean (_EUC-KR)
uz: Koreyscha (_EUC-KR)

source: Korean (_ISO-2022-KR)
uz: Koreyscha (_ISO-2022-KR)

source: Korean (_JOHAB)
uz: Koreyscha (_JOHAB)

source: Korean (_UHC)
uz: Koreyscha (_UHC)

source: _Celtic (ISO-8859-14)
uz: _Keltcha (ISO-8859-14)

source: _Icelandic (MacIcelandic)
uz: _Islandcha (MacIcelandic)

source: _Nordic (ISO-8859-10)
uz: _Skandinavcha (ISO-8859-10)

source: _Persian (MacFarsi)
uz: _Forscha (MacFarsi)

source: Croatian (Mac_Croatian)
uz: Xorvatcha (Mac_Croatian)

source: _Romanian (MacRomanian)
uz: _Rumincha (MacRomanian)

source: R_omanian (ISO-8859-16)
uz: R_umincha (ISO-8859-16)

source: South _European (ISO-8859-3)
uz: Janubiy Yevropa (ISO-8859-3)

source: Thai (TIS-_620)
uz: Tayland (TIS-_620)

source: Thai (IS_O-8859-11)
uz: Tayland (IS_O-8859-11)

source: _Thai (Windows-874)
uz: _Tayland (Windows-874)

source: Turkish (_IBM-857)
uz: Turkcha (_IBM-857)

source: Turkish (I_SO-8859-9)
uz: Turkcha (I_SO-8859-9)

source: Turkish (_MacTurkish)
uz: Turkcha (_MacTurkish)

source: Turkish (_Windows-1254)
uz: Turkcha (_Windows-1254)

source: Unicode (UTF-_8)
uz: Unikod (UTF-_8)

source: Cyrillic/Ukrainian (_KOI8-U)
uz: Kirilcha/Ukraincha (_KOI8-U)

source: Cyrillic/Ukrainian (Mac_Ukrainian)
uz: Kirilcha/Ukraincha (Mac_Ukrainian)

source: Vietnamese (_TCVN)
uz: Vetnamcha (_TCVN)

source: Vietnamese (_VISCII)
uz: Vetnamcha (_VISCII)

source: Vietnamese (V_PS)
uz: Vetnamcha (V_PS)

source: Vietnamese (_Windows-1258)
uz: Vetnamcha (_Windows-1258)

source: Western (_IBM-850)
uz: Gʻarbiy (_IBM-850)

source: Western (_ISO-8859-1)
uz: Gʻarbiy (_ISO-8859-1)

source: Western (IS_O-8859-15)
uz: Gʻarbiy (IS_O-8859-15)

source: Western (_MacRoman)
uz: Gʻarbiy (_MacRoman)

source: Western (_Windows-1252)
uz: Gʻarbiy (_Windows-1252)

source: English (_US-ASCII)
uz: Inglizcha (_US-ASCII)

source: Unicode (UTF-_16 BE)
uz: Unikod (UTF-_16 BE)

source: Unicode (UTF-1_6 LE)
uz: Unikod (UTF-1_6 LE)

source: Unicode (UTF-_32 BE)
uz: Unikod (UTF-_32 BE)

source: Unicode (UTF-3_2 LE)
uz: Unikod (UTF-3_2 LE)

source: Unknown (%s)
uz: Noma'lum (%s)

source: Search wrapped back to the top
uz: Qidiruv yuqoriga qaytarildi

source: Type to search…
uz: Qidirish uchun yozing…

source: Find previous occurrence of the search string
uz: Qidiruv qatorining oldingi holatini toping

source: Find next occurrence of the search string
uz: Qidiruv qatorining keyingi takrorlanishini toping

source: %s is not a valid URI
uz: %s yaroqli URI emas

source: Open
uz: Ochish

source: Not No_w
uz: _Hozir emas

source: Do you want to save your password for “%s”?
uz: “%s” uchun parolingizni saqlamoqchimisiz?

source: Heads-up: this form is not secure. If you type your password, it will not be kept private.
uz: E'tibor: bu shakl xavfsiz emas. Agar parolingizni kiritsangiz, u maxfiy saqlanmaydi.

source: Web process crashed
uz: Veb-jarayon ishdan chiqdi

source: Web process terminated due to exceeding memory limit
uz: Xotira chegarasidan oshib ketganligi sababli veb-jarayon tugatildi

source: Web process terminated by API request
uz: Veb-jarayon API soʻrovi bilan tugatildi

source: The current page '%s' is unresponsive
uz: Joriy “%s” sahifasi javob bermayapti

source: _Wait
uz: _Kuting

source: _Kill
uz: _Uzish

source: Deny
uz: Rad etish

source: Allow
uz: Ruxsat berish

source: The page at %s wants to show desktop notifications.
uz: %s sahifasi desktop bildirishnomalarini ko‘rsatmoqchi.

source: The page at %s wants to know your location.
uz: %s sahifasi joylashuvingizni bilmoqchi.

source: The page at %s wants to use your microphone.
uz: %s sahifasi mikrofoningizdan foydalanmoqchi.

source: The page at %s wants to use your webcam.
uz: %s sahifasi veb-kamerangizdan foydalanmoqchi.

source: The page at %s wants to use your webcam and microphone.
uz: %s sahifasi veb-kamerangiz va mikrofoningizdan foydalanmoqchi.

source: Do you want to allow “%s” to use cookies while browsing “%s”?
uz: “%s” ga “%s”ni ko‘rib chiqishda cookie-fayllardan foydalanishga ruxsat bermoqchimisiz?

source: This will allow “%s” to track your activity.
uz: Bu “%s”ga faoliyatingizni kuzatish imkonini beradi.

source: Loading “%s”…
uz: “%s” yuklanmoqda…

source: Loading…
uz: Yuklanmoqda…

source: This website presented identification that belongs to a different website.
uz: Ushbu veb-sayt boshqa veb-saytga tegishli identifikatsiyani taqdim etdi.

source: This website’s identification is too old to trust. Check the date on your computer’s calendar.
uz: Ushbu veb-sayt identifikatoriga ishonish uchun juda eski. Kompyuteringizkalendaridagi sanani tekshiring.

source: This website’s identification was not issued by a trusted organization.
uz: Ushbu veb-sayt identifikatori ishonchli tashkilot tomonidan berilmagan.

source: This website’s identification could not be processed. It may be corrupted.
uz: Ushbu veb-sayt identifikatorini qayta ishlab bo'lmadi. U buzilgan bo'lishi mumkin.

source: This website’s identification has been revoked by the trusted organization that issued it.
uz: Ushbu veb-saytning identifikatsiyasi uni chiqargan ishonchli tashkilot tomonidan bekor qilingan.

source: This website’s identification cannot be trusted because it uses very weak encryption.
uz: Ushbu veb-sayt identifikatsiyasiga ishonib bo'lmaydi, chunki u juda zaif shifrlashdan foydalanadi.

source: This website’s identification is only valid for future dates. Check the date on your computer’s calendar.
uz: Ushbu veb-sayt identifikatori faqat kelajakdagi sanalar uchun amal qiladi.Kompyuteringiz taqvimidagi sanani tekshiring.

source: Problem Loading Page
uz: Sahifani yuklashda muammo

source: Unable to display this website
uz: Bu veb-saytni ko‘rsatib bo‘lmadi

source: The site at %s seems to be unavailable.
uz: %s manzilidagi sayt mavjud emas.

source: It may be temporarily inaccessible or moved to a new address. You may wish to verify that your internet connection is working correctly.
uz: Unga vaqtinchalik kirish imkoni bo'lmagan yoki yangi manzilga ko'chirilganbo'lishi mumkin. Internetga ulanishingiz to'g'ri ishlayotganini tekshirishingiz mumkin.

source: The precise error was: %s
uz: Aniq xato: %s

source: Oops! There may be a problem
uz: Voy! Muammo bo'lishi mumkin

source: The page %s may have caused Web to close unexpectedly.
uz: %s sahifasi Internetning kutilmaganda yopilishiga olib kelgan bo‘lishi mumkin.

source: If this happens again, please report the problem to the %s developers.
uz: Agar bu yana takrorlansa, muammo haqida %s dasturchiga xabar bering.

source: Problem Displaying Page
uz: Sahifani ko'rsatishda muammo

source: Oops!
uz: Voy!

source: Something went wrong while displaying this page. Please reload or visit a different page to continue.
uz: Ushbu sahifani ko‘rsatishda nimadir xato ketdi. Davom etish uchun qaytayuklang yoki boshqa sahifaga tashrif buyuring.

source: Unresponsive Page
uz: Javob bermaydigan sahifa

source: This page has been unresponsive for too long. Please reload or visit a different page to continue.
uz: Ushbu sahifa juda uzoq vaqtdan beri javob bermayapti. Davom etish uchun qaytayuklang yoki boshqa sahifaga tashrif buyuring.

source: Security Violation
uz: Xavfsizlik buzilishi

source: This Connection is Not Secure
uz: Bu ulanish xavfsiz emas

source: This does not look like the real %s. Attackers might be trying to steal or alter information going to or from this site.
uz: Bu haqiqiy %s ga oʻxshamaydi. Hujumchilar ushbu saytga yoki saytga kiradiganmaʼlumotlarni oʻgʻirlash yoki oʻzgartirishga urinayotgan boʻlishi mumkin.

source: Accept Risk and Proceed
uz: Xavfni qabul qiling va davom eting

source: Security Warning
uz: Xavfsizlik bo'yicha ogohlantirish

source: Unsafe website detected!
uz: Xavfli veb-sayt aniqlandi!

source: Visiting %s may harm your computer. This page appears to contain malicious code that could be downloaded to your computer without your consent.
uz: %s saytiga tashrif buyurish kompyuteringizga zarar etkazishi mumkin.Bu sahifada sizning roziligingizsiz kompyuteringizga yuklab olinadigan zararli kod mavjud.

source: You can learn more about harmful web content including viruses and other malicious code and how to protect your computer at %s.
uz: Siz zararli veb-kontent, jumladan viruslar va boshqa zararli kodlar vakompyuteringizni qanday himoya qilish haqida ko'proq ma'lumot olishingiz mumkin: %s.

source: Attackers on %s may trick you into doing something dangerous like installing software or revealing your personal information (for example, passwords, phone numbers, or credit cards).
uz: %s ga tajovuzkorlar sizni aldab, dasturiy ta'minotni o'rnatish yoki shaxsiyma'lumotlaringizni (masalan, parollar, telefon raqamlari yoki kredit kartalari)ochish kabi xavfli ishlarni amalga oshirishi mumkin.

source: You can find out more about social engineering (phishing) at %s or from %s.
uz: Ijtimoiy muhandislik (fishing) haqida ko'proq ma'lumotni %s sahifasida yoki %s dan topishingiz mumkin.

source: %s may contain harmful programs. Attackers might attempt to trick you into installing programs that harm your browsing experience (for example, by changing your homepage or showing extra ads on sites you visit).
uz: %s zararli dasturlarni o'z ichiga olishi mumkin. Buzg'unchilar siznialdashga urinib, brauzerni ko'rish tajribangizga zarar etkazadigan dasturlarnio'rnatishi mumkin (masalan, bosh sahifangizni o'zgartirish yoki tashrif buyurgansaytlarda qo'shimcha reklamalarni ko'rsatish orqali).

source: You can learn more about unwanted software at %s.
uz: Keraksiz dasturlar haqida koʻproq maʼlumotni %s sahifasida olishingiz mumkin.

source: %s could not be found.
uz: %s topilmadi

source: Please check the file name for capitalization or other typing errors. Also check if it has been moved, renamed, or deleted.
uz: Iltimos, fayl nomini katta harflar yoki boshqa yozish xatolari uchun tekshiring.Shuningdek, u koʻchirilgan, nomi oʻzgartirilgan yoki oʻchirilganligini tekshiring.

source: Technical information
uz: Texnik ma'lumotlar

source: Unspecified
uz: Aniqlanmagan

source: Downloads
uz: Yuklanishlar

source: Could not create a temporary directory in “%s”.
uz: “%s”da vaqtinchalik jild yaratib bo‘lmadi.

source: The file “%s” exists. Please move it out of the way.
uz: “%s” fayli mavjud. Iltimos, uni yo'ldan chetga surib qo'ying.

source: Failed to create directory “%s”.
uz: “%s” jildini yaratib bo‘lmadi.

source: Could not display help: %s
uz: Yordamni ko‘rsatib bo‘lmadi: %s

source: Today %I∶%M %p
uz: Bugun %I∶%M %p

source: Today %H∶%M
uz: Bugun %H∶%M

source: Yesterday %I∶%M %p
uz: Kecha %I∶%M %p

source: Yesterday %H∶%M
uz: Kecha %H∶%M

source: Unknown
uz: Noma'lum

source: Failed to get desktop filename for webapp id %s
uz: Webapp identifikatori %s uchun ish stoli fayl nomini olib bo‘lmadi

source: Failed to install desktop file %s:
uz: %s ish stoli faylini o‘rnatib bo‘lmadi:

source: Profile directory %s already exists
uz: %s profil jildi allaqachon mavjud

source: Cannot create SQLite connection. Close browser and try again.
uz: SQLite ulanishini yaratib bo'lmadi. Brauzerni yoping va qayta urinib ko'ring.

source: Browser password database could not be opened. Close browser and try again.
uz: Brauzer paroli bazasini ochib boʻlmadi. Brauzerni yoping va qaytadan urinib koʻring.

source: Password for %s in a form in %s
uz: %s shaklidagi %s uchun parol

source: Password in a form in %s
uz: %s shaklidagi parol

source: Failed to obtain storage credentials.
uz: Xotira hisob maʼlumotlarini olinmadi.

source: Please visit Firefox Sync and sign in again to continue syncing.
uz: Sinxronlashni davom ettirish uchun Firefox Sync-ga tashrif buyuring va tizimga qayta kiring.

source: The password of your Firefox account seems to have been changed.
uz: Firefox hisobingiz paroli o'zgartirilganga o'xshaydi.

source: Please visit Firefox Sync and sign in with the new password to continue syncing.
uz: Firefox Sync-ga tashrif buyuring va sinxronlashni davom ettirish uchunyangi parol bilan tizimga kiring.

source: Failed to obtain signed certificate.
uz: Imzolangan sertifikat olinmadi.

source: Could not find the sync secrets for the current sync user.
uz: Joriy sinxronlash foydalanuvchisi uchun sinxronlash kalitlarini topib bo‘lmadi.

source: The sync secrets for the current sync user are invalid.
uz: Joriy sinxronlash foydalanuvchisi uchun sinxronlash kaliti yaroqsiz.

source: The sync secrets of %s
uz: %s ning sinxronlash kalitlari

source: Failed to upload client record.
uz: Mijoz yozuvini yuklab bo‘lmadi.

source: Failed to upload crypto/keys record.
uz: Kripto/kalitlar yozuvini yuklab bo‘lmadi.

source: Failed to upload meta/global record.
uz: Meta/global rekord yuklanmadi.

source: Your Firefox Account uses storage version %d. Web only supports version %d.
uz: Firefox hisob qaydnomangiz %d saqlash versiyasidan foydalanadi. Internetfaqat %d versiyasini qo‘llab-quvvatlaydi.

source: Failed to verify storage version.
uz: Xotira versiyasini tekshirib bo‘lmadi.

source: Failed to upload device info
uz: Qurilma maʼlumotlarini yuklab boʻlmadi

source: Failed to retrieve the Sync Key
uz: Sinxronizatsiya kalitini olib bo‘lmadi

source: The certificate does not match this website
uz: Sertifikat ushbu veb-saytga mos kelmaydi

source: The signing certificate authority is not known
uz: Imzolovchi sertifikat organi noma'lum

source: The certificate contains errors
uz: Sertifikatda xatolar mavjud

source: The certificate has been revoked
uz: Sertifikat bekor qilindi

source: The certificate is signed using a weak signature algorithm
uz: Sertifikat zaif imzo algoritmi yordamida imzolanadi

source: The certificate activation time is still in the future
uz: Sertifikatni faollashtirish vaqti hali oldinda

source: The identity of this website has been verified.
uz: Ushbu veb-saytning identifikatori tasdiqlandi.

source: The identity of this website has not been verified.
uz: Ushbu veb-saytning identifikatori tasdiqlanmagan.

source: No problems have been detected with your connection.
uz: Ulanishingizda hech qanday muammo aniqlanmadi.

source: This certificate is valid. However, resources on this page were sent insecurely.
uz: Ushbu sertifikat amal qiladi. Biroq, bu sahifadagi resurslar xavfsiz tarzda yuborilgan.

source: %d second left
uz: %d soniya qoldi

source: %d minute left
uz: %d daqiqa qoldi

source: %d hour left
uz: %d soat qoldi

source: %d day left
uz: %d kun qoldi

source: %d week left
uz: %d hafta qoldi

source: %d month left
uz: %d oy qoldi

source: Finished
uz: Tugallandi

source: Moved or deleted
uz: Ko'chirildi yoki o'chirildi

source: Error downloading: %s
uz: Yuklab olishda xatolik yuz berdi: %s

source: All supported types
uz: Barcha qo'llab-quvvatlanadigan turlar

source: Web pages
uz: Veb-sahifalar

source: Images
uz: Rasmlar

source: All files
uz: Hamma fayllar

source: Cl_ear
uz: To_zalash

source: Paste and _Go
uz: Qo'yish va _O'tish

source: _Undo
uz: _Bekor qilish

source: _Redo
uz: _Qayta qilish

source: Show website security status and permissions
uz: Veb-sayt xavfsizligi holati va ruxsatnomalarini ko'rsatish

source: Search for websites, bookmarks, and open tabs
uz: Veb-saytlar, bookmarklar va ochiq tablarni qidiring

source: Toggle reader mode
uz: Oʻqish rejimini oʻzgartirish

source: This web site’s digital identification is not trusted. You may have connected to an attacker pretending to be %s.
uz: Ushbu veb-saytning raqamli identifikatori ishonchli emas.Siz oʻzini %s deb koʻrsatuvchi tajovuzkorga ulangan boʻlishingiz mumkin.

source: This site has no security. An attacker could see any information you send, or control the content that you see.
uz: Bu sayt hech qanday xavfsizlikka ega emas. Buzg'unchi siz yuborgan harqanday ma'lumotni ko'rishi yoki siz ko'rgan kontentni boshqarishi mumkin.

source: This web site did not properly secure your connection.
uz: Ushbu veb-sayt ulanishingizni to'g'ri himoya qilmagan.

source: Your connection seems to be secure.
uz: Ulanishingiz xavfsiz ko'rinadi.

source: _View Certificate…
uz: _Sertifikatni koʻrish…

source: Ask
uz: So'rang

source: Permissions
uz: Ruxsatlar

source: Advertisements
uz: Reklamalar

source: Location access
uz: Joylashuvga kirish

source: Microphone access
uz: Mikrofonga kirish

source: Webcam access
uz: Veb-kameraga kirish

source: Media autoplay
uz: Media avtomatik ijro

source: File is not a valid Epiphany bookmarks file: missing tags table
uz: Fayl haqiqiy Epiphany bookmarklar fayli emas: yetishmayotgan teglar jadvali

source: File is not a valid Epiphany bookmarks file: missing bookmarks table
uz: Fayl haqiqiy Epiphany bookmarklar fayli emas: yetishmayotgan bookmarklar jadvali

source: Firefox bookmarks database could not be opened. Close Firefox and try again.
uz: Firefox bookmarklari bazasini ochib bo'lmadi. Firefox-ni yoping va qaytadan urinib ko'ring.

source: Firefox bookmarks could not be retrieved!
uz: Firefox bookmarklarini olib bo'lmadi!

source: HTML bookmarks database could not be opened: %s
uz: HTML bookmarklar bazasini ochib bo‘lmadi: %s

source: HTML bookmarks database could not be read.
uz: HTML bookmarklar bazasini o‘qib bo‘lmadi.

source: HTML bookmarks database could not be parsed: %s
uz: HTML bookmarklar bazasini tahlil qilib bo‘lmadi: %s

source: Bookmarks file could not be parsed:
uz: Bookmarklar faylini tahlil qilib bo‘lmadi:

source: Favorites
uz: Sevimlilar

source: Mobile
uz: Mobil

source: Last synchronized: %s
uz: Oxirgi sinxronlangan: %s

source: Something went wrong, please try again later.
uz: Nimadir xato ketdi, keyinroq qayta urinib ko‘ring.

source: %u min
uz: %u daqiqa

source: It is not possible to modify history when in incognito mode.
uz: Inkognito rejimida tarixni o'zgartirish mumkin emas.

source: Clear browsing history?
uz: Brauzer tarixi tozalansinmi?

source: Clearing the browsing history will cause all history links to be permanently deleted.
uz: Brauzer tarixini tozalash barcha tarix havolalarini butunlay o'chirib tashlashga olib keladi.

source: FILE
uz: FAYL

source: Start an instance with user data read-only
uz: Faqat o'qish uchun foydalanuvchi ma'lumotlari bilan namunani boshlash

source: Start a private instance with separate user data
uz: Alohida foydalanuvchi ma'lumotlari bilan shaxsiy namunani boshlash

source: Start a private instance in web application mode
uz: Veb-ilova rejimida shaxsiy namunani ishga tushirish

source: Start a private instance for WebDriver control
uz: WebDriver boshqaruvi uchun shaxsiy namunani ishga tushirish

source: Custom profile directory for private instance
uz: Shaxsiy namuna uchun maxsus profil katalogi

source: Open a new tab
uz: Yangi tab ochish

source: Do you really want to remove this extension?
uz: Haqiqatan ham bu kengaytmani o'chirib tashlamoqchimisiz?

source: _Remove
uz: _O'chirish

source: Author
uz: Muallif

source: Version
uz: Versiya

source: Open Inspector for debugging Background Page
uz: Orqa fon sahifasini tuzatish uchun inspektorni ochish

source: Open File (manifest.json/xpi)
uz: Faylni ochish (manifest.json/xpi)

source: Re_do
uz: _Qaytarish

source: Cu_t
uz: _Kesish

source: _Copy
uz: _Nusxa olish

source: _Paste
uz: _Qo'yish

source: Select _All
uz: _Hammasini belgilash

source: S_end Link by Email…
uz: _Havolani elektron pochta orqali yuborish…

source: _Reload
uz: _Qayta yuklash

source: _Back
uz: _Orqaga

source: _Forward
uz: _Oldinga

source: Add Boo_kmark…
uz: Boo_kmark qo‘shish…

source: Open Link in New _Window
uz: Havolani yangi _oynada ochish

source: Open Link in New _Tab
uz: Havolani yangi _tabda ochish

source: _Save Link As…
uz: _Havolani boshqacha saqlash…

source: _Copy Link Address
uz: _Havola manzilini nusxalash

source: Copy I_mage Address
uz: _Rasm manzilini nusxalash

source: _Save Image As…
uz: _Rasmni boshqacha saqlash…

source: Set as _Wallpaper
uz: _Fon rasmi sifatida o'rnatish

source: _Take Screenshot…
uz: _Skrinshot olish…

source: _Page Source
uz: _Sahifa manbasi

source: Do you want to leave this website?
uz: Ushbu veb-saytni tark etishni xohlaysizmi?

source: A form you modified has not been submitted.
uz: Siz o'zgartirgan shakl yuborilmadi.

source: _Discard form
uz: _ Shaklni bekor qilish

source: %d download operation active
uz: %d yuklash operatsiyasi faol

source: View open tabs
uz: Ochiq tablarni ko'rish

source: Set Web as your default browser?
uz: Web standart brauzer sifatida belgilansinmi?

source: Set Epiphany Technology Preview as your default browser?
uz: Epiphany Technology Previewni standart brauzer sifatida belgilasinmi?

source: _Yes
uz: _Ha

source: There are multiple tabs open.
uz: Bir nechta tab ochiq.

source: If you close this window, all open tabs will be lost
uz: Agar siz ushbu oynani yopsangiz, barcha ochiq tablar yo'qoladi

source: Save Link As
uz: Havolani boshqacha saqlash

source: Save Image As
uz: Rasmni boshqacha saqlash

source: Cookies
uz: Cookie-fayllar

source: Local storage data
uz: Mahalliy saqlash ma'lumotlari

source: Offline web application cache
uz: Oflayn veb-ilova keshi

source: IndexedDB databases
uz: IndexedDB ma'lumotlar bazalari

source: WebSQL databases
uz: WebSQL ma'lumotlar bazalari

source: Plugins data
uz: Plagin ma'lumotlari

source: HSTS policies cache
uz: HSTS siyosatlari keshi

source: Intelligent Tracking Prevention data
uz: Intelligent Tracking Prevention ma'lumotlari

source: New search engine
uz: Yangi qidiruv tizimi

source: A_dd Search Engine…
uz: Qidiruv tizimini qo‘shish…

source: This field is required
uz: Ushbu qator to'ldirilishi shart

source: Address must start with either http:// or https://
uz: Manzil http:// yoki https:// bilan boshlanishi kerak

source: Address must contain the search term represented by %s
uz: Manzilda %s bilan ifodalangan qidiruv soʻzi boʻlishi kerak

source: Address should not contain the search term several times
uz: Manzilda bir necha marta qidiruv soʻzi boʻlmasligi kerak

source: Address is not a valid URI
uz: Manzil yaroqli URI emas

source: Address is not a valid URL. The address should look like https://www.example.com/search?q=%s
uz: Manzil yaroqsiz URL manzili. Manzil https://www.example.com/search?q=%s kabi ko‘rinishi kerak
