Repository: nizomovasadbek/i10n
Catalog: gnome/43/epiphany.gnome-43.*.po
Languages: uz

source: This shortcut is already used.
uz: Bu qisqartma allaqachon ishlatilgan.

source: Search shortcuts must not contain any space.
uz: Qidiruv qisqartmalarida bo'sh joy bo'lmasligi kerak.

source: Search shortcuts should start with a symbol such as !, # or @.
uz: Qidiruv qisqartmalari !, # yoki @ kabi belgi bilan boshlanishi kerak.

source: A name is required
uz: Nom talab qilinadi

source: This search engine already exists
uz: Bu qidiruv tizimi allaqachon mavjud

source: This will clear all locally stored passwords, and can not be undone.
uz: Bu barcha mahalliy saqlangan parollarni oʻchirib tashlaydi va buni ortga qaytarib boʻlmaydi.

source: _Delete
uz: _Oʻchirish

source: Light
uz: Yorug'

source: Dark
uz: Qorong'i

source: Add Language
uz: Til qo'shish

source: System language (%s)
uz: Tizim tillari (%s)

source: Web Application Icon
uz: Veb ilova ikonkasi

source: Supported Image Files
uz: Qo'llab-quvvatlanadigan rasm fayllari

source: Executes only the n-th migration step
uz: Faqat n-chi migratsiya bosqichini bajaradi

source: Specifies the required version for the migrator
uz: Migrator uchun kerakli versiyani belgilaydi

source: Specifies the profile where the migrator should run
uz: Migrator ishga tushadigan profilni belgilaydi

source: Web profile migrator
uz: Veb-profil migrator

source: View open pages
uz: Ochiq sahifalarni ko'rish

source: _Address
uz: _Manzil

source: Tags
uz: Teglar

source: All
uz: Hammasi

source: Bookmark some webpages to view them here.
uz: Bu yerda koʻrish uchun baʼzi veb-sahifalarni belgilang.

source: Website Data
uz: Veb-sayt ma'lumotlari

source: There is no Website Data
uz: Veb-sayt ma'lumotlari yo'q

source: Website data will be listed here
uz: Veb-sayt ma'lumotlari bu yerda ko'rsatiladi

source: Clear selected website data:
uz: Tanlangan veb-sayt ma'lumotlarini tozalash:

source: You cannot undo this action. The data you are choosing to clear will be removed forever.
uz: Siz bu amalni bekor qila olmaysiz. Siz oʻchirishni tanlaganmaʼlumotlaringiz butunlay oʻchirib tashlanadi.

source: Try a different search
uz: Boshqa qidiruvni sinab ko'ring

source: Text Encoding
uz: Matnni kodlash

source: Use the encoding specified by the document
uz: Hujjatda ko'rsatilgan kodlashdan foydalaning

source: Show all…
uz: Hammasini ko'rish…

source: Sign in with your Firefox account to sync your data with GNOME Web and Firefox on other computers. GNOME Web is not Firefox and is not produced or endorsed by Mozilla.
uz: Maʼlumotlaringizni boshqa kompyuterlarda GNOME Web va Firefox bilan sinxronlashtirishuchun Firefox hisob qaydnomangiz bilan kiring. GNOME Web Firefox emas va Mozillatomonidan ishlab chiqarilmagan yoki tasdiqlanmagan.

source: Logged in
uz: Tizimga kirgan

source: Sync Options
uz: Sinxronizatsiya parametrlari

source: S_ynced tabs
uz: Sinxronlangan tablar

source: Frequency
uz: Chastotasi

source: Sync _now
uz: Hozir Sinxronlash

source: Device name
uz: Qurilma nomi

source: _Change
uz: _O'zgartirish

source: History
uz: Tarix

source: The History is Empty
uz: Tarix bo'sh

source: Visited pages will be listed here
uz: Tashrif buyurilgan sahifalar shu yerda ko‘rsatiladi

source: Reload _All Tabs
uz: _Barcha tablarni qayta yuklash

source: _Duplicate
uz: _Dublikat

source: P_in Tab
uz: Tabni qadash

source: Unp_in Tab
uz: Tabni olib tashlash

source: _Close
uz: _Yopish

# tooltip
source: Zoom Out
uz: Kichraytirish

source: Restore Zoom
uz: Masshtabni tiklash

# tooltip
source: Zoom In
uz: Kattalashtirish

source: _New Window
uz: _Yangi oyna

source: Reopen Closed _Tab
uz: Yopiq _tabni qayta ochish

source: I_mport and Export
uz: Import va Eksport

source: Install Site as Web _Application…
uz: Saytni veb-ilova sifatida o'rnatish…

source: Open Appli_cation Manager
uz: Ilovalar menejerini ochish

source: _Keyboard Shortcuts
uz: _Klaviatura yorliqlari

source: _Help
uz: _Yordam

source: Passwords
uz: Parollar

source: Saved passwords will be listed here
uz: Saqlangan parollar shu yerda ko'rsatiladi

source: Appearance
uz: Tashqi ko'rinish

source: Fonts
uz: Shriftlar

source: Sans serif font
uz: Sans serif shrift

source: Serif font
uz: Serif shrifti

source: Monospace font
uz: Monospace shrifti

source: Reader Mode
uz: O'qish rejimi

source: Color Scheme
uz: Rang sxemasi

source: Style
uz: Uslub

source: General
uz: Umumiy

source: Web Application
uz: Veb ilova

source: _Icon
uz: _Ikonka

source: _Title
uz: _Sarlavha

source: _Manage Additional URLs
uz: _Qo‘shimcha URL manzillarni boshqarish

source: Block _Advertisements
uz: _Reklamalarni bloklash

source: Most _Visited Pages
uz: Eng ko'p tashrif buyurilgan sahifalar

source: _Custom
uz: _Maxsus

source: Search Engines
uz: Qidiruv tizimlari

source: Session
uz: Sessiya

source: Start in _Incognito Mode
uz: Inkognito rejimida boshlash

source: _Restore Tabs on Startup
uz: _Ishga tushirishda tablarni tiklash

source: Browsing
uz: Ko‘rilmoqda

source: Mouse _Gestures
uz: Sichqoncha _Imo-ishoralar

source: S_witch Immediately to New Tabs
uz: Hozir yangi tablarga o'tish

source: _Spell Checking
uz: _Imlo tekshirish

source: Privacy
uz: Maxfiylik

source: Block Dangerous Web_sites
uz: Xavfli veb-saytlarni bloklash

source: Web Tracking
uz: Veb-kuzatuv

source: Allow websites to store cookies, databases, and local storage data.
uz: Veb-saytlarga cookie-fayllar, ma'lumotlar bazalari va mahalliy saqlashma'lumotlarini saqlashga ruxsat bering.

source: _Website Data Storage
uz: _Veb-sayt ma'lumotlarini saqlash

source: Search Suggestions
uz: Qidiruv takliflari

source: Enable search suggestions in the URL entry.
uz: URL kiritishda qidiruv takliflarini yoqing.

source: _Google Search Suggestions
uz: Google qidiruv bo'yicha takliflar

source: Personal Data
uz: Shaxsiy malumot

source: Clear Website _Data
uz: Veb-sayt _Ma'lumotlarini tozalash

source: Name
uz: Nomi

source: Address
uz: Manzil

source: Shortcut
uz: Yorliq

source: To determine the search address, perform a search using the search engine that you want to add and replace the search term with %s.
uz: Qidiruv manzilini aniqlash uchun siz qo'shmoqchi bo'lgan qidiruv tizimiyordamida qidiruvni amalga oshiring va qidiruv so'zini %s bilan almashtiring.

source: R_emove Search Engine
uz: Qidiruv tizimini o'chirish

# shortcut window
source: New incognito window
uz: Yangi inkognito oynasi

# shortcut window
source: Take Screenshot
uz: Skrinshot olish

# shortcut window
source: Quit
uz: Chiqish

# shortcut window
source: Shortcuts
uz: Qisqa klavishlar

# shortcut window
source: Reload bypassing cache
uz: Keshni chetlab o'tib qayta yuklash

# shortcut window
source: Miscellaneous
uz: Turli xil

# shortcut window
source: Web application
uz: Veb ilova

# shortcut window
source: Install site as web application
uz: Saytni veb-ilova sifatida o'rnatish

# shortcut window
source: Zoom in
uz: Kattalashtirish

# shortcut window
source: Zoom out
uz: Kichraytirish

# shortcut window
source: Reset zoom
uz: Masshtabni tiklash

# shortcut window
source: Toggle inspector
uz: Inspektorni almashtirish

# shortcut window
source: Toggle reader mode
uz: Oʻqish rejimini oʻzgartirish

# shortcut window
source: Redo
uz: Qaytarish

# shortcut window
source: Select page URL
uz: Sahifa URL manzilini tanlang

# shortcut window
source: Search with default search engine
uz: Standart qidiruv tizimi bilan qidirish

# shortcut window
source: Next find result
uz: Keyingi topilgan natija

# shortcut window
source: Previous find result
uz: Oldingi topilgan natija

source: Synced Tabs
uz: Sinxronlangan tablar

source: Below are the synced open tabs of your other devices that use Firefox Sync with this account. Open a tab by double clicking its name (tabs under Local Tabs cannot be opened).
uz: Quyida ushbu hisob bilan Firefox Sync ishlatadigan boshqa qurilmalaringizningsinxronlangan ochiq tablari mavjud. Yorliq nomini ikki marta bosish orqali ochish(Mahalliy tablar ostidagi tablarni ochib boʻlmaydi).

source: A URL that starts with any of the additional URLs will be opened by the web application. If you omit the URL scheme, the one from the currently loaded URL will be used.
uz: Har qanday qo'shimcha URL bilan boshlanadigan URL veb-ilova tomonidan ochiladi.Agar URL sxemasini o'tkazib yuborsangiz, joriy yuklangan URL-dan foydalaniladi.

source: Add new URL
uz: Yangi URL qo'shish

source: No Extensions Installed
uz: Kengaytmalar o'rnatilmagan

source: Add some extensions to display them here.
uz: Bu yerda ko‘rsatish uchun ba’zi kengaytmalar qo‘shing.

source: The install_token is required for the Install() method
uz: Install_token Install() usuli uchun talab qilinadi

source: The url passed was not valid: ‘%s’
uz: O‘tkazilgan url noto‘g‘ri: ‘%s’

source: The name passed was not valid
uz: O'tkazilgan nom noto'g'ri

source: Installing the web application ‘%s’ (%s) failed: %s
uz: “%s” (%s) veb-ilovasini o‘rnatib bo‘lmadi: %s

source: The desktop file ID passed ‘%s’ was not valid
uz: Ish stoli fayl identifikatori ‘%s’dan o‘tgani noto‘g‘ri

source: The web application ‘%s’ does not exist
uz: “%s” veb-ilovasi mavjud emas

source: The web application ‘%s’ could not be deleted
uz: “%s” veb-ilovasini o‘chirib bo‘lmadi

source: Options for %s
uz: %s uchun parametrlar

source: Ch_oose File
uz: Faylni tanlang

source: Bookmarks successfully imported!
uz: Bookmarklar muvaffaqiyatli import qilindi!

source: Import Bookmarks
uz: Bookmarklarni import qilish

source: Bookmarks successfully exported!
uz: Bookmarklar muvaffaqiyatli eksport qilindi!

source: Passwords successfully imported!
uz: Parollar muvaffaqiyatli import qilindi!

source: A simple, clean, beautiful view of the web. Powered by WebKitGTK %d.%d.%d
uz: Internetning oddiy, toza va chiroyli ko'rinishi. WebKitGTK %d.%d.%d tomonidan quvvatlanadi

source: Website
uz: Veb-sayt

source: translator-credits
uz: Otabek Ismoilov <ismoilovdev@gmail.com>

source: Do you want to reload this website?
uz: Ushbu veb-saytni qayta yuklashni xohlaysizmi?

source: The application “%s” is ready to be used
uz: “%s” ilovasi foydalanishga tayyor

source: The application “%s” could not be created: %s
uz: “%s” ilovasini yaratib bo‘lmadi: %s

source: Launch
uz: Ishga tushirish

source: A web application named “%s” already exists. Do you want to replace it?
uz: “%s” nomli veb-ilova allaqachon mavjud. Uni almashtirmoqchimisiz?

source: Replace
uz: O'zgartirish

source: Pressing F7 turns caret browsing on or off. This feature places a moveable cursor in web pages, allowing you to move around with your keyboard. Do you want to enable caret browsing?
uz: F7 tugmachasini bosish karetlarni ko'rishni yoqadi yoki o'chiradi. Bu xususiyatveb-sahifalarda harakatlanuvchi kursorni joylashtiradi, bu sizga klaviatura yordamidaharakatlanish imkonini beradi. Karetlarni ko'rishni yoqmoqchimisiz?
