Repository: nizomovasadbek/i10n
Catalog: gnome/43/epiphany.gnome-43.*.po
Languages: uz

source: Web
uz: Veb

source: The web browser for GNOME, featuring tight integration with the desktop and a simple and intuitive user interface that allows you to focus on your web pages. If you’re looking for a simple, clean, beautiful view of the web, this is the browser for you.
uz: GNOME uchun veb-brauzer ish stoli bilan chambarchas integratsiyaga ega vaveb-sahifalaringizga e'tiboringizni qaratish imkonini beruvchi sodda va intuitivfoydalanuvchi interfeysi. Agar siz Internetning sodda, toza va chiroyli ko'rinishiniqidirmoqchi bo'lsangiz, bu siz uchun brauzer.

source: Web is often referred to by its code name, Epiphany.
uz: Veb ko'pincha uning kod nomi bilan ataladi, Epiphany.

source: The GNOME Project
uz: GNOME loyihasi

source: Web Browser
uz: Veb brauzer

source: Browse the web
uz: Internetni ko'rib chiqing

source: Browse with caret
uz: Karet bilan ko'rib chiqing

source: Home page
uz: Bosh sahifa

source: Name of the search engine selected by default.
uz: Standart bo'yicha tanlangan qidiruv tizimining nomi.

source: Deprecated. Please use search-engine-providers instead.
uz: Eskirgan. Buning oʻrniga qidiruv tizimi provayderlaridan foydalaning.

source: [ {'name': <'DuckDuckGo'>, 'url': <'https://duckduckgo.com/?q=%s&t=epiphany'>, 'bang': <'!ddg'>}, {'name': <'Google'>, 'url': <'https://www.google.com/search?q=%s'>, 'bang': <'!g'>}, {'name': <'Bing'>, 'url': <'https://www.bing.com/search?q=%s'>, 'bang': <'!b'>} ]
uz: [ {'nomi': <'DuckDuckGo'>, 'url': <'https://duckduckgo.com/?q=%s&t=epiphany'>, 'bang': <'!ddg'>}, {'nomi': <'Google'>, 'url': <'https://www.google.com/search?q=%s'>, 'bang': <'!g'>}, {'nomi': <'Bing'>, 'url': <'https://www.bing.com/search?q=%s'>, 'bang': <'!b'>} ]

source: List of the search engines. It is an array of vardicts with each vardict corresponding to a search engine, and with the following supported keys: "name" is the name of the search engine. "url" is the search URL with the search term replaced with %s. "bang" is the bang (shortcut word) of the search engine.
uz: Qidiruv mexanizmlari ro'yxati. Bu har bir qidiruv tizimiga mos keladigan va quyidagiqo'llab-quvvatlanadigan kalitlarga ega bo'lgan vardiktlar massivi: "name" - qidiruvtizimining nomi. "url" - qidiruv. Qidiruv so'zi %s bilan almashtirilgan URL manzili."bang" qidiruv tizimining ishlamasligi (yorliq so'zi).

source: Enable Google Search Suggestions
uz: Google Qidiruv takliflarini yoqish

source: Whether to show Google Search Suggestion in url entry popdown.
uz: Google Qidiruv taklifi url yozuvi qalqib chiquvchi oynasida ko'rsatilsinmi.

source: Force new windows to be opened in tabs
uz: Yorliqlarda yangi oynalarni ochishga majbur qiling

source: Force new window requests to be opened in tabs instead of using a new window.
uz: Yangi oynadan foydalanish o'rniga yangi oyna so'rovlarini tablarda ochishga majburlang.

source: Whether to automatically restore the last session
uz: Oxirgi seansni avtomatik ravishda tiklash kerakmi

source: Defines how the session will be restored during startup. Allowed values are “always” (the previous state of the application is always restored) and “crashed” (the session is only restored if the application crashes).
uz: Ishga tushirish vaqtida sessiya qanday tiklanishini belgilaydi. Ruxsat berilganqiymatlar ”har doim” (ilovaning oldingi holati har doim tiklanadi) va ”halokatga uchragan”(seans faqat dastur ishlamay qolsa tiklanadi).

source: Whether to delay loading of tabs that are not immediately visible on session restore
uz: Seansni tiklashda darhol ko'rinmaydigan yorliqlarni yuklashni kechiktirish kerakmi

source: When this option is set to true, tabs will not start loading until the user switches to them, upon session restore.
uz: Ushbu parametr yoqilgan bo'lsa, seans qayta tiklangandan so'ng foydalanuvchiularga o'tmaguncha yorliqlar yuklanmaydi.

source: List of adblock filters
uz: Adblock filtrlari ro'yxati

source: List of URLs with content filtering rules in JSON format to be used by the ad blocker.
uz: Reklamani bloklovchi tomonidan foydalaniladigan JSON formatidagi kontentnifiltrlash qoidalariga ega URL manzillar ro'yxati.

source: Whether to ask for setting browser as default
uz: Brauzerni standart sifatida sozlashni so'rash kerakmi

source: When this option is set to true, browser will ask for being default if it is not already set.
uz: Ushbu parametr yoqilgan bo'lsa, brauzer hali o'rnatilmagan bo'lsa, standart bo'lishini so'raydi.

source: Start in incognito mode
uz: Inkognito rejimida boshlash

source: When this option is set to true, browser will always start in incognito mode
uz: Ushbu parametr parametr yoqilgan bo'lsa brauzer har doim inkognito rejimida ishga tushadi

source: Active clear data items.
uz: Faol toza ma'lumotlar elementlari.

source: Selection (bitmask) which clear data items should be active by default. 1 = Cookies, 2 = HTTP disk cache, 4 = Local storage data, 8 = Offline web application cache, 16 = IndexDB databases, 32 = WebSQL databases, 64 = Plugins data, 128 = HSTS policies cache, 256 = Intelligent Tracking Prevention data.
uz: Ma'lumotlar elementlarini tozalash standart bo'yicha faol bo'lishi kerakbo'lgan tanlov (bitmask). 1 = Cookie fayllari, 2 = HTTP disk keshi, 4 = Mahalliy saqlash ma'lumotlari,8 = Oflayn veb-ilova keshi, 16 = IndexDB ma'lumotlar bazalari, 32 = WebSQL ma'lumotlar bazalari,64 = Plaginlar ma'lumotlari, 128 = HSTS siyosatlari keshi, 256 = Intelligent Tracking Preventionma'lumotlari.

source: Expand tabs size to fill the available space on the tabs bar.
uz: Yorliqlar panelidagi bo'sh joyni to'ldirish uchun yorliqlar hajmini kengaytirish

source: If enabled the tabs will expand to use the entire available space in the tabs bar. This setting is ignored in Pantheon desktop.
uz: Agar yoqilgan bo'lsa, tablar tabbar panelidagi to'liq bo'sh joydan foydalanishuchun kengayadi. Pantheon ish stolida bu sozlama e'tiborga olinmaydi.

source: The visibility policy for the tabs bar.
uz: Yorliqlar paneli uchun ko'rinish siyosati.

source: Controls when the tabs bar is shown. Possible values are “always” (the tabs bar is always shown), “more-than-one” (the tabs bar is only shown if there’s two or more tabs) and “never” (the tabs bar is never shown). This setting is ignored in Pantheon desktop, and “always” value is used.
uz: Tablar paneli ko'rsatilganda boshqaradi. Mumkin qiymatlar ”har doim” (tablarpaneli doimo ko'rsatiladi), ”birdan ortiq” (tablar paneli faqat ikkita yoki undanortiq tablar mavjud bo'lganda ko'rsatiladi) va ”hech qachon” (tablar paneli hechqachon ko'rsatilmaydi). Bu sozlama Pantheon ish stolida e'tiborga olinmaydi va ”har doim”qiymati ishlatiladi.

source: Keep window open when closing last tab
uz: Oxirgi tabni yopayotganda oynani ochiq tutish

source: If enabled application window is kept open when closing the last tab.
uz: Agar yoqilgan bo'lsa, oxirgi tab yopilganda dastur oynasi ochiq qoladi.

source: Reader mode article font style.
uz: O'quvchi rejimi maqola shrift uslubi.

source: Chooses the style of the main body text for articles in reader mode. Possible values are “sans” and “serif”.
uz: O'quvchi rejimida maqolalar uchun asosiy matn uslubini tanlaydi. Mumkinqiymatlar ”sans” va ”serif”.

source: Reader mode color scheme.
uz: O'quvchi rejimining rang sxemasi.

source: Selects the style of colors for articles displayed in reader mode. Possible values are “light” (dark text on light background) and “dark” (light text on dark background). This setting is ignored on systems that provide a system-wide dark style preference, such as GNOME 42 and newer.
uz: O'quvchi rejimida ko'rsatiladigan maqolalar uchun ranglar uslubini tanlaydiMumkin bo'lgan qiymatlar ”ochiq” (ochiq fonda quyuq matn) va “qorong'i“ (quyuqfonda ochiq rangli matn). Bu sozlama butun tizimni ta'minlaydigan tizimlarda e'tiborgaolinmaydi. GNOME 42 va undan keyingi versiyalar kabi qorong'u uslub afzalligi.

source: Minimum font size
uz: Minimal shrift o'chami

source: Use GNOME font settings.
uz: GNOME shrift sozlamalaridan foydalaning.

source: Custom sans-serif font
uz: Maxsus sans-serif shrifti

source: A value to be used to override sans-serif desktop font when use-gnome-fonts is set.
uz: Gnome-shriftlardan foydalanish o'rnatilganda sans-serif ish stoli shriftinibekor qilish uchun foydalaniladigan qiymat.

source: Custom serif font
uz: Maxsus serif shrifti

source: A value to be used to override serif desktop font when use-gnome-fonts is set.
uz: Gnome-shriftlardan foydalanish o'rnatilganda serif ish stoli shriftinibekor qilish uchun foydalaniladigan qiymat.

source: Custom monospace font
uz: Maxsus monospace shrifti

source: A value to be used to override monospace desktop font when use-gnome-fonts is set.
uz: Gnome-shriftlardan foydalanish o'rnatilganda monospace ish stoli shriftinibekor qilish uchun foydalaniladigan qiymat.

source: Use a custom CSS
uz: Maxsus CSS dan foydalanish

source: Use a custom CSS file to modify websites own CSS.
uz: Veb-saytlarning CSS-ni o'zgartirish uchun maxsus CSS faylidan foydalaning.

source: Use a custom JS
uz: Maxsus JS dan foydalanish

source: Use a custom JS file to modify websites.
uz: Veb-saytlarni o'zgartirish uchun maxsus JS faylidan foydalaning.

source: Enable spell checking
uz: Imlo tekshiruvini yoqish

source: Spell check any text typed in editable areas.
uz: Tahrirlanadigan maydonlarga kiritilgan har qanday matnning imlo tekshiruvi.

source: Default encoding
uz: Standart kodlash

source: Default encoding. Accepted values are the ones WebKitGTK can understand.
uz: Standart kodlash. Qabul qilingan qiymatlar WebKitGTK tushuna oladigan qiymatlardir.

source: Languages
uz: Tillar

source: Preferred languages. Array of locale codes or “system” to use current locale.
uz: Afzal tillar. Joriy tildan foydalanish uchun mahalliy kodlar qatori yoki ”tizim”.

source: Allow popups
uz: Qalqib chiquvchi oynalarga ruxsat berish

source: Allow sites to open new windows using JavaScript (if JavaScript is enabled).
uz: Saytlarga JavaScript yordamida yangi oyna ochishga ruxsat bering (agar JavaScript yoqilgan boʻlsa).

source: String that will be used as user agent, to identify the browser to the web servers.
uz: Veb-serverlarga brauzerni aniqlash uchun foydalanuvchi agenti sifatida foydalaniladigan string.

source: Whether to block the embedded advertisements that web pages might want to show.
uz: Veb-sahifalar ko'rsatmoqchi bo'lgan o'rnatilgan reklamalarni bloklash kerakmi.

source: Remember passwords
uz: Parollarni eslab qolish

source: Enable site-specific quirks
uz: Saytga xos nosozliklarni yoqing

source: Enable quirks to make specific websites work better. You might want to disable this setting if debugging a specific issue.
uz: Muayyan veb-saytlarning ishlashini yaxshilash uchun g'ayrioddiy xususiyatlarniyoqing. Muayyan muammoni tuzatishda ushbu sozlamani o'chirib qo'yishingiz mumkin.

source: Enable safe browsing
uz: Xavfsiz ko'rishni yoqish

source: Whether to enable safe browsing. Safe browsing operates via Google Safe Browsing API v4.
uz: Xavfsiz koʻrishni yoqish kerakmi. Xavfsiz koʻrish Google Safe Browsing API v4 orqali ishlaydi.

source: Enable Intelligent Tracking Prevention (ITP)
uz: Intelligent Tracking Prevention (ITP) funksiyasini yoqish

source: Whether to enable Intelligent Tracking Prevention.
uz: Intelligent Tracking Prevention funksiyasi yoqiladimi.

source: Allow websites to store local website data
uz: Veb-saytlarga mahalliy veb-sayt ma'lumotlarini saqlashga ruxsat bering

source: Whether to allow websites to store cookies, local storage data, and IndexedDB databases. Disabling this will break many websites.
uz: Veb-saytlarga cookie-fayllarni, mahalliy saqlash ma'lumotlarini vaIndexedDB ma'lumotlar bazalarini saqlashga ruxsat berish kerakmi. Bunio'chirib qo'yish ko'plab veb-saytlarni buzadi.

source: Default zoom level for new pages
uz: Yangi sahifalar uchun standart kattalashtirish darajasi

source: Whether to automatically search the web when something that does not look like a URL is entered in the address bar. If this setting is disabled, everything will be loaded as a URL unless a search engine is explicitly selected from the dropdown menu.
uz: Manzil satriga URL manziliga oʻxshamaydigan biror narsa kiritilganda avtomatikravishda internetni qidirish kerakmi. Agar bu sozlama oʻchirilgan boʻlsa, ochiladiganmenyudan qidiruv tizimi aniq tanlanmaguncha hamma narsa URL sifatida yuklanadi.

source: Enable mouse gestures
uz: Sichqoncha ishoralarini yoqish

source: Whether to enable mouse gestures. Mouse gestures are based on Opera’s behaviour and are activated using the middle mouse button + gesture.
uz: Sichqoncha imo-ishoralarini yoqish kerakmi. Sichqoncha imo-ishoralariOpera xatti-harakatlariga asoslanadi va sichqonchaning o'rta tugmasi + ishorasiyordamida faollashtiriladi.

source: Keep track of last upload directory
uz: Oxirgi yuklash jildingizni kuzatib boring

source: Keep track of last download directory
uz: Oxirgi yuklab olish jildingizni kuzatib boring

source: Hardware acceleration policy
uz: Qurilmani tezlashtirish siyosati

source: Whether to enable hardware acceleration. Possible values are “on-demand”, “always”, and “never”. Hardware acceleration may be required to achieve acceptable performance on embedded devices, but increases memory usage requirements and could expose severe hardware-specific graphics driver bugs. When the policy is “on-demand”, hardware acceleration will be used only when required to display 3D transforms.
uz: Qurilma tezlashuvini yoqish kerakmi. Mumkin qiymatlar “talab bo'yicha“, “har doim“va “hech qachon“. O'rnatilgan qurilmalarda maqbul ishlashga erishish uchun qurilamtezlashuvi talab qilinishi mumkin, lekin xotiradan foydalanish talablarini oshiradiva jiddiy qurilmaga xos grafiklarni ko'rsatishi mumkin. drayver xatolari. Siyosat“talab boʻyicha” boʻlsa, qurilma tezlashuvi faqat 3D oʻzgarishlarni koʻrsatishuchun kerak boʻlganda qoʻllaniladi.

source: Always ask for download directory
uz: Har doim yuklab olish jildini so'rash

source: Whether to present a directory chooser dialog for every download.
uz: Har bir yuklab olish uchun jild tanlash dialogini taqdim etish kerakmi.

source: Whether to automatically switch to a new open tab.
uz: Yangi ochiq tabga avtomatik ravishda o'tish kerakmi.

source: Whether to enable WebExtensions. WebExtensions is a cross-browser system for extensions.
uz: WebExtensions-ni yoqish kerakmi. WebExtensions kengaytmalar uchun oʻzaro brauzer tizimidir.

source: Indicates which WebExtensions are set to active.
uz: Qaysi WebExtension faol qilib o'rnatilganligini ko'rsatadi.

source: Web application additional URLs
uz: Veb-ilovaning qo'shimcha URL manzillari

source: The list of URLs that should be opened by the web application
uz: Veb-ilova tomonidan ochilishi kerak bo'lgan URL manzillar ro'yxati

source: Show navigation buttons in WebApp
uz: WebApp ilovasida navigatsiya tugmalarini ko‘rsatish

source: Whether to show buttons for navigation in WebApp.
uz: WebApp ilovasida navigatsiya tugmalarini ko'rsatish kerakmi.

source: If enabled, application continues running in the background after closing the window.
uz: Agar yoqilgan bo'lsa, dastur oynani yopgandan keyin fonda ishlashni davom ettiradi.

source: WebApp is system-wide
uz: WebApp butun tizimga tegishli

source: If enabled, application cannot be edited or removed.
uz: Agar yoqilgan bo'lsa, ilovani tahrirlash yoki olib tashlash mumkin emas.

source: The downloads folder
uz: Yuklab olish jildi

source: Window position
uz: Oyna holati

source: The position to use for a new window that is not restored from a previous session.
uz: Oldingi seansdan tiklanmagan yangi oyna uchun foydalanish pozitsiyasi.

source: Window size
uz: Oyna o'chami

source: The size to use for a new window that is not restored from a previous session.
uz: Oldingi seansdan tiklanmagan yangi oyna uchun foydalaniladigan o'lcham.

source: Is maximized
uz: Maksimallashtiriladi

source: Whether a new window that is not restored from a previous session should be initially maximized.
uz: Oldingi seansdan tiklanmagan yangi oynani dastlab maksimal darajaga ko'tarish kerakmi.

source: Disable forward and back buttons
uz: Oldinga va orqaga tugmalarini o'chirish

source: If set to “true”, forward and back buttons are disabled, preventing users from accessing immediate browser history
uz: Agar yoqilgan bo'lsa, oldinga va orqaga tugmalari o'chirib qo'yiladi, bufoydalanuvchilarning darhol brauzer tarixiga kirishiga to'sqinlik qiladi

source: Firefox Sync Token Server URL
uz: Firefox Sync Token Server URL manzili

source: URL to a custom Firefox Sync token server.
uz: Maxsus Firefox Sync token serveriga URL.

source: URL to a custom Firefox Sync accounts server.
uz: Maxsus Firefox Sync hisoblari serveriga URL.

source: Currently signed in sync user
uz: Hozirda sinxronlangan foydalanuvchi tizimga kirgan

source: The email linked to the Firefox Account used to sync data with Mozilla’s servers.
uz: Firefox hisob qaydnomasi bilan bog'langan elektron pochta ma'lumotlariniMozilla serverlari bilan sinxronlashtirish uchun ishlatilgan.

source: Last sync timestamp
uz: Oxirgi sinxronlash vaqt belgisi

source: The UNIX time at which last sync was made in seconds.
uz: Oxirgi sinxronlash soniyalarda amalga oshirilgan UNIX vaqti.

source: Sync device ID
uz: Qurilma identifikatorini sinxronlash

source: The sync device ID of the current device.
uz: Joriy qurilmaning sinxronlash qurilmasi identifikatori.

source: Sync device name
uz: Qurilma nomini sinxronlash

source: The sync device name of the current device.
uz: Joriy qurilmaning sinxronlash qurilmasi nomi.

source: The sync frequency in minutes
uz: Sinxronlash chastotasi daqiqalarda

source: The number of minutes between two consecutive syncs.
uz: Ikki ketma-ket sinxronlash orasidagi daqiqalar soni.

source: Sync data with Firefox
uz: Ma'lumotlarni Firefox bilan sinxronlashtirish

source: TRUE if Ephy collections should be synced with Firefox collections, FALSE otherwise.
uz: Agar Ephy toʻplamlari Firefox toʻplamlari bilan sinxronlashtirilishi kerakboʻlsa, ROST, aks holda YOLGʻON.

source: TRUE if bookmarks collection should be synced, FALSE otherwise.
uz: Bookmarklar to‘plami sinxronlashtirilishi kerak bo‘lsa ROST, aks holda YOLG‘ON.

source: Initial sync or normal sync
uz: Dastlabki sinxronlash yoki oddiy sinxronlash

source: TRUE if bookmarks collection needs to be synced for the first time, FALSE otherwise.
uz: Bookmarklar to‘plamini birinchi marta sinxronlash kerak bo‘lsa ROST, aks holda YOLG'ON

source: TRUE if passwords collection should be synced, FALSE otherwise.
uz: Agar parollar toʻplami sinxronlashtirilsa, ROST, aks holda YOLG'ON.

source: TRUE if passwords collection needs to be synced for the first time, FALSE otherwise.
uz: Agar parollar toʻplamini birinchi marta sinxronlash kerak boʻlsa, ROST, aks holda YOLG'ON.

source: TRUE if history collection should be synced, FALSE otherwise.
uz: Agar tarix to‘plami sinxronlashtirilishi kerak bo‘lsa, ROST, aks holda YOLG'ON.

source: TRUE if history collection needs to be synced for the first time, FALSE otherwise.
uz: Agar tarix toʻplamini birinchi marta sinxronlash kerak boʻlsa, ROST, aks holda YOLG'ON.

source: Enable open tabs sync
uz: Ochiq tablarni sinxronlashni yoqish

source: TRUE if open tabs collection should be synced, FALSE otherwise.
uz: Agar ochiq tablar to‘plami sinxronlashtirilishi kerak bo‘lsa, ROST, aks holda YOLG'ON.

source: Decision to apply when microphone permission is requested for this host
uz: Ushbu xost uchun mikrofonga ruxsat so‘ralganda qo‘llash qarori

source: Decision to apply when geolocation permission is requested for this host
uz: Ushbu xost uchun geolokatsiyaga ruxsat so'ralganda qo'llash qarori

source: Decision to apply when notification permission is requested for this host
uz: Ushbu xost uchun bildirishnoma ruxsati so'ralganda qo'llash qarori

source: Decision to apply when save password permission is requested for this host
uz: Ushbu xost uchun parolni saqlashga ruxsat so'ralganda qo'llash qarori

source: Decision to apply when webcam permission is requested for this host
uz: Ushbu xost uchun veb-kamera ruxsati so'ralganda qo'llash qarori

source: Decision to apply when advertisement permission is requested for this host
uz: Ushbu xost uchun reklama ruxsati so'ralganda qo'llash qarori

source: Decision to apply when an autoplay policy is requested for this host
uz: Ushbu xost uchun avtomatik ijro siyosati soʻralganda qoʻllash qarori

source: Memory usage
uz: Xotiradan foydalanish

source: Version %s
uz: Versiya %s

source: Epiphany Technology Preview
uz: Epiphany texnologiyasini ko'rib chiqish

source: A simple, clean, beautiful view of the web
uz: Internetning oddiy, toza va chiroyli ko'rinishi

source: Applications
uz: Ilovalar

source: List of installed web applications
uz: O'rnatilgan veb-ilovalar ro'yxati

source: Installed on:
uz: Oʻrnatilgan:

source: You can add your favorite website by clicking <b>Install Site as Web Application…</b> within the page menu.
uz: Siz sahifa menyusidagi <b>Saytni veb-ilova sifatida o'rnatish...</b> tugmasini bosish orqali sevimliveb-saytingizni qo'shishingiz mumkin.

source: Welcome to Web
uz: Webga xush kelibsiz

source: Start browsing and your most-visited sites will appear here.
uz: Ko‘rishni boshlang va eng ko‘p tashrif buyurilgan saytlaringiz shu yerda paydo bo‘ladi.

source: Private Browsing
uz: Shaxsiy ko'rish

source: You are currently browsing incognito. Pages viewed in this mode will not show up in your browsing history and all stored information will be cleared when you close the window. Files you download will be kept.
uz: Siz hozir inkognito rejimida koʻryapsiz. Ushbu rejimda koʻrilgan sahifalarkoʻrish tarixida koʻrinmaydi va oynani yopganingizda saqlangan barcha maʼlumotlaroʻchiriladi. Yuklab olingan fayllar saqlanadi.

source: Incognito mode hides your activity only from people using this computer.
uz: Inkognito rejimi sizning faoliyatingizni faqat ushbu kompyuterdan foydalanadigan odamlardan yashiradi.

source: It will not hide your activity from your employer if you are at work. Your internet service provider, your government, other governments, the websites that you visit, and advertisers on these websites may still be tracking you.
uz: Agar siz ishda bo'lsangiz, u sizning faoliyatingizni ish beruvchingizdan yashirmaydi.Internet provayderingiz, hukumatingiz, boshqa hukumatlar, siz tashrif buyuradigan veb-saytlarva ushbu veb-saytlardagi reklama beruvchilar sizni hali ham kuzatib borishi mumkin.

source: Select a Directory
uz: Jildni tanlang

source: _Download
uz: _Yuklab olish

source: Type: %s (%s)
uz: Turi: %s (%s)

source: From: %s
uz: Kimdan: %s

source: Where do you want to save the file?
uz: Faylni qayerda saqlamoqchisiz?

source: Finished downloading %s
uz: %s yuklab olindi

source: Download finished
uz: Yuklab olish tugallandi

source: Web is being controlled by automation.
uz: Web avtomatlashtirish tomonidan boshqariladi.

source: Send an email message to “%s”
uz: “%s”ga elektron pochta xabarini yuborish

source: Blank page
uz: Bo'sh sahifa

source: Arabic (_IBM-864)
uz: Arabcha (_IBM-864)

source: Arabic (ISO-_8859-6)
uz: Arabcha (ISO-_8859-6)

source: Arabic (_MacArabic)
uz: Arabcha (_MacArabic)

source: Arabic (_Windows-1256)
uz: Arabcha (_Windows-1256)

source: Baltic (_ISO-8859-13)
uz: Baltik (_ISO-8859-13)

source: Baltic (I_SO-8859-4)
uz: Baltik (I_SO-8859-4)

source: Baltic (_Windows-1257)
uz: Baltik (_Windows-1257)

source: _Armenian (ARMSCII-8)
uz: _Armancha (ARMSCII-8)

source: _Georgian (GEOSTD8)
uz: _Gruzincha (GEOSTD8)

source: Central European (_IBM-852)
uz: Markaziy Yevropa (_IBM-852)

source: Central European (I_SO-8859-2)
uz: Markaziy Yevropa (I_SO-8859-2)

source: Central European (_MacCE)
uz: Markaziy Yevropa (_MacCE)
