Repository: nizomovasadbek/i10n
Catalog: gnome/43/gnome-tweaks.master.po
Languages: uz

source: The GNOME Project
uz: GNOME loyihasi

source: Tweak advanced GNOME 3 settings
uz: Kengaytirilgan GNOME 3 sozlamalari

source: GNOME Tweaks allows adjusting advanced GNOME options.
uz: GNOME Tweaks kengaytirilgan GNOME opsiyalarini sozlash imkonini beradi

source: It can install and manage themes and extensions, change power settings, manage startup applications, and enable desktop icons among other settings.
uz: U mavzular va extensionslarni o'rnatishi va boshqarishi, quvvat sozlamalarini o'zgartirishi mumkin

source: Settings;Advanced;Preferences;Fonts;Theme;XKB;Keyboard;Typing;
uz: Sozlamalar;Kengaytirilgan;Parametrlar;Shriftlar;Mavzu;XKB;Klaviatura;Yozuv

source: _Reset to Defaults
uz: _Asl holatiga qaytarish

source: _About Tweaks
uz: _Tweaks haqida

source: _Continue
uz: _Davom eting

source: Extensions Has Moved
uz: Extension ko'chirildi

source: Extensions management has been moved to {0}.
uz: Extensionlarni boshqarish {0} ga ko'chirish

source: Reset to Defaults
uz: Asl holatiga qaytarish

source: Reset all tweak settings to the original default state?
uz: Barcha sozlash sozlamalari asl standart holatiga qaytarilsinmi?

source: (%s mode)
uz: (%s rejim)

source: GNOME Shell is not running
uz: GNOME Shell ishlamayapti

source: Homepage
uz: Bosh sahifa

source: Miscellaneous
uz: Turli xil

source: Search Tweaks…
uz: Tweaks qidiruvi…

source: Legacy Applications
uz: Eski ilovalar

source: Error writing setting
uz: Sozlamani yozishda xato

source: Cursor
uz: Kursor

source: Install custom or user themes for gnome-shell
uz: Gnome-shell uchun maxsus yoki foydalanuvchi mavzularini o'rnating

source: Unknown error
uz: Noma'lum xato

source: Shell not running
uz: Shell ishlamayapti

source: Shell user-theme extension incorrectly installed
uz: Shell foydalanuvchi mavzusi ilovasi noto'g'ri o'rnatilgan

source: Shell user-theme extension not enabled
uz: Shell foydalanuvchi mavzusi ilovasi yoqilmagan

source: Could not list shell extensions
uz: Shell ilovalarini ro'yxatga kiritib bo'lmadi

source: <i>Default</i>
uz: <i>Birlamchi</i>

source: Select a theme
uz: Mavzuni tanlang

source: %s theme updated successfully
uz: %s mavzusi muvaffaqiyatli yangilandi

source: %s theme installed successfully
uz: %s mavzusi muvaffaqiyatli o'rnatildi

source: Error installing theme
uz: Mavzuni o'rnatishda xatolik yuz berdi

source: Invalid theme
uz: Yaroqsiz mavzu

source: Appearance
uz: Ko'rinish

source: Themes
uz: Mavzular

source: Sound
uz: Ovoz

source: Background
uz: Fon

source: Image
uz: Rasm

source: Adjustment
uz: Sozlash

source: Lock Screen
uz: Ekranni qulflash

source: Home
uz: Bosh sahifa

source: Desktop
uz: Ish stoli

source: Icons on Desktop
uz: Ish stolidagi ikonkalar

source: Network Servers
uz: Tarmoq Serverlari

source: Trash
uz: Chiqindi

source: Mounted Volumes
uz: O'rnatilgan jildlar

source: Hinting
uz: Ishora

source: Full
uz: To'liq

source: Medium
uz: O'rta

source: Slight
uz: Yengil

source: None
uz: Yo'q

source: Subpixel (for LCD screens)
uz: Subpiksel (LCD ekranlar uchun)

source: Standard (grayscale)
uz: Standart (kulrang)

source: Fonts
uz: Shriftlar

source: Interface Text
uz: Interfeys Matni

source: Document Text
uz: Hujjat Matni

source: Monospace Text
uz: Monospace Matn

source: Legacy Window Titles
uz: Eski Oyna Sarlavhalari

source: Scaling Factor
uz: Masshtab omili

source: Over-Amplification
uz: Haddan Tashqari Kuchaytirish

source: Allows raising the volume above 100%. This can result in a loss of audio quality; it is better to increase application volume settings, if possible.
uz: 100% dan yuqori hajmni oshirishga imkon beradi. Bu audio yo'qotilishiga olib kelishi mumkinsifat; iloji bo'lsa, dastur hajmi sozlamalarini oshirish yaxshiroqdir

source: Emacs Input
uz: Emacs Kiritish

source: Overview Shortcut
uz: Qisqa klavish

source: Left Super
uz: Super chap

source: Right Super
uz: To'g'ri Super

source: Additional Layout Options
uz: Qo'shimcha tartib variantlari

source: Mouse Click Emulation
uz: Sichqonchani bosish emulyatsiyasi

source: Fingers
uz: Barmoqlar

source: Click the touchpad with two fingers for right-click and three fingers for middle-click.
uz: Sichqonchaning o'ng tugmasi uchun ikki barmog'ingiz va uchta barmoq bilan sensorli panelni bosingo'rta tugmasini bosing.

source: Area
uz: Hudud

source: Click the bottom right of the touchpad for right-click and the bottom middle for middle-click.
uz: Sichqonchaning o'ng tugmachasini va pastki o'rtasini bosish uchun sensorli panelning pastki o'ng tomonini bosingo'rta bosish uchun.

source: Disabled
uz: O'chirilgan

source: Don’t use mouse click emulation.
uz: Sichqonchani bosish emulyatsiyasidan foydalanmang

source: Keyboard & Mouse
uz: Klaviatura & Sichqoncha

source: Keyboard
uz: Klaviatura

source: Show Extended Input Sources
uz: Kengaytirilgan kirish manbalarini ko'rsatish

source: Increases the choice of input sources in the Settings application.
uz: Sozlamalar ilovasida kiritish manbalarini tanlashni oshiradi.

source: Mouse
uz: Sichqoncha

source: Acceleration Profile
uz: Tezlashtirish Profili

source: Pointer Location
uz: Pointer joylashuvi

source: Press the Ctrl key to highlight the pointer.
uz: Ko'rsatkichni ajratib ko'rsatish uchun Ctrl tugmasini bosing

source: Middle Click Paste
uz: O'rta tugmasini bosing joylashtirish

source: Touchpad
uz: Sensorli panel

source: Disable While Typing
uz: Yozish paytida o'chirib qo'ying

source: Startup applications are automatically started when you log in.
uz: Tizimga kirganingizda ishga tushirish ilovalari avtomatik ravishda ishga tushadi

source: Startup Applications
uz: Ishga tushirish ilovalari

source: Applications
uz: Ilovalar

source: Search Applications…
uz: Ilovalarni qidirish…

source: <primary>f
uz: <asosiy>f

source: running
uz: ishlamoqda

source: _Close
uz: _Yopish

source: _Add
uz: _Qo'shish

source: Remove
uz: O'chirish

source: New startup application
uz: Yangi ishga tushirish dasturi

source: Add a new application to be run at startup
uz: Ishga tushganda ishga tushirish uchun yangi ilova qo'shing

source: Placement
uz: Joylashtirish

source: Left
uz: Chapga

source: Right
uz: To'g'ri

source: Window Titlebars
uz: Oyna sarlavhalari

source: Titlebar Actions
uz: Sarlavha panelidagi harakatlar

source: Double-Click
uz: Ikki marta bosing

source: Middle-Click
uz: O'rta tugmasini bosing

source: Secondary-Click
uz: Ikkilamchi - bosing

source: Titlebar Buttons
uz: Sarlavha paneli tugmalari

source: Maximize
uz: Maksimallashtirish

source: Minimize
uz: Minimallashtirish

source: Top Bar
uz: Yuqori bar

source: Clock
uz: Soat

source: Weekday
uz: Hafta kuni

source: Date
uz: Sana

source: Seconds
uz: Soniyalar

source: Calendar
uz: Kalendar

source: Week Numbers
uz: Hafta Raqamlari

source: Window Focus
uz: Oyna fokus

source: Click to Focus
uz: Fokuslash uchun bosing

source: Windows are focused when they are clicked.
uz: Ular bosilganda Windows diqqat markazida bo'ladi.

source: Focus on Hover
uz: Hoverga e'tibor qarating

source: Window is focused when hovered with the pointer. Windows remain focused when the desktop is hovered.
uz: Oyna kursor bilan olib borilganda fokuslanadi. Windows qachon diqqat markazida qoladiish stoli hoovered bo'ladi.

source: Window is focused when hovered with the pointer. Hovering the desktop removes focus from the previous window.
uz: Oyna kursor bilan olib borilganda fokuslanadi. Ish stolini silabfokusni oldingi oynadan olib tashlaydi.

source: Window scaling
uz: Oyna masshtablash

source: Adjust GDK window scaling factor for HiDPI
uz: HiDPI uchun GDK oynasini masshtablash faktorini sozlang

source: Do you want to keep these HiDPI settings?
uz: Ushbu HiDPI sozlamalarini saqlamoqchimisiz?

source: Revert Settings
uz: Sozlamalarni qaytarish

source: Keep Changes
uz: O'zgarishlarni saqlang

source: Windows
uz: Oynalar

source: Attach Modal Dialogs
uz: Modal dialoglarni biriktiring

source: When on, modal dialog windows are attached to their parent windows, and cannot be moved.
uz: Yoqilganda modal dialog oynalari ota-oynalariga biriktiriladi vako'chirish mumkin emas.

source: Center New Windows
uz: Yangi Oynalar Markai

source: Resize with Secondary-Click
uz: Ikkilamchi tugmasini bosish bilan o'lchamini o'zgartiring

source: Window Action Key
uz: Oyna harakat kaliti

source: Raise Windows When Focused
uz: Fokuslanganda Windowsni ko'taring

source: Typing
uz: Yozilmoqda

source: Device
uz: Qurilma

source: %s <i>(default)</i>
uz: %s <i>(standart)</i>

source: Configuration changes require restart
uz: Konfiguratsiya o'zgarishlari qayta ishga tushirishni talab qiladi

source: Your session needs to be restarted for settings to take effect
uz: Sozlamalar kuchga kirishi uchun seansni qayta boshlash kerak

source: Restart Session
uz: Seansni qayta ishga tushirish
