Repository: nizomovasadbek/i10n
Catalog: gnome/43/gnome-remote-desktop.master.po
Languages: uz

source: Do you want to share your desktop?
uz: Ish stolingizni baham ko'rmoqchimisiz?

source: A user on the computer '%s' is trying to remotely view or control your desktop.
uz: “%s” kompyuteridagi foydalanuvchi sizning maʼlumotlaringizni masofadan turib koʻrish yoki boshqarishga harakat qilmoqda

source: Refuse
uz: Rad etish

source: Accept
uz: Qabul qiling

source: Usage: %s [OPTIONS...] COMMAND [SUBCOMMAND]...
uz: Foydalanish: %s [OPTIONS...] COMMAND [SUBCOMMAND]...

source: Commands:
uz: Buyruqlar:

source: rdp - RDP subcommands: enable - Enable the RDP backend disable - Disable the RDP backend set-tls-cert <path-to-cert> - Set path to TLS certificate set-tls-key <path-to-key> - Set path to TLS key set-credentials <username> <password> - Set username and password credentials clear-credentials - Clear username and password credentials enable-view-only - Disable remote control of input devices disable-view-only - Enable remote control of input devices
uz: rdp - RDP quyi buyruqlari: enable - RDP backend yoqish disable - RDP serverini o'chirish set-tls-cert <path-to-cert> - TLS sertifikatiga yo'l o'rnating set-tls-key <path-to-key> - TLS kalitiga yo'l o'rnating set-credentials <username> <parol> - Foydalanuvchi nomi va parolni o'rnating hisobga olish ma'lumotlari clear-credentials - Foydalanuvchi nomi va parolni o'chirish hisobga olish ma'lumotlari enable-view-only - masofadan boshqarishni o'chirishinput qurilmalar disable-view-only - masofadan boshqarishni yoqishinput qurilmalar

source: vnc - VNC subcommands: enable - Enable the VNC backend disable - Disable the VNC backend set-password <password> - Set the VNC password clear-password - Clear the VNC password set-auth-method password|prompt - Set the authorization method enable-view-only - Disable remote control of input devices disable-view-only - Enable remote control of input devices
uz: vnc - VNC quyi buyruqlari: enable - VNC backend yoqish disable - VNC serverini o'chirish set-password <password> - VNC parolini o'rnating clear-password - VNC parolini o'chirish set-auth-method password|so'rov - Avtorizatsiya usulini o'rnating enable-view-only - Masofadan boshqarishni o'chirib qo'ying input qurilmalar disable-view-only - Masofadan boshqarishni yoqish input qurilmalar

source: status [--show-credentials] - Show current status Options: --headless - Use headless credentials storage --help - Print this help text
uz: status [--show-credentials] - Joriy holatni ko‘rsatish Options: --headless - Use headless credentials storage --help - Ushbu yordam matnini chop eting

source: Whether the RDP backend is enabled or not
uz: RDP backend yoqilganmi yoki yo'qmi

source: If set to 'true' the RDP backend will be initialized.
uz: Agar 'true' qiymati o'rnatilgan bo'lsa, RDP backend ishga tushiriladi.

source: Screenshare mode of RDP connections
uz: RDP ulanishlarining ekran almashish rejimi

source: The screenshare mode specifies, whether the RDP backend mirrors the primary screen, or whether a virtual monitor is created. For the initial resolution of the virtual monitor, the RDP backend uses either the client core data ([MS-RDPBCGR] 2.2.1.3.2) or the client monitor data ([MS-RDPBCGR] 2.2.1.3.6), depending on what is available. When using a remote desktop session with a virtual monitor, clients can resize the resolution of the virtual monitor during a session with the Display Update Virtual Channel Extension ([MS-RDPEDISP]). Allowed screenshare modes include: * mirror-primary - Record the primary monitor of the current user session. * extend - Create a new virtual monitor and use it for the remote desktop session. The resolution of this virtual monitor is derived from the monitor configuration, submitted by the remote desktop client.
uz: Ekran almashish rejimi RDP backend asosiyni aks ettiradimi yoki yo'qligini aniqlaydiekran yoki virtual monitor yaratilganmi. Dastlabki ruxsat uchun virtual monitorning RDP backend mijozning asosiy ma'lumotlaridan foydalanadi([MS-RDPBCGR] 2.2.1.3.2) yoki mijoz monitor ma'lumotlari ([MS-RDPBCGR]2.2.1.3.6), mavjud bo'lgan narsaga qarab. Masofaviy ish stolidan foydalanganda Virtual monitor bilan seans, mijozlar o'lchamlarini o'zgartirishi mumkinDisplay Update Virtual Channel bilan seans paytida virtual monitorKengaytma ([MS-RDPEDISP]). Ruxsat berilgan ekran almashish rejimlariga quyidagilar kiradi: * oyna-asosiy - joriy foydalanuvchi seansining asosiy monitorini yozib oling. * kengaytirish - Yangi virtual monitor yarating va undan masofaviy ish stoli seansi uchun foydalaning. Ushbu virtual monitorning ruxsati monitordan olinganuzoq ish stoli mijozi tomonidan taqdim etilgan konfiguratsiya.

source: Path to the certificate file
uz: Sertifikat fayliga yo'l

source: In order to be able to use RDP with TLS Security, both the private key file and the certificate file need to be provided to the RDP server.
uz: TLS Security bilan RDP dan foydalanish uchun ikkala shaxsiy kalit fayliva sertifikat fayli RDP serveriga taqdim etilishi kerak.

source: Path to the private key file
uz: Shaxsiy kalit fayliga yo'l

source: Only allow remote connections to view the screen content
uz: Faqat masofaviy ulanishlarga ekran mazmunini ko'rishga ruxsat bering

source: When view-only is true, remote RDP connections cannot manipulate input devices (e.g. mouse and keyboard).
uz: Faqat ko'rish uchun rost bo'lsa, masofaviy RDP ulanishlari kirishni boshqara olmaydiqurilmalar (masalan, sichqoncha va klaviatura).

source: Whether the VNC backend is enabled or not
uz: VNC backend yoqilganmi yoki yo'qmi

source: If set to 'true' the VNC backend will be initialized.
uz: Agar "true" qiymati o'rnatilsa, VNC backend ishga tushiriladi.

source: When view-only is true, remote VNC connections cannot manipulate input devices (e.g. mouse and keyboard).
uz: Faqat ko'rish uchun rost bo'lsa, masofaviy VNC ulanishlari kirishni boshqara olmaydiqurilmalar (masalan, sichqoncha va klaviatura).

source: Method used to authenticate VNC connections
uz: VNC ulanishlarini autentifikatsiya qilish uchun ishlatiladigan usul

source: The VNC authentication method describes how a remote connection is authenticated. It can currently be done in two different ways: * prompt - by prompting the user for each new connection, requiring a person with physical access to the workstation to explicitly approve the new connection. * password - by requiring the remote client to provide a known password
uz: VNC autentifikatsiya usuli masofaviy ulanish qanday ekanligini tasvirlaydiautentifikatsiya qilingan. Hozirda u ikki xil usulda amalga oshirilishi mumkin: * prompt - by foydalanuvchini har bir yangi ulanishga taklif qilish, jismoniy shaxsni talab qilishyangi ulanishni aniq tasdiqlash uchun ish stantsiyasiga kirish. *parol - masofaviy mijozdan ma'lum parolni taqdim etishni talab qilish orqali

source: Screenshare mode of VNC connections
uz: VNC ulanishlarining ekran almashish rejimi

source: The screenshare mode specifies, whether the VNC backend mirrors the primary screen, or whether a virtual monitor is created. For the initial resolution of the virtual monitor, the VNC backend uses a default size of 1920x1080 pixels. When using a remote desktop session with a virtual monitor, clients can resize the resolution of the virtual monitor during a session with the setDesktopSize PDU. Allowed screenshare modes include: * mirror-primary - Record the primary monitor of the current user session. * extend - Create a new virtual monitor and use it for the remote desktop session. The initial monitor resolution of this virtual monitor is set to 1920x1080 pixels. Clients can override the initial resolution with subsequent monitor configuration updates.
uz: Ekran almashish rejimi VNC backend asosiyni aks ettiradimi yoki yo'qligini aniqlaydiekran yoki virtual monitor yaratilganmi. Dastlabki ruxsat uchun virtual monitorning VNC backend standart o'lchami 1920x1080piksel. Virtual monitor bilan masofaviy ish stoli seansidan foydalanganda mijozlar bilan seans paytida virtual monitorning o'lchamini o'zgartirishi mumkinsetDesktopSize PDU. Ruxsat berilgan ekran almashish rejimlariga quyidagilar kiradi: * birlamchi oyna - Joriy foydalanuvchi sessiyasining asosiy monitorini yozib oling. * kengaytirish - yaratish yangi virtual monitor va undan masofaviy ish stoli seansi uchun foydalaning. Dastlabki Ushbu virtual monitorning monitor o'lchamlari 1920x1080 pikselga o'rnatilgan.Mijozlar keyingi monitor yordamida dastlabki ruxsatni bekor qilishi mumkinkonfiguratsiya yangilanishlari.
