Repository: nizomovasadbek/i10n
Catalog: gnome/43/gnome-tour.master.po
Languages: uz

source: Greeter & Tour
uz: Sayohat

source: GNOME Tour and Greeter
uz: GNOME Tour va Greeter

source: A guided tour and greeter for GNOME.
uz: GNOME uchun ekskursiya va Greeter

source: The GNOME Project
uz: GNOME loyihasi

source: Previous
uz: Oldingi

source: Next
uz: Keyingisi

source: Start
uz: Boshlash

source: Start the Tour
uz: Sayohatni boshlang

source: Get an Overview
uz: Umumiy koʻrinishga ega boʻling

source: Press the Super key to see open windows and apps.
uz: Ochiq oyna va ilovalarni ko'rish uchun Super tugmachasini bosing.

source: Just Type to Search
uz: Qidirish uchun shunchaki yozing

source: Type in the overview to search. Launch apps, find things.
uz: Qidirish uchun umumiy koʻrinishni kiriting. Ilovalarni ishga tushiring, narsalarni toping.

source: Keep on Top with Workspaces
uz: Workspaces bilan yuqorida turing

source: Easily organize windows with the workspaces view.
uz: Ish joylari ko'rinishida oynalarni osongina tartibga soling.

source: Up/Down for the Overview
uz: Umumiy koʻrinish uchun yuqoriga/pastga

source: On a touchpad, use three-finger vertical swipes. Try it!
uz: Sensorli panelda uch barmoq bilan vertikal surishlardan foydalaning. Urunib ko'r!

source: Left/Right for Workspaces
uz: Ish joylari uchun chap/o‘ng

source: On a touchpad, use three-finger horizontal swipes. Try it!
uz: Sensorli panelda uch barmoq bilan gorizontal surishlardan foydalaning. Urunib ko'r!

source: That's it. Have a nice day!
uz: Bo'ldi shu. Hayrli kun!

source: To get more advice and tips, see the Help app.
uz: Qoʻshimcha maslahat va maslahatlar olish uchun Yordam ilovasiga qarang.

source: Learn about the key features in {name} {version}.
uz: {name} {version} ning asosiy xususiyatlari haqida bilib oling.
