Repository: nizomovasadbek/i10n
Catalog: gnome/43/gnome-maps.gnome-43.po
Languages: uz

source: Maps
uz: Xaritalar

source: Find places around the world
uz: Dunyo bo'ylab joylarni toping

source: Maps gives you quick access to maps all across the world. It allows you to quickly find the place you’re looking for by searching for a city or street, or locate a place to meet a friend.
uz: Xaritalar sizga butun dunyo boʻylab xaritalarga tezkor kirish imkonini beradi. Bu sizga yoki do'stingiz bilan uchrashadigan joyni toping.

source: Maps uses the collaborative OpenStreetMap database, made by hundreds of thousands of people across the globe.
uz: Xaritalar yuzlab odamlar tomonidan yaratilgan hamkorlikdagi OpenStreetMap ma'lumotlar bazasidan foydalanadiDunyo bo'ylab minglab odamlar.

source: The GNOME Project
uz: GNOME loyihasi

source: A simple maps application
uz: Oddiy xaritalar ilovasi

source: Maps;
uz: Xaritalar;

source: Allows your location to be shown on the map.
uz: Joylashuvingizni xaritada ko'rsatishga ruxsat beradi.

source: last viewed location
uz: oxirgi koʻrilgan joy

source: Coordinates of last viewed location.
uz: Oxirgi ko'rilgan joyning koordinatalari.

source: zoom
uz: kattalashtirish

source: Zoom level
uz: Kattalashtirish darajasi

source: Map type
uz: Xarita turi

source: The type of map to display (street, aerial, etc.)
uz: Ko'rsatiladigan xarita turi (ko'cha, antenna va boshqalar)

source: Window size
uz: Oyna hajmi

source: Window size (width and height).
uz: Oyna hajmi (kengligi va balandligi).

source: Window position
uz: Oynaning holati

source: Window position (X and Y).
uz: Oyna holati (X va Y).

source: Window maximized
uz: Oyna kattalashtirildi

source: Window maximization state
uz: Oynani maksimallashtirish holati

source: Maximum number of search results
uz: Qidiruv natijalarining maksimal soni

source: Maximum number of search results from geocode search.
uz: Geokod qidiruvidan olingan maksimal qidiruv natijalari.

source: Number of recent places to store
uz: Saqlash uchun oxirgi joylar soni

source: Number of recently visited places to store.
uz: Saqlash uchun yaqinda tashrif buyurilgan joylar soni.

source: Number of recent routes to store
uz: Saqlash uchun oxirgi marshrutlar soni

source: Number of recently visited routes to store.
uz: Saqlash uchun yaqinda tashrif buyurilgan marshrutlar soni.

source: OpenStreetMap username or e-mail address
uz: OpenStreetMap foydalanuvchi nomi yoki elektron pochta manzili

source: Indicates if the user has signed in to edit OpenStreetMap data.
uz: Foydalanuvchi OpenStreetMap ma'lumotlarini tahrirlash uchun tizimga kirganligini ko'rsatadi.

source: Last used transportation type for routing
uz: Marshrutlash uchun oxirgi ishlatilgan transport turi

source: Show scale
uz: Masshtabni ko'rsatish

source: Whether to show the scale.
uz: Masshtabni ko'rsatish kerakmi.

source: Route from here
uz: Bu yerdan marshrut

source: Add intermediate destination
uz: Oraliq manzilni qo'shing

source: Route to here
uz: Bu yerga marshrut

source: What's here?
uz: Bu yerda nima bor?

source: Copy location
uz: Joyni nusxalash

source: Add to OpenStreetMap
uz: OpenStreetMap-ga qo'shing

source: Export view
uz: Eksport ko'rinishi

source: _Cancel
uz: _Bekor qilish

source: _Export
uz: _Eksport

source: Go to current location
uz: Joriy manzilga o'ting

source: Choose map type
uz: Xarita turini tanlang

source: Zoom out
uz: Kichraytirish

source: Zoom in
uz: Kattalashtirish

source: Print Route
uz: Chop etish marshruti

source: Toggle favorites
uz: Sevimlilarni almashtirish

source: Toggle route planner
uz: Marshrutni rejalashtiruvchini almashtirish

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Show Shortcuts
uz: Yorliqlarni ko'rsatish

# shortcut window
source: Search
uz: Qidirish

# shortcut window
source: Toggle route planner
uz: Marshrutni rejalashtiruvchini almashtirish

# shortcut window
source: Print route
uz: Marshrutni chop etish

# shortcut window
source: Quit
uz: Chiqish

# shortcut window
source: Open main menu
uz: Asosiy menyuni oching

# shortcut window
source: Map View
uz: Xarita ko'rinishi

# shortcut window
source: Zoom in
uz: Kattalashtirish

# shortcut window
source: Zoom out
uz: Kichraytirish

# shortcut window
source: Toggle scale
uz: Masshtabni almashtirish

# shortcut window
source: Go to current location
uz: Joriy manzilga o'ting

# shortcut window
source: Switch to street view
uz: Ko‘cha ko‘rinishiga o‘tish

# shortcut window
source: Switch to aerial view
uz: Havo ko'rinishiga o'tish

# shortcut window
source: Open shape layer
uz: Ochiq shaklli qatlam

source: Show Scale
uz: Masshtabni ko'rsatish

source: Open Shape Layer…
uz: Shakl qatlamini ochish…

source: Cancel
uz: Bekor qilish

source: Location Settings
uz: Joylashuv sozlamalari

source: Turn on location services to find your location
uz: Joylashuvingizni aniqlash uchun joylashuv xizmatlarini yoqing

source: Set up OpenStreetMap Account
uz: OpenStreetMap hisobini o'rnating

source: Export as Image
uz: Rasm sifatida eksport qiling

source: _Keyboard Shortcuts
uz: _Klaviatura yorliqlari

source: About Maps
uz: Xaritalar haqida

source: Open main menu
uz: Asosiy menyuni oching

source: OpenStreetMap Account
uz: OpenStreetMap hisobi

source: <span weight="bold" size="x-large">Sign in to edit maps</span>
uz: <span weight="bold" size="x-large">Xaritalarni tahrirlash uchun tizimga kiring</span>

source: Help to improve the map, using an OpenStreetMap account.
uz: Xaritani yaxshilashga yordam bering, OpenStreetMap hisobi.

source: Sign in to authorize access in a web browser. Then fill in the obtained verification code here in the next step.
uz: Veb-brauzerda kirishga ruxsat berish uchun tizimga kiring. Keyin keyingi bosqichda olingan tasdiqlash kodini to'ldiring.

source: Sign up
uz: Ro'yxatdan o'tish

source: Sign In
uz: Tizimga kirish

source: Copy verification code shown when authorizing access in the browser
uz: Brauzerda kirishga ruxsat berishda ko'rsatilgan tasdiqlash kodini nusxalash

source: Verification code
uz: Tasdiq kodi

source: Verify
uz: Tasdiqlash

source: <span weight="bold" size="x-large">Signed In</span>
uz: <span weight="bold" size="x-large">Tizimga kirgan</span>

source: Your OpenStreetMap account is active.
uz: OpenStreetMap hisobingiz faol.

source: Sign Out
uz: Tizimdan chiqish

source: Street
uz: Ko'cha

source: House number
uz: Uy raqami

source: Postal code
uz: Pochta kodi

source: City
uz: Shahar

source: Type
uz: Turi

source: None
uz: Yo'q

source: Add Field
uz: Maydon qo'shish

source: Comment
uz: Izoh

source: Map changes will be visible on all maps that use OpenStreetMap data.
uz: Xaritadagi oʻzgarishlar barcha foydalanadigan xaritalarda koʻrinadi OpenStreetMap ma'lumotlari.

source: Recently Used
uz: Yaqinda ishlatilgan

source: Next
uz: Keyingisi

source: No results found
uz: Hech qanday natija topilmadi

source: An error has occurred
uz: Xatolik yuz berdi

source: Drag to change order of the route
uz: Marshrut tartibini o'zgartirish uchun torting

source: Open Location
uz: Joylashuvni oching

source: Copy
uz: Nusxalash

source: Send To…
uz: Yuborish…

source: Open Shape Layer
uz: Shakl qatlamini oching

source: _Open
uz: _Ochiq

source: Toggle visible
uz: Koʻrinadigan oʻchirish

source: Remove Shape Layer
uz: Shakl qatlamini olib tashlang

source: Route search by GraphHopper
uz: GraphHopper tomonidan marshrut qidirish

source: Routing itineraries for public transit is provided by third-party services. GNOME can not guarantee correctness of the itineraries and schedules shown. Note that some providers might not include all available modes of transportation, e.g. a national provider might not include airlines, and a local provider could miss regional trains. Names and brands shown are to be considered as registered trademarks when applicable.
uz: Jamoat transporti uchun marshrutlar uchinchi tomon tomonidan taqdim etiladi xizmatlar. GNOME ko'rsatilgan marshrutlar va jadvallarning to'g'riligiga kafolat bera olmaydi. E'tibor bering, ba'zi provayderlar barcha mavjud rejimlarni o'z ichiga olmayditransport, masalan, milliy provayder aviakompaniyalarni va mahalliy provayderni o'z ichiga olmaydimumkin mintaqaviy poyezdlarni Ko'rsatilgan nomlar va brendlar ro'yxatdan o'tgan savdo belgilari sifatida ko'rib chiqilishi kerakqo'llanilishi mumkin.

source: Hide intermediate stops and information
uz: Oraliq to'xtashlar va ma'lumotlarni yashirish

source: Show intermediate stops and information
uz: Oraliq to'xtash joylari va ma'lumotlarni ko'rsatish

source: Leave Now
uz: Hozir keting

source: Leave By
uz: Tashlab ketish

source: Arrive By
uz: Yetib kelish

source: Show
uz: Ko'rsatish

source: Buses
uz: Avtobuslar

source: Trams
uz: Tramvaylar

source: Trains
uz: Poyezdlar

source: Subway
uz: Metro

source: Ferries
uz: Paromlar

source: Airplanes
uz: Samolyotlar

source: Share location
uz: Joylashuvni ulashish

source: Add to new route
uz: Yangi marshrutga qo'shing

source: Directions
uz: Yo'nalishlar

source: Mark as favorite
uz: Sevimli deb belgilang

source: Edit on OpenStreetMap
uz: OpenStreetMap-da tahrirlash

source: Zoom in to add location!
uz: Joylashuvni qo'shish uchun kattalashtiring!

source: Zoom In
uz: Kattalashtirish

source: Failed to find tile structure in directory
uz: Katalogda kafel tuzilishi topilmadi

source: Failed to parse XML document
uz: XML hujjatni tahlil qilib bo‘lmadi

source: Missing required attributes
uz: Kerakli atributlar etishmayapti

source: Could not find OSM element
uz: OSM elementi topilmadi

source: Could not find user element
uz: Foydalanuvchi elementi topilmadi

source: A path to a local tiles directory structure
uz: Mahalliy plitkalar katalog tuzilishiga yo'l

source: Tile size for local tiles directory
uz: Mahalliy plitkalar katalogi uchun plitka o'lchami

source: Show the version of the program
uz: Dasturning versiyasini ko'rsating

source: Search for places
uz: Joylarni qidirish

source: Invalid maps: URI: %s
uz: Xaritalar yaroqsiz: URI: %s

source: Maps at %f, %f.png
uz: Xaritalar %f, %f.png

source: Filesystem is read only
uz: Fayl tizimi faqat o'qiladi

source: You do not have permission to save there
uz: U yerda saqlashga ruxsatingiz yo‘q

source: The directory does not exist
uz: Jild mavjud emas

source: No filename specified
uz: Hech qanday fayl nomi belgilanmagan

source: Unable to export view
uz: Ko‘rinishni eksport qilib bo‘lmadi

source: Current Location
uz: Joriy joylashuv

source: invalid coordinate
uz: noto'g'ri koordinata

source: parse error
uz: tahlil qilish xatosi

source: unknown geometry
uz: noma'lum geometriya

source: Route request failed.
uz: Marshrut so‘rovi amalga oshmadi.

source: No route found.
uz: Hech qanday marshrut topilmadi.

source: Start!
uz: Boshlash!

source: All Layer Files
uz: Barcha qatlam fayllari

source: Failed to connect to location service
uz: Joylashuv xizmatiga ulanib bo‘lmadi

source: translator-credits
uz: tarjimon-kreditlar

source: Copyright © 2011 – 2022 Red Hat, Inc. and The GNOME Maps authors
uz: Mualliflik huquqi © 2011 – 2022 Red Hat, Inc. va The GNOME Maps mualliflari

source: Map data by %s and contributors
uz: %s va hissa qoʻshuvchilar tomonidan xarita maʼlumotlari

source: Map Data Provider
uz: Xarita ma'lumotlari provayderi

source: Map Tile Provider
uz: Xarita kafel provayderi

source: Map tiles provided by %s
uz: Xarita plitalari %s tomonidan taqdim etilgan

source: Search Provider
uz: Qidiruv provayderi

source: Search provided by %s using %s
uz: Qidiruv %s tomonidan %s yordamida taqdim etilgan

source: Failed to open layer
uz: Qatlamni ochib bo‘lmadi

source: Do you want to continue?
uz: Davom etishni xohlaysizmi?

source: You are about to open files with a total size of %s MB. This could take some time to load
uz: Siz umumiy hajmi %s MB boʻlgan fayllarni ochmoqchisiz. Bu biroz vaqt olishi mumkin Yuklash vaqti

source: File type is not supported
uz: Fayl turi qo'llab-quvvatlanmaydi

source: Failed to open GeoURI
uz: GeoURI ochilmadi

source: Nothing found here!
uz: Bu yerda hech narsa topilmadi!

source: Location was added to the map, note that it may take a while before it shows on the map and in search results.
uz: Joylashuv xaritaga qo'shildi, esda tutingki, ko'rsatilishi biroz vaqt olishi mumkinxaritada va qidiruv natijalarida.

source: The verification code didn’t match, please try again.
uz: Tasdiqlash kodi mos kelmadi, qaytadan urining.

source: Incorrect user name or password
uz: Noto'g'ri foydalanuvchi nomi yoki parol

source: Success
uz: Muvaffaqiyat

source: Bad request
uz: Noto'g'ri so'rov

source: Object not found
uz: Ob'ekt topilmadi

source: Conflict, someone else has just modified the object
uz: Mojaro, boshqa kimdir ob'ektni o'zgartirdi

source: Object has been deleted
uz: Ob'ekt o'chirildi

source: Way or relation refers to non-existing children
uz: Yo'l yoki munosabat mavjud bo'lmagan bolalarga tegishli

source: Name
uz: Nomi

source: The official name. This is typically what appears on signs.
uz: Rasmiy nomi. Bu odatda belgilarda ko'rinadigan narsa.

source: Address
uz: Manzil

source: Website
uz: Veb-sayt

source: This is not a valid URL. Make sure to include http:// or https://.
uz: Bu haqiqiy URL emas. http:// yoki https:// kiritishingizga ishonch hosil qiling.

source: The official website. Try to use the most basic form of a URL i.e. http://example.com instead of http://example.com/index.html.
uz: Rasmiy veb-sayt. URLning eng oddiy shaklidan foydalanishga harakat qiling, ya'ni http://http://example.com/index.html o'rniga example.com.

source: Phone
uz: Telefon

source: Phone number. Use the international format, starting with a + sign. Beware of local privacy laws, especially for private phone numbers.
uz: Telefon raqami. + belgisidan boshlab xalqaro formatdan foydalaning. Ehtiyot bo'ling Mahalliy maxfiylik qonunlari, ayniqsa shaxsiy telefon raqamlari uchun.

source: This is not a valid e-mail address. Make sure to not include the mailto: protocol prefix.
uz: Bu to'g'ri e-mail manzili emas. Mailtoni kiritmaslikka ishonch hosil qiling:

source: Contact e-mail address for inquiries. Add only email addresses that are intended to be publicly used.
uz: So'rovlar uchun elektron pochta manzili bilan bog'laning. Faqat elektron pochta manzillarini qo'shing ommaviy foydalanish uchun mo'ljallangan.

source: Wikipedia
uz: Vikipediya

source: The format used should include the language code and the article title like “en:Article title”.
uz: Qo'llaniladigan format til kodi va maqola sarlavhasini o'z ichiga olishi kerak”en:Maqola nomi” .

source: Opening hours
uz: Ochilish soatlari

source: See the link in the label for help on format.
uz: Format bo'yicha yordam uchun yorliqdagi havolaga qarang.

source: Population
uz: Aholi

source: Altitude
uz: Balandlik

source: Elevation (height above sea level) of a point in metres.
uz: Bir nuqtaning balandligi (dengiz sathidan balandligi) metrda.

source: Wheelchair access
uz: Nogironlar aravachasiga kirish

source: Yes
uz: Ha

source: No
uz: Yo'q

source: Limited
uz: Cheklangan

source: Designated
uz: Belgilangan

source: Internet access
uz: Internetga ulanish

source: Wired
uz: Simli

source: Service
uz: Xizmat

source: Takeaway
uz: Olib ketish

source: Only
uz: Faqat

source: Religion
uz: Din

source: Buddhism
uz: Buddizm

source: Caodaism
uz: Kaodaizm

source: Christianity
uz: Xristianlik

source: Confucianism
uz: Konfutsiylik

source: Hinduism
uz: Hinduizm

source: Jainism
uz: Jaynizm

source: Judaism
uz: Yahudiylik

source: Islam
uz: Islom

source: Multiple Religions
uz: Ko'p dinlar

source: Paganism
uz: Butparastlik

source: Pastafarianism
uz: Pastafarlik

source: Scientology
uz: Sayentologiya

source: Spiritualism
uz: Spiritualizm

source: Unitarian Universalism
uz: Unitar universalizm

source: Zoroastrianism
uz: Zardushtiylik

source: Toilets
uz: Hojatxonalar

source: Note
uz: Eslatma

source: Information used to inform other mappers about non-obvious information about an element, the author’s intent when creating it, or hints for further improvement.
uz: Boshqa xaritachilarni aniq bo'lmagan ma'lumotlar haqida xabardor qilish uchun foydalaniladigan ma'lumotlarelement, uni yaratishda muallifning niyati yoki undan keyingi ishoralar

# dialog title
source: Add to OpenStreetMap
uz: OpenStreetMap-ga qo'shing

source: Select Type
uz: Turni tanlang

source: Done
uz: Bajarildi

source: Unnamed place
uz: Nomsiz joy

source: Failed to parse Geo URI
uz: Geo URI tahlili amalga oshmadi

source: Failed to parse Maps URI
uz: Xaritalar URI ni tahlil qilib bo‘lmadi

source: Coordinates
uz: Koordinatalar

source: Accuracy
uz: Aniqlik

source: Accuracy: %s
uz: Aniqlik: %s

source: Phone number
uz: Telefon raqami

source: Offers takeaway
uz: Olib ketishni taklif qiladi

source: Does not offer takeaway
uz: Olib ketishni taklif qilmaydi

source: Only offers takeaway
uz: Faqat olib ketishni taklif qiladi

source: Public internet access
uz: Umumiy Internetga kirish

source: No internet access
uz: Internetga kirish imkoni yo'q

source: Public Wi-Fi
uz: Umumiy Wi-Fi

source: Wired internet access
uz: Simli internetga kirish

source: Computers available for use
uz: Foydalanish uchun mavjud kompyuterlar

source: Internet assistance available
uz: Internet yordami mavjud

source: No toilets available
uz: Hojatxona mavjud emas

source: Toilets available
uz: Hojatxonalar mavjud

source: Wheelchair accessible
uz: Nogironlar aravachasiga kirish mumkin

source: Limited wheelchair accessibility
uz: Nogironlar aravachasiga kirish imkoniyati cheklangan

source: Not wheelchair accessible
uz: Nogironlar aravachasiga kira olmaydi

source: Designated for wheelchair users
uz: Nogironlar aravachasi foydalanuvchilari uchun mo'ljallangan

source: %s below sea level
uz: %s dengiz sathidan past

source: At sea level
uz: Dengiz sathida

source: Religion:
uz: Din:

source: Place not found in OpenStreetMap
uz: OpenStreetMap-da joy topilmadi

source: Coordinates in URL are not valid
uz: URLdagi koordinatalar yaroqsiz

source: URL is not supported
uz: URL qo'llab-quvvatlanmaydi

source: From %s to %s
uz: %s dan %s gacha

source: Loading map tiles for printing
uz: Chop etish uchun xarita plitkalari yuklanmoqda

source: You can abort printing if this takes too long
uz: Agar bu juda uzoq davom etsa, chop etishni to'xtatishingiz mumkin

source: Abort printing
uz: Chop etishni to'xtatish

source: Add via location
uz: Joylashuv orqali qo'shing

source: Remove via location
uz: Joylashuv orqali olib tashlang

source: Reverse route
uz: Teskari marshrut

source: Add %s to %s
uz: %s ga %s qo‘shing

source: Failed to open URI
uz: URI ochilmadi

source: Open with %s
uz: %s bilan ochish

source: failed to load file
uz: faylni yuklab bo'lmadi

source: Estimated time: %s
uz: Taxminiy vaqt: %s

source: Itineraries provided by %s
uz: Marshrutlar %s tomonidan taqdim etilgan

source: Start at %s
uz: %s da boshlang

source: Start
uz: Boshlash

source: Walk %s
uz: %s yurish

source: Arrive at %s
uz: %s da yetib keling

source: Arrive
uz: Yetib kelish

source: Show walking instructions
uz: Yurish ko'rsatmalarini ko'rsating

source: Hide walking instructions
uz: Yurish ko'rsatmalarini yashirish

source: Load earlier alternatives
uz: Oldingi muqobillarni yuklang

source: Load later alternatives
uz: Muqobillarni keyinroq yuklang

source: No earlier alternatives found.
uz: Avvalgi muqobillar topilmadi.

source: No later alternatives found.
uz: Keyinchalik muqobillar topilmadi.

source: No timetable data found for this route.
uz: Bu marshrut uchun jadval maʼlumotlari topilmadi.

source: No provider found for this route.
uz: Bu marshrut uchun provayder topilmadi.

source: %s minute
uz: %s daqiqa

source: %s hour
uz: %s soat

source: %s:%s hour
uz: %s:%s soat

source: Around the clock
uz: Soat atrofida

source: From sunrise to sunset
uz: Quyosh chiqishidan quyosh botishigacha

source: Every day
uz: Har kuni

source: Public holidays
uz: Davlat bayramlari

source: School holidays
uz: Maktab bayramlari

source: not open
uz: ochiq emas

source: Unknown
uz: Noma'lum

source: Exact
uz: Aniq

source: %s h
uz: %s s

source: %s h %s min
uz: %sec s %s min

source: This plugin doesn't support latest arrival
uz: Ushbu plagin so'nggi kelganlarni qo'llab-quvvatlamaydi

source: Continue on %s
uz: %s da davom eting

source: Continue
uz: Davom eting

source: Turn left on %s
uz: %s da chapga buriling

source: Turn left
uz: Chapga buriling

source: Turn slightly left on %s
uz: %s da biroz chapga buriling

source: Turn slightly left
uz: Bir oz chapga buriling

source: Turn sharp left on %s
uz: %s da chapga keskin buriling

source: Turn sharp left
uz: Chapga keskin buriling

source: Turn right on %s
uz: %s da o‘ngga buriling

source: Turn right
uz: O'ngga buriling

source: Turn slightly right on %s
uz: %s da biroz o‘ngga buriling

source: Turn slightly right
uz: Bir oz o'ngga buriling

source: Turn sharp right on %s
uz: %s da o‘ngga keskin buriling

source: Turn sharp right
uz: O'ngga keskin buriling

source: At the roundabout, take exit %s
uz: Aylanmada, %s chiqish yo‘liga o‘ting

source: At the roundabout, take exit to %s
uz: Aylanma chorrahada, %s ga chiqishga harakatlaning

source: Take the roundabout
uz: Aylanma yo‘ldan boring

source: Take the elevator and get off at %s
uz: Liftga chiqing va %s da tushing

source: Take the elevator
uz: Liftga chiqing

source: Make a left u-turn onto %s
uz: %s ga chapga buriling

source: Make a left u-turn
uz: Chapga buriling

source: Make a right u-turn onto %s
uz: %sga o‘ngga buriling

source: Make a right u-turn
uz: O'ngga buriling
