Repository: nizomovasadbek/i10n
Catalog: gnome/43/gnome-mahjongg.master.po
Languages: uz

source: Match tiles and clear the board
uz: Plitkalarni moslashtiring va taxtani tozalang

source: A solitaire version of the classic Eastern tile game. Tiles are stacked on the board at the start of the game. The goal is to remove all the tiles in as little time as possible. Select two matching tiles and they will disappear from the board, but you can only select a tile if there is an empty space to its left or right at the same level. Be careful: tiles that look alike may actually be slightly different.
uz: Klassik Sharqiy plitka o'yinining solitaire versiyasi. Plitkalar ustiga qo'yilgan O'yin boshida doska. Maqsad - barcha plitkalarni olib tashlash Iloji boricha kamroq vaqt. Ikkita mos plitkani tanlang va ular taxtadan g'oyib bo'ling, lekin siz faqat plitkani tanlashingiz mumkinbir xil darajada chap yoki o'ng tomonda bo'sh joy. Ehtiyot bo'ling: plitkalar O'xshash ko'rinish aslida bir oz boshqacha bo'lishi mumkin.

source: GNOME Mahjongg features a variety of starting layouts, some easy and some difficult. If you get stuck, you can ask for a hint, but this adds a large time penalty.
uz: GNOME Mahjongg turli xil boshlang'ich sxemalarga ega, ba'zilari oson va ba'zilariQiyin. Agar to'xtab qolsangiz, maslahat so'rashingiz mumkin, lekin bu katta qo'shimcha qiladi vaqt jazosi.

source: The GNOME Project
uz: GNOME loyihasi

source: Disassemble a pile of tiles by removing matching pairs
uz: Mos keladigan juftlarni olib tashlash orqali bir qoziq plitkalarni demontaj qiling

source: game;strategy;puzzle;board;
uz: o‘yin;strategiya;jumboq;doska;

source: Width of the window in pixels
uz: Oynaning kengligi piksellarda

source: Height of the window in pixels
uz: Oynaning piksellardagi balandligi

source: true if the window is maximized
uz: agar oyna kattalashtirilsa rost

# mahjongg map name
source: Easy
uz: Oson

# shortcut window
source: Main functions
uz: Asosiy funktsiyalari

# shortcut window
source: Start a new game
uz: Yangi o'yinni boshlang

# shortcut window
source: Pause the game
uz: O'yinni to'xtatib turing

# shortcut window
source: Undo
uz: Bekor qilish

# shortcut window
source: Redo
uz: Qayta qiling

# shortcut window
source: Show a hint
uz: Maslahat ko'rsatish

# shortcut window
source: Generic
uz: Umumiy

# shortcut window
source: Toggle main menu
uz: Asosiy menyuni almashtirish

# shortcut window
source: Show Keyboard Shortcuts
uz: Klaviatura yorliqlarini ko'rsatish

# shortcut window
source: Show Help
uz: Yordamni ko'rsatish

# shortcut window
source: Fullscreen
uz: To'liq ekran

# shortcut window
source: Quit
uz: Chiqish

source: Theme
uz: Mavzu

source: Layout
uz: Tartib

source: Background color
uz: Fon rangi

source: Layout:
uz: Tartib:

source: New Game
uz: Yangi o'yin

source: Restart Game
uz: O'yinni qayta ishga tushirish

source: Scores
uz: Ballar

source: Preferences
uz: Afzalliklar

source: Keyboard Shortcuts
uz: Klaviatura yorliqlari

source: Help
uz: Yordam

source: About Mahjongg
uz: Mahjongg haqida

source: Paused
uz: Pauza

source: Print release version and exit
uz: Chiqarish versiyasini chop eting va chiqing

source: Do you want to start a new game with this map?
uz: Ushbu xarita bilan yangi o'yin boshlamoqchimisiz?

source: If you continue playing the next game will use the new map.
uz: Agar siz keyingi o'yinni o'ynashda davom etsangiz, yangi xaritadan foydalanasiz.

source: _Continue playing
uz: _Oʻynashda davom eting

source: Use _new map
uz: _yangi xaritadan foydalaning

source: There are no more moves.
uz: Boshqa harakatlar yo'q.

source: Each puzzle has at least one solution. You can undo your moves and try and find the solution, restart this game, or start a new one.
uz: Har bir boshqotirmaning kamida bitta yechimi bor. Harakatlaringizni bekor qilib, Yechimni toping, ushbu o'yinni qayta ishga tushiring yoki yangisini boshlang.

source: You can also try to reshuffle the game, but this does not guarantee a solution.
uz: Siz o'yinni o'zgartirishga ham urinib ko'rishingiz mumkin, ammo bu kafolat bermaydiyechim.

source: _Undo
uz: _Bekor qilish

source: _Restart
uz: _Qayta ishga tushirish

source: _New game
uz: _Yangi o'yin

source: Main game:
uz: Asosiy o'yin:

source: Maps:
uz: Xaritalar:

source: Tiles:
uz: Plitkalar:

source: A matching game played with Mahjongg tiles
uz: Mahjongg plitalari bilan mos keladigan o'yin

source: translator-credits
uz: tarjimon-kreditlar

source: _Quit
uz: _Chiqish

source: Date
uz: Sana

source: Time
uz: Vaqt

source: Moves Left:
uz: Chapga siljiydi:

source: Unpause the game
uz: O'yinni to'xtating

source: Pause the game
uz: O'yinni to'xtatib turing
