Repository: nizomovasadbek/i10n
Catalog: gnome/43/gnome-terminal.gnome-43.po
Languages: uz

source: _Backspace key generates:
uz: _Backspace tugmasi hosil qiladi:

source: _Delete key generates:
uz: _Delete kaliti hosil qiladi:

source: _Encoding:
uz: _Kodlash:

source: Ambiguous-_width characters:
uz: Noaniq-_width belgilar:

source: Enable _SIXEL images
uz: _SIXEL tasvirni yoqing

source: _Reset Compatibility Options to Defaults
uz: _Moslik parametrlarini asl holatiga qaytaring

source: Compatibility
uz: Moslik

source: Clone…
uz: Klonlash…

source: Rename…
uz: Tahrirlash

source: Delete…
uz: Oʻchirish…

source: Set as default
uz: Standart sifatida o'rnating

source: Cancel
uz: Bekor qilish

source: Black on light yellow
uz: Ochiq sariq rangda qora

source: Black on white
uz: Oq ustida qora

source: Gray on black
uz: Qora ustida kulrang

source: Green on black
uz: Qora ustida yashil

source: White on black
uz: Qora ustida oq

source: GNOME light
uz: GNOME yorug'

source: GNOME dark
uz: GNOME qorong'i

source: Tango light
uz: Tango yorug'

source: Tango dark
uz: Tango qorong'i

source: Solarized light
uz: Solarized yorug'

source: Solarized dark
uz: Solarized qorong'i

source: Error parsing command: %s
uz: Buyruqni tahlil qilishda xato: %s

source: Chinese Traditional
uz: Xitoy an'anaviy

source: Cyrillic/Russian
uz: Kirilcha/Ruscha

source: Japanese
uz: Yaponcha

source: Korean
uz: Koreyscha

source: Chinese Simplified
uz: Soddalashtirilgan Xitoycha

source: Western
uz: G'arbiy

source: Central European
uz: Markaziy Yevropa

source: Cyrillic
uz: Kirilcha

source: Turkish
uz: Turkcha

source: Arabic
uz: Arabcha

source: Nordic
uz: Shimoliy mamlakatlar

source: Baltic
uz: Boltiqbo'yi

source: Romanian
uz: Ruminiya

source: South European
uz: Janubiy Evropa

source: Greek
uz: Yunon

source: Cyrillic/Ukrainian
uz: Kirilcha / Ukraincha

source: Croatian
uz: Xorvatcha

source: Thai
uz: Taylandcha

source: Unicode
uz: Yunikod

source: Vietnamese
uz: Vetnamcha

source: Obsolete Encodings
uz: Eskirgan Kodlash Usullari

source: width
uz: kengligi

source: height
uz: balandligi

source: Choose Palette Color %u
uz: Palitra rangini tanlash %u

source: Palette entry %u
uz: Palitra yozuvi %u

source: Find
uz: Toping

source: Find previous occurrence
uz: Oldingi hodisani toping

source: Find next occurrence
uz: Keyingi hodisani toping

source: Toggle search options
uz: Qidiruv parametrlarini almashtirish

source: _Match case
uz: _Match holati

source: Match _entire word only
uz: Faqat _butun so'zni moslang

source: Match as _regular expression
uz: _regular ifoda sifatida moslang

source: _Wrap around
uz: _Atrofga oʻraling

source: New Tab
uz: Yangi tab

source: Save Contents
uz: Tarkibni saqlash

source: Export
uz: Eksport

source: Print
uz: Chop etish

source: Close Tab
uz: Tabni yopish

source: Close Window
uz: Oynani yopish

source: Copy
uz: Nusxalash

source: Copy as HTML
uz: HTML sifatida nusxalash

source: Paste
uz: Joylashtirish

source: Select All
uz: Hammasini belgilash

source: Find Next
uz: Keyingisini toping

source: Find Previous
uz: Oldingisini toping

source: Clear Highlight
uz: Ta'kidlashni tozalash

source: Hide and Show Menubar
uz: Menyu panelini yashirish va ko‘rsatish

source: Full Screen
uz: To'liq ekran

source: Zoom In
uz: Kattalashtirish

source: Zoom Out
uz: Kichraytirish

source: Normal Size
uz: Oddiy o'lcham

source: Read-Only
uz: Faqat o'qish

source: Reset
uz: Qayta o'rnatish

source: Reset and Clear
uz: Qayta tiklash va tozalash

source: Switch to Previous Tab
uz: Oldingi sahifaga o'tish

source: Switch to Next Tab
uz: Keyingi sahifaga o'tish

source: Move Tab to the Left
uz: Tabni chapga siljiting

source: Move Tab to the Right
uz: Tabni o‘ngga siljiting

source: Detach Tab
uz: Tabni ajratib oling

source: Switch to Last Tab
uz: Oxirgi tabga o‘tish

source: Contents
uz: Tarkib

source: Show Primary Menu
uz: Asosiy menyuni ko'rsatish

source: File
uz: Fayl

source: Edit
uz: Tahrirlash

source: View
uz: Ko'rinish

source: Search
uz: Qidirish

source: Tabs
uz: Tablar

source: Help
uz: Yordam

source: Switch to Tab %u
uz: Tab %u ga oʻtish

source: _Action
uz: _Harakat

source: Shortcut _Key
uz: Qisqa klavish _Key

source: New Terminal
uz: Yangi terminal

source: New _Terminal
uz: Yangi _Terminal

source: New _Tab
uz: Yangi _tab

source: New _Window
uz: Yangi _Oyna

source: Change _Profile
uz: _Profilni o'zgartirish

source: _Profile
uz: _Profil

source: Zoom _Out
uz: _Kichraytirish

source: Zoom _In
uz: _Kattalashtirish

source: _Full Screen
uz: _To'liq ekran

source: Read-_Only
uz: Faqat o'qish

source: Set _Title…
uz: _Sarlavha oʻrnatish…

source: _Advanced
uz: _Kengaytirilgan

source: _Reset
uz: _Qayta o'rnatish

source: Reset and C_lear
uz: Qayta tiklash va tozalash

source: _Inspector
uz: _Tekshiruvchi

source: _Preferences
uz: _Afzalliklar

source: _Help
uz: _Yordam

source: _About
uz: _Haqida

source: _File
uz: _Fayl

source: _Save Contents…
uz: _Tarkibni saqlash…

source: _Export…
uz: _Eksport…

source: _Print…
uz: _Chop etish…

source: C_lose Tab
uz: Tabni yopish

source: _Close Window
uz: _Oynani yopish

source: _Edit
uz: _Tahrirlash

source: _Copy
uz: _Nusxa olish

source: Copy as _HTML
uz: HTML sifatida nusxalash

source: _Paste
uz: _Joylashtirish

source: Paste as _Filenames
uz: _Fayl nomlari sifatida joylashtiring

source: Select _All
uz: Hammasini belgilash

source: P_references
uz: Afzalliklar

source: _View
uz: _Ko'rinish

source: Show _Menubar
uz: _Menubarni ko'rsatish

source: _Normal Size
uz: _Oddiy o'lcham

source: _Search
uz: Qidirish

source: _Find…
uz: _Topish…

source: Find _Next
uz: _Keyingini toping

source: Find _Previous
uz: _Oldingini toping

source: _Clear Highlight
uz: _Ajratishni tozalash

source: _Previous Tab
uz: _Oldingi tab

source: _Next Tab
uz: Keyingi tab

source: Move Terminal _Left
uz: Terminalni _chapga siljiting

source: Move Terminal _Right
uz: Terminalni _o'ngga siljiting

source: _Detach Terminal
uz: _Terminalni ajratib oling

source: _Contents
uz: _Tarkibi

source: Open in _Remote Terminal
uz: _Remote Terminalda oching

source: Open in _Local Terminal
uz: _Local Terminalda oching

source: Open the currently selected folder in a terminal
uz: Hozirda tanlangan jildni terminalda oching

source: Open the currently open folder in a terminal
uz: Hozirda ochiq jildni terminalda oching

source: Open in T_erminal
uz: Terminalda oching

source: Open T_erminal
uz: Terminalni oching

source: Open a terminal
uz: Terminalni oching

source: C_lose Terminal
uz: Terminalni _yopish

source: Option “%s” is deprecated and might be removed in a later version of gnome-terminal.
uz: '%s' varianti eskirgan va gnome-ning keyingi versiyasida olib tashlanishi mumkin.”Terminal.

source: Use “%s” to terminate the options and put the command line to execute after it.
uz: Variantlarni tugatish uchun '%s' dan foydalaning va keyin bajarish uchun buyruq qatorini qo'ying

source: Option “%s” is no longer supported in this version of gnome-terminal.
uz: “%s” varianti endi gnome-terminalning ushbu versiyasida qo‘llab-quvvatlanmaydi.

source: Argument to “%s” is not a valid command: %s
uz: “%s” argumenti yaroqli buyruq emas: %s

source: Two roles given for one window
uz: Bitta oyna uchun ikkita rol berilgan

source: “%s” option given twice for the same window
uz: “%s” opsiyasi bir xil oyna uchun ikki marta berilgan

source: Cannot pass FD %d twice
uz: FD %d ikki marta o‘tkazib bo‘lmaydi

source: “%s” is not a valid zoom factor
uz: “%s” yaroqli kattalashtirish omili emas

source: Zoom factor “%g” is too small, using %g
uz: Kattalashtirish koeffitsienti “%g” juda kichik, %g

source: Zoom factor “%g” is too large, using %g
uz: Kattalashtirish koeffitsienti “%g” juda katta, %g

source: Option “%s” requires specifying the command to run on the rest of the command line
uz: ”%s” varianti qolgan qismlarda ishlash uchun buyruqni belgilashni talab qiladibuyruqlar qatori

source: Can only use --wait once
uz: Faqatgina foydalanish mumkin - bir marta kuting

source: Not a valid terminal config file.
uz: Yaroqli terminal konfiguratsiya fayli emas.

source: Incompatible terminal config file version.
uz: Mos kelmaydigan terminal konfiguratsiya fayli versiyasi.

source: Do not register with the activation nameserver, do not re-use an active terminal
uz: Aktivizatsiya nomi serverida ro'yxatdan o'tmang, faolni qayta ishlatmangTerminal

source: Load a terminal configuration file
uz: Terminal konfiguratsiya faylini yuklang

source: FILE
uz: FAYL

source: Do not pass the environment
uz: Atrof-muhitdan o'tmang

source: Show preferences window
uz: Afzalliklar oynasini ko'rsatish

source: Print environment variables to interact with the terminal
uz: Terminal bilan o'zaro ishlash uchun muhit o'zgaruvchilarini chop eting

source: Increase diagnostic verbosity
uz: Diagnostikaning aniqligini oshiring

source: Suppress output
uz: Chiqishni bostirish

source: Open a new window containing a tab with the default profile
uz: Standart profilga ega yorliqni o'z ichiga olgan yangi oynani oching

source: Open a new tab in the last-opened window with the default profile
uz: Oxirgi ochilgan oynada standart profil bilan yangi tabni oching

source: Turn on the menubar
uz: Menyu panelini yoqing

source: Turn off the menubar
uz: Menyu panelini o'chiring

source: Maximize the window
uz: Oynani kattalashtiring

source: Full-screen the window
uz: Oynani to'liq ekranga o'tkazing

source: Set the window size; for example: 80x24, or 80x24+200+200 (COLSxROWS+X+Y)
uz: Oyna o'lchamini o'rnating; masalan: 80x24 yoki 80x24+200+200 (COLSxROWS+X+Y)

source: GEOMETRY
uz: GEOMETRIYA

source: Set the window role
uz: Oyna rolini o'rnating

source: ROLE
uz: ROL

source: Set the last specified tab as the active one in its window
uz: Oxirgi belgilangan yorliqni uning oynasida faol sifatida o'rnating

source: Execute the argument to this option inside the terminal
uz: Terminal ichida ushbu parametrga argumentni bajaring

source: Use the given profile instead of the default profile
uz: Standart profil o'rniga berilgan profildan foydalaning

source: PROFILE-NAME
uz: PROFIL-NOMI

source: Set the initial terminal title
uz: Dastlabki terminal sarlavhasini o'rnating

source: TITLE
uz: SARLAVHA

source: Set the working directory
uz: Ishchi jildni o'rnating

source: DIRNAME
uz: Jild-nomi

source: Wait until the child exits
uz: Bola chiqib ketguncha kuting

source: Forward file descriptor
uz: Oldinga fayl deskriptori

source: Set the terminal’s zoom factor (1.0 = normal size)
uz: Terminalning kattalashtirish koeffitsientini o'rnating (1,0 = normal o'lcham)

source: ZOOM
uz: KATTALASHTIRISH

source: COMMAND
uz: BUYRUQ

source: GNOME Terminal Emulator
uz: GNOME Terminal Emulyatori

source: Show GNOME Terminal options
uz: GNOME terminali parametrlarini ko'rsatish

source: Options to open new windows or terminal tabs; more than one of these may be specified:
uz: Yangi oynalar yoki terminal yorliqlarini ochish imkoniyatlari; ulardan bir nechtasi bo'lishi mumkin belgilangan:

source: Show terminal options
uz: Terminal variantlarini ko'rsatish

source: Window options; if used before the first --window or --tab argument, sets the default for all windows:
uz: Oyna parametrlari; agar birinchi --window yoki --tab argumentidan oldin ishlatilsa, o'rnatiladibarcha oynalar uchun standart:

source: Show per-window options
uz: Har bir oyna parametrlarini ko'rsatish

source: Terminal options; if used before the first --window or --tab argument, sets the default for all terminals:
uz: Terminal variantlari; agar birinchi --window yoki --tab argumentidan oldin ishlatilsa, o'rnatiladibarcha terminallar uchun standart:

source: Show per-terminal options
uz: Har bir terminal imkoniyatlarini ko'rsatish

source: Profile “%s”
uz: “%s” profili

source: Preferences – %s
uz: Afzalliklar – %s

source: New Profile
uz: Yangi profil

source: Enter name for new profile with default settings:
uz: Standart sozlamalar bilan yangi profil nomini kiriting:

source: Create
uz: Yaratmoq

source: Enter name for new profile based on “%s”:
uz: “%s” asosida yangi profil nomini kiriting:

source: %s (Copy)
uz: %s (Nusxalash)

source: Clone Profile
uz: Profilni klonlash

source: Clone
uz: Klonlash

source: Enter new name for profile “%s”:
uz: “%s” profili uchun yangi nom kiriting:

source: Rename Profile
uz: Profil nomini oʻzgartirish

source: Rename
uz: Tahrirlash

source: Really delete profile “%s”?
uz: Haqiqatan ham “%s” profili o‘chirilsinmi?

source: Delete Profile
uz: Profilni o'chirish

source: This is the default profile
uz: Bu standart profil

source: Shortcuts
uz: Yorliqlar

source: Profiles
uz: Profillar

source: No command supplied nor shell requested
uz: Hech qanday buyruq berilmagan yoki shell so'ralmagan

source: _Relaunch
uz: _Qayta ishga tushirish

source: There was an error creating the child process for this terminal
uz: Ushbu terminal uchun voris jarayonini yaratishda xatolik yuz berdi

source: The child process exited normally with status %d.
uz: voris jarayoni normal holatda %d bilan chiqdi.

source: The child process was aborted by signal %d.
uz: Vorislar jarayoni %d signali bilan toʻxtatildi.

source: The child process was aborted.
uz: Voris jarayoni to'xtatildi.

source: Close tab
uz: Tabni yoping

source: There was an error displaying help
uz: Yordamni ko‘rsatishda xatolik yuz berdi

source: Contributors:
uz: Ishtirokchilar:

source: Version %s for GNOME %d
uz: GNOME %d uchun %s versiyasi

source: Using VTE version %u.%u.%u
uz: VTE versiyasidan %u.%u.%u

source: A terminal emulator for the GNOME desktop
uz: GNOME ish stoli uchun terminal emulyatori

source: GNOME Terminal
uz: GNOME terminali

source: translator-credits
uz: tarjimon-kreditlar

source: Could not open the address “%s”
uz: “%s” manzilini ochib bo‘lmadi

source: GNOME Terminal is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
uz: GNOME terminali bepul dasturiy ta'minot: uni qayta tarqatishingiz va/yoki o'zgartirishingiz mumkinOzod tomonidan nashr etilgan GNU General Public License shartlariga muvofiqDasturiy ta'minot fondi, litsenziyaning 3-versiyasi yoki (sizning xohishingizga ko'ra)har qanday keyingi versiya.

source: GNOME Terminal is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
uz: GNOME terminali foydali bo'ladi degan umidda tarqatiladi, ammoHECH QANDAY KAFOLATSIZ; hatto sotuvga yaroqlilik kafolati hamsizbatafsil ma'lumotlar.

source: You should have received a copy of the GNU General Public License along with GNOME Terminal. If not, see <http://www.gnu.org/licenses/>.
uz: GNOME terminali. Agar yoʻq boʻlsa, qarang: <http://www.gnu.org/licenses/>.

source: “file” scheme with remote hostname not supported
uz: Masofaviy xost nomi bilan ”fayl” sxemasi qo'llab-quvvatlanmaydi

source: Could not save contents
uz: Kontentni saqlab bo‘lmadi

source: Save as…
uz: Saqlash…

source: _Cancel
uz: _Bekor qilish

source: _Save
uz: _Saqlash

source: Open _Hyperlink
uz: _Giperhavolani oching

source: Copy Hyperlink _Address
uz: Giperhavola _Manzilni nusxalash

source: Send Mail _To…
uz: Xat yuborish _Kimga…

source: Copy Mail _Address
uz: Pochta _manzilini nusxalash

source: Call _To…
uz: _Qo'ng'iroq qiling…

source: Copy Call _Address
uz: Qo'ng'iroq _manzilini nusxalash

source: _Open Link
uz: _ Havolani oching

source: Copy _Link
uz: _Linkni nusxalash

source: P_rofiles
uz: Profillar

source: L_eave Full Screen
uz: To'liq ekranni qoldiring

source: Close this window?
uz: Bu oyna yopilsinmi?

source: There are still processes running in some terminals in this window. Closing the window will kill all of them.
uz: Ushbu oynadagi ba'zi terminallarda hali ham jarayonlar ishlamoqda. Yopilmoqda Oynalarning hammasini yopiladi.

source: There is still a process running in this terminal. Closing the terminal will kill it.
uz: Ushbu terminalda hali ham jarayon davom etmoqda. Terminalni yopish Uzish

source: C_lose Window
uz: Oynani yopish

source: Failed to parse arguments: %s
uz: Argumentlarni tahlil qilib bo‘lmadi: %s
