Repository: nizomovasadbek/i10n
Catalog: gnome/43/gnome-color-manager.master.po
Languages: uz

source: GNOME Color Manager
uz: GNOME Rang menejeri

source: Inspect and compare installed color profiles
uz: O'rnatilgan rang profillarini tekshiring va solishtiring

source: GNOME Color Profile Viewer shows installed color profiles on your system and allows you to calibrate displays, printers and cameras using a wizard.
uz: GNOME Rang profilini ko'rish dasturi tizimingizda o'rnatilgan rang profillarini ko'rsatadi vaWizard yordamida displeylar, printerlar va kameralarni kalibrlash imkonini beradi.

source: This functionality is typically used by GNOME Control Center from the color panel although can be used on its own.
uz: Ushbu funksiya odatda GNOME boshqaruv markazi tomonidan rangdan foydalaniladipanel mustaqil ravishda ishlatilishi mumkin.

source: ICC Profile Installer
uz: ICC profilini o'rnatuvchi

source: Install ICC profiles
uz: ICC profillarini o'rnating

source: Use the color sensor to sample spot colors
uz: Spot ranglarini namuna olish uchun rang sensoridan foydalaning

source: Color Profile Viewer
uz: Rangli profilni ko'rish vositasi

source: No profile
uz: Profil yo'q

source: Default %s
uz: Standart %s

source: Default:
uz: Standart:

source: Colorspace:
uz: Rang maydoni:

source: Test profile:
uz: Sinov profili:

source: Show debugging information for all files
uz: Barcha fayllar uchun disk raskadrovka ma'lumotlarini ko'rsatish

source: Debugging Options
uz: Nosozliklarni tuzatish opsiyalari

source: Show debugging options
uz: Nosozliklarni tuzatish variantlarini ko'rsatish

source: ICC profile to install
uz: O'rnatish uchun ICC profili

source: No filename specified
uz: Hech qanday fayl nomi belgilanmagan

source: Failed to open ICC profile
uz: ICC profilini ochib bo‘lmadi

source: Failed to parse file: %s
uz: Faylni tahlil qilib bo‘lmadi: %s

source: Profile description: %s
uz: Profil tavsifi: %s

source: Profile copyright:
uz: Profil mualliflik huquqi:

source: Color profile is already imported
uz: Rang profili allaqachon import qilingan

source: Show Details
uz: Tafsilotlarni ko'rsatish

source: Import display color profile?
uz: Displey rang profili import qilinsinmi?

source: Import device color profile?
uz: Qurilmaning rang profili import qilinsinmi?

source: Import named color profile?
uz: Rangli profil import qilinsinmi?

source: Import color profile?
uz: Rang profili import qilinsinmi?

source: Failed to import file
uz: Faylni import qilib bo‘lmadi

source: Description:
uz: Tavsif:

source: Copyright:
uz: Mualliflik huquqi:

source: Root window profile:
uz: Root oynasi profili:

source: Root window protocol version:
uz: Root oynasi protokoli versiyasi:

source: The request failed:
uz: So‘rov bajarilmadi:

source: There are no ICC profiles assigned to this file
uz: Ushbu faylga hech qanday ICC profili tayinlanmagan

source: Suitable profiles for:
uz: Quyidagilar uchun mos profillar:

source: There are no ICC profiles for this window
uz: Ushbu oyna uchun ICC profillari mavjud emas

source: Show xserver properties
uz: Xserver xususiyatlarini ko'rsatish

source: Get the profiles for a specific file
uz: Muayyan fayl uchun profillarni oling

source: Get the profile for a specific window
uz: Muayyan oyna uchun profilni oling

source: Dump all details about this system
uz: Ushbu tizim haqidagi barcha tafsilotlarni o'chirib tashlang

source: EDID inspect program
uz: EDID tekshirish dasturi

source: Unknown
uz: Noma'lum

source: No colorimeter is attached.
uz: Hech qanday kolorimetr biriktirilmagan.

source: The sensor has no native driver.
uz: Sensorda mahalliy drayver yo'q.

source: The attached colorimeter is not capable of reading a spot color.
uz: Biriktirilgan kolorimetr nuqta rangini o'qishga qodir emas.

source: No %s color spaces available
uz: %s rang maydoni mavjud emas

source: Set the parent window to make this modal
uz: Ushbu modal qilish uchun parent o'rnating

source: GNOME Color Manager Color Picker
uz: GNOME Rang menejeri rang tanlash

source: Media whitepoint
uz: Media oq nuqtasi

source: Color Temperature
uz: Rang harorati

source: Ambient
uz: Muhit

source: Colorspace
uz: Rang maydoni

source: Error
uz: Xato

source: Results
uz: Natijalar

source: _Measure
uz: _O'lchov

source: gray
uz: kulrang

source: Permanently delete profile?
uz: Profil butunlay oʻchirilsinmi?

source: Are you sure you want to remove this profile from your system permanently?
uz: Ushbu profilni tizimingizdan butunlay olib tashlamoqchimisiz?

source: Delete
uz: Oʻchirish

source: Select ICC Profile File
uz: ICC profil faylini tanlang

source: _Cancel
uz: _Bekor qilish

source: Supported ICC profiles
uz: Qo'llab-quvvatlanadigan ICC profillari

source: All files
uz: Barcha fayllar

source: Failed to copy file
uz: Faylni nusxalab bo‘lmadi

source: Input device
uz: Kirish qurilmasi

source: Display device
uz: Displey qurilmasi

source: Output device
uz: Chiqish qurilmasi

source: Devicelink
uz: Qurilma havolasi

source: Colorspace conversion
uz: Rang maydonini aylantirish

source: Abstract
uz: Abstrakt

source: Named color
uz: Nomlangan rang

source: Gray
uz: Kulrang

source: Standard space
uz: Standart joy

source: Display model
uz: Ko'rsatish modeli

source: Display serial number
uz: Seriya raqamini ko'rsatish

source: Display PNPID
uz: PNPID ko'rsatish

source: Framework product
uz: Framework mahsuloti

source: Framework program
uz: Framework dasturi

source: Framework version
uz: Framework versiyasi

source: Data source type
uz: Ma'lumotlar manbai turi

source: Mapping format
uz: Xarita formati

source: Mapping qualifier
uz: Xaritalash kvalifikatsiyasi

source: Mapping device
uz: Xaritalash qurilmasi

source: Delta-E average
uz: Delta-E o'rtacha

source: Delta-E maximum
uz: Delta-E maksimal

source: Calibration device
uz: Kalibrlash moslamasi

source: Screen surface finish
uz: Ekran yuzasini tugatish

source: Connection type
uz: Ulanish turi

source: Screen brightness
uz: Ekran yorqinligi

source: Gamut volume
uz: Gamut hajmi

source: sRGB coverage
uz: sRGB qamrovi

source: Adobe RGB coverage
uz: Adobe RGB qamrovi

source: No description has been set
uz: Hech qanday tavsif o'rnatilmagan

source: No copyright has been set
uz: Mualliflik huquqi belgilanmagan

source: The display compensation table is invalid
uz: Displey kompensatsiya jadvali yaroqsiz

source: The gray axis contains significant amounts of color
uz: Kulrang o'q sezilarli miqdorda rangni o'z ichiga oladi

source: The gray axis is non-monotonic
uz: Kulrang o'q monotonik emas

source: One or more of the primaries are invalid
uz: Bir yoki bir nechta asosiy tanlov noto‘g‘ri

source: The primaries do not add to white
uz: Primerlar oq rangga qo'shilmaydi

source: One or more of the primaries is unlikely
uz: Bir yoki bir nechta praymeriz bo'lishi ehtimoldan yiroq emas

source: The white is not D50 white
uz: Oq rang D50 oq emas

source: Unknown warning type
uz: Noma'lum ogohlantirish turi

source: Yes
uz: Ha

source: No
uz: Yo'q

source: The profile has the following problems:
uz: Profilda quyidagi muammolar mavjud:

source: Delete this profile
uz: Ushbu profilni o'chirish

source: This profile cannot be deleted
uz: Bu profilni oʻchirib boʻlmaydi

source: Set the specific profile to show
uz: Ko'rsatish uchun maxsus profilni o'rnating

source: Set the specific file to show
uz: Ko'rsatish uchun maxsus faylni o'rnating

source: Add a profile for the device
uz: Qurilma uchun profil qo'shing

source: Remove a profile from the device
uz: Qurilmadan profilni olib tashlang

source: Profile type
uz: Profil turi

source: Created
uz: Yaratilgan

source: Version
uz: Versiya

source: Manufacturer
uz: Ishlab chiqaruvchi

source: Display correction
uz: Displeyni tuzatish

source: White point
uz: Oq nuqta

source: Copyright
uz: Mualliflik huquqi

source: File size
uz: Fayl hajmi

source: Filename
uz: Fayl nomi

source: Warnings
uz: Ogohlantirishlar

source: Information
uz: Ma'lumot

source: A CIE 1931 diagram shows a 2D representation of the profile gamut
uz: CIE 1931 diagrammasi profil gamutining 2D ko'rinishini ko'rsatadi

source: Response out
uz: Javob berish

source: Response in
uz: Javob

source: Video card out
uz: Video karta chiqdi

source: A video card gamma table shows the curves loaded into the display
uz: Video karta gamma-jadvalida displeyga yuklangan egri chiziqlar ko'rsatilgan

source: Previous Image
uz: Oldingi rasm

source: sRGB example
uz: sRGB misoli

source: Next Image
uz: Keyingi rasm

source: This shows what an image would look like if saved with the profile
uz: Bu profil bilan saqlangan rasm qanday ko'rinishini ko'rsatadi

source: From sRGB
uz: sRGB dan

source: This shows what an image would look like if opened with the profile
uz: Bu profil bilan ochilganda rasm qanday ko'rinishini ko'rsatadi

source: To sRGB
uz: sRGB gacha

source: Named colors are specific colors that are defined in the profile
uz: Nomlangan ranglar profilda belgilangan o'ziga xos ranglardir

source: Named Colors
uz: Nomlangan ranglar

source: Metadata is additional information stored in the profile for programs to use.
uz: Metama'lumotlar - bu dasturlardan foydalanish uchun profilda saqlanadigan qo'shimcha ma'lumot.

source: Metadata
uz: Metama'lumot
