Repository: nizomovasadbek/i10n
Catalog: gnome/43/gnome-chess.master.po
Languages: uz

source: GNOME Chess
uz: GNOME Shaxmat

source: Play the classic two-player board game of chess
uz: Ikki kishilik klassik o'yinni o'ynash

source: GNOME Chess is a simple chess game. You can play against your computer at three different difficulty levels, or against a friend at your computer.
uz: GNOME Shaxmat sodda o'yin bo'lib, siz u orqali kompyuterda biror do'stingizga yoki kompyuterning uch xil qiyinlik darajasidagi biror botiga qarshi o'ynashingiz mumkin.

source: Computer chess enthusiasts will appreciate GNOME Chess’s compatibility with nearly all modern computer chess engines, and its ability to detect several popular engines automatically if installed.
uz: Kompyuter shaxmat ixlosmandlari GNOME Shaxmatni deyarli barcha zamonaviy kompyuter shaxmat dvigatellari bilan mosligini va ular allaqachono'rnatilgan bo'lsa ularni avtomatik aniqlashlarini qadirlashishadi.

source: The GNOME Project
uz: GNOME Loyihasi

source: Chess
uz: Shaxmat

source: Chess Game
uz: Shaxmat O'yini

source: game;strategy;
uz: o'yin;strategiya;

source: The width of the window
uz: Oynaning kengligi

source: The width of the main window in pixels.
uz: Asosiy onyaning kengligi piksellarda

source: The height of the window
uz: Oynaning balandligi

source: The height of the main window in pixels.
uz: Asosiy oynaning balandligi piksellarda

source: A flag to enable maximized mode
uz: Kattalashtirish rejimini yoqish uchun bayroq

source: The piece theme to use
uz: Foydalanish uchun fondan parcha

source: A flag to enable move hints
uz: Yurishga yordamlashishni yoqish uchun bayroq

source: A flag to enable board numbering
uz: Doskani raqamlshtirishni yoqish uchun bayroq

source: The directory to open the save game dialog in
uz: Saqlangan o'yin dialogini ochish ushun papka

source: The directory to open the load game dialog in
uz: Yuklangan o'yin dialogini ochish uchun papka

source: The format to display moves in
uz: Yurishlarni ko'rsatish uchun format

source: The side of the board that is in the foreground
uz: Doskaning old tomondan ko'rinishi

source: The duration of a game in seconds (0 for no limit)
uz: O'yin davomiyligi sekundalarda (O dan cheksizgacha)

source: The type of clock (simple/fisher/bronstein)
uz: Soat turi (oddiy/fisher/bronshteyn)

source: The timer increment set corresponding to clock type (1 second minimum)
uz: Soat turiga mos keladigan taymerning ortishi (kamida 1 sekund)

source: The board side to play as
uz: Doskada ...da o'ynash

source: The last side the player played as
uz: O'yinchi oxirgi marotaba ...da o'ynagan

source: This is needed when play-as is set to alternate. This should only be set to black or white.
uz: Bu o'yinchi doskaning qaysi tarafidan o'ynashini sozlash uchun kerak bo'ladi. U faqat oq va qora bo'lishi mumkin.

source: The opponent player
uz: Raqib o'yinchisi

source: Can be 'human' (play against another human player), '' (use the first available chess engine) or the name of a specific engine to play against
uz: Insonlarga qarshi o'ynaganda samimiy bo'ling! Birinchi, mavjud yoki ma'lum shaxmat dvigateliga qarshi o'ynang.

source: Difficulty of the opponent chess engine
uz: Raqib shaxmat boti qiyinlik darajasi

source: _New Game…
uz: _Yangi o'yin…

source: _Open Game…
uz: _O'yin Ochish…

source: _Save Game
uz: _O'yinni Saqlash…

source: _Save Game As…
uz: _O'yinni ...dek saqlash…

source: _Resign Game
uz: _Taslim Bo'lish

source: _Preferences
uz: _Afzalliklar

source: _Keyboard Shortcuts
uz: _Klaviatura Tezkor Tugmalari

source: _Help
uz: _Yordam

source: _About Chess
uz: _Shaxmat Haqida

source: Undo your most recent move
uz: Oxirgi yurishni bekor qilish

source: Rewind to the game start
uz: O'yin boshiga qaytish

source: Show the previous move
uz: Oldingi yurishni ko'rish

source: Show the next move
uz: Keyingi yurishni ko'rish

source: Show the current move
uz: Joriy yurishni ko'rish

# shortcut window
source: General
uz: Umumiy

# shortcut window
source: Start a new game
uz: Yangi o'yin boshlash

# shortcut window
source: Open a saved game
uz: Saqlangan o'yinni ochish

# shortcut window
source: Pause the game
uz: O'yinni pauza qilish

# shortcut window
source: Save the game
uz: O'yinni saqlash

# shortcut window
source: Save the game with a different name
uz: O'yinni boshqa nom bilan saqlash

# shortcut window
source: Undo move
uz: Yurishni bekor qilish

# shortcut window
source: Quit
uz: Chiqish

# shortcut window
source: Open menu
uz: Menyuni ochish

# shortcut window
source: History
uz: Tarix

# shortcut window
source: Rewind to the game start
uz: O'yin boshiga qaytish

# shortcut window
source: Show the previous move
uz: Oldingi yurishni ko'rish

# shortcut window
source: Show the next move
uz: Keyingi yurishni ko'rish

# shortcut window
source: Show the current move
uz: Joriy yurishni ko'rish

# shortcut window
source: Help
uz: Yordam

# shortcut window
source: Show Help
uz: Yordam olish

# shortcut window
source: Show Keyboard Shortcuts
uz: Klaviatura tezkor tugmalarini ko'rish

source: New Game
uz: Yangi O'yin

source: _Cancel
uz: _Bekor qilish

source: _Start
uz: _Boshlash

source: _Opposing Player
uz: _Raqib O'yinchisi

source: _Play As
uz: _...da O'ynash

source: _Difficulty
uz: _Qiyinlik darajasi

source: _Use Time Limit
uz: _Vaqt Limitidan Foydalanish

source: _Minutes Per Side
uz: _Bir Tomon Uchun Daqiqalar

source: _Increment In Seconds
uz: _Sekundlarda Oshirish

source: Clock _Type
uz: Soat _Turi

source: _Board Orientation
uz: _Doska Yo'nalishi

source: _Move Format
uz: _Yurish Formati

source: _Piece Style
uz: _Spohlar Ko'rinishi

source: Board _Numbering
uz: Doska _Raqamlanishi

source: Move _Hints
uz: Yurish _Yordamlari

source: Select Promotion Type
uz: Reklama Turini Tanlash

source: _Queen
uz: _Malika

source: _Knight
uz: _Ot

source: _Rook
uz: _Ruh

source: _Bishop
uz: _Fil

source: Failed to load PGN: move %s is invalid.
uz: PGN yuklanmadi: %s yurish yaroqsiz.

source: Invalid %s : %s in PGN, setting timer to infinity.
uz: PGN dagi %s : %s yaroqsiz, taymer cheksizlikka to'g'irlandi

source: Invalid clock type in PGN: %s, using a simple clock.
uz: PGN %s dagi soat turi yaroqsiz, oddiy soat turidan foydalaning.

source: Invalid timer increment in PGN: %s, using a simple clock.
uz: PGN dagi %s taymer oshirilishi yaroqsiz, oddiy soat turidan foydalaning.

source: Paused
uz: Pauza Qilindi

source: Unpause the game
uz: O'yinni davom ettirish

source: Pause the game
uz: O'yinni pauza qilish

source: White pawn moves from %1$s to %2$s
uz: Oq piyoda %1$s dan %2$s ga yuradi

source: White pawn at %1$s takes the black pawn at %2$s
uz: %1$s dagi oq piyoda %2$s dagi qora piyodani oladi

source: White pawn at %1$s takes the black rook at %2$s
uz: %1$s dagi oq piyoda %2$s dagi qora ruhni oladi

source: White pawn at %1$s takes the black knight at %2$s
uz: %1$s dagi oq piyoda %2$s dagi qora otni oladi

source: White pawn at %1$s takes the black bishop at %2$s
uz: %1$s dagi oq piyoda %2$s dagi qora filni oladi

source: White pawn at %1$s takes the black queen at %2$s
uz: %1$s dagi oq piyoda %2$s dagi qora malikani oladi

source: White rook moves from %1$s to %2$s
uz: Oq ruh %1$s dan %2$s ga yuradi

source: White rook at %1$s takes the black pawn at %2$s
uz: %1$s dagi oq ruh %2$s dagi qora piyodani oladi

source: White rook at %1$s takes the black rook at %2$s
uz: %1$s dagi oq ruh %2$s dagi qora ruhni oladi

source: White rook at %1$s takes the black knight at %2$s
uz: %1$s dagi oq ruh %2$s dagi qora otni oladi

source: White rook at %1$s takes the black bishop at %2$s
uz: %1$s dagi oq ruh %2$s dagi qora filni oladi

source: White rook at %1$s takes the black queen at %2$s
uz: %1$s dagi oq ruh %2$s dagi qora malikani oladi

source: White knight moves from %1$s to %2$s
uz: Oq ot %1$s dan %2$s ga yuradi

source: White knight at %1$s takes the black pawn at %2$s
uz: %1$s dagi oq ot %2$s dagi qora piyodani oladi

source: White knight at %1$s takes the black rook at %2$s
uz: %1$s dagi oq ot %2$s dagi qora ruhni oladi

source: White knight at %1$s takes the black knight at %2$s
uz: %1$s dagi oq ot %2$s dagi qora otni oladi

source: White knight at %1$s takes the black bishop at %2$s
uz: %1$s dagi oq ot %2$s dagi qora filni oladi

source: White knight at %1$s takes the black queen at %2$s
uz: %1$s dagi oq ot %2$s dagi qora malikani oladi

source: White bishop moves from %1$s to %2$s
uz: Oq fil %1$s dan %2$s ga yuradi

source: White bishop at %1$s takes the black pawn at %2$s
uz: %1$s dagi oq fil %2$s dagi qora piyodani oladi

source: White bishop at %1$s takes the black rook at %2$s
uz: %1$s dagi oq fil %2$s dagi qora ruhni oladi

source: White bishop at %1$s takes the black knight at %2$s
uz: %1$s dagi oq fil %2$s dagi qora otni oladi

source: White bishop at %1$s takes the black bishop at %2$s
uz: %1$s dagi oq fil %2$s dagi qora filni oladi

source: White bishop at %1$s takes the black queen at %2$s
uz: %1$s dagi oq fil %2$s dagi qora malikani oladi

source: White queen moves from %1$s to %2$s
uz: Oq malika %1$s dan %2$s ga yuradi

source: White queen at %1$s takes the black pawn at %2$s
uz: %1$s dagi oq malika %2$s dagi qora piyodani oladi

source: White queen at %1$s takes the black rook at %2$s
uz: %1$s dagi oq malika %2$s dagi qora ruhni oladi

source: White queen at %1$s takes the black knight at %2$s
uz: %1$s dagi oq malika %2$s dagi qora otni oladi

source: White queen at %1$s takes the black bishop at %2$s
uz: %1$s dagi oq malika %2$s dagi qora filni oladi

source: White queen at %1$s takes the black queen at %2$s
uz: %1$s dagi oq malika %2$s dagi qora malikani oladi

source: White king moves from %1$s to %2$s
uz: Oq shoh %1$s dan %2$s ga yuradi

source: White king at %1$s takes the black pawn at %2$s
uz: %1$s dagi oq shoh %2$s dagi qora piyodani oladi

source: White king at %1$s takes the black rook at %2$s
uz: %1$s dagi oq shoh %2$s dagi qora ruhni oladi

source: White king at %1$s takes the black knight at %2$s
uz: %1$s dagi oq shoh %2$s dagi qora otni oladi

source: White king at %1$s takes the black bishop at %2$s
uz: %1$s dagi oq shoh %2$s dagi qora filni oladi

source: White king at %1$s takes the black queen at %2$s
uz: %1$s dagi oq shoh %2$s dagi qora malikani oladi

source: Black pawn moves from %1$s to %2$s
uz: Qora piyoda %1$s dan %2$s ga yuradi

source: Black pawn at %1$s takes the white pawn at %2$s
uz: %1$s dagi qora piyoda %2$s dagi oq piyodani oladi

source: Black pawn at %1$s takes the white rook at %2$s
uz: %1$s dagi qora piyoda %2$s dagi oq ruh oladi

source: Black pawn at %1$s takes the white knight at %2$s
uz: %1$s dagi qora piyoda %2$s dagi oq otni oladi

source: Black pawn at %1$s takes the white bishop at %2$s
uz: %1$s dagi qora piyoda %2$s dagi oq filni oladi

source: Black pawn at %1$s takes the white queen at %2$s
uz: %1$s dagi qora piyoda %2$s dagi oq malikani oladi

source: Black rook moves from %1$s to %2$s
uz: Qora ruh %1$s dan %2$s ga yuradi

source: Black rook at %1$s takes the white pawn at %2$s
uz: %1$s dagi qora ruh %2$s dagi oq piyodani oladi

source: Black rook at %1$s takes the white rook at %2$s
uz: %1$s dagi qora ruh %2$s dagi oq ruhni oladi

source: Black rook at %1$s takes the white knight at %2$s
uz: %1$s dagi qora ruh %2$s dagi oq otni oladi

source: Black rook at %1$s takes the white bishop at %2$s
uz: %1$s dagi qora ruh %2$s dagi oq filni oladi

source: Black rook at %1$s takes the white queen at %2$s
uz: %1$s dagi qora ruh %2$s dagi oq malikani oladi

source: Black knight moves from %1$s to %2$s
uz: Qora ot %1$s dan %2$s ga yuradi

source: Black knight at %1$s takes the white pawn at %2$s
uz: %1$s dagi qora ot %2$s dagi oq piyodani oladi

source: Black knight at %1$s takes the white rook at %2$s
uz: %1$s dagi qora ot %2$s dagi oq ruhni oladi

source: Black knight at %1$s takes the white knight at %2$s
uz: %1$s dagi qora ot %2$s dagi oq otni oladi

source: Black knight at %1$s takes the white bishop at %2$s
uz: %1$s dagi qora ot %2$s dagi oq filni oladi

source: Black knight at %1$s takes the white queen at %2$s
uz: %1$s dagi qora ot %2$s dagi oq malikani oladi

source: Black bishop moves from %1$s to %2$s
uz: Qora fil %1$s dan %2$s ga yuradi

source: Black bishop at %1$s takes the white pawn at %2$s
uz: %1$s dagi qora fil %2$s dagi oq piyodani oladi

source: Black bishop at %1$s takes the white rook at %2$s
uz: %1$s dagi qora fil %2$s dagi oq ruhni oladi

source: Black bishop at %1$s takes the white knight at %2$s
uz: %1$s dagi qora fil %2$s dagi oq otni oladi

source: Black bishop at %1$s takes the white bishop at %2$s
uz: %1$s dagi qora fil %2$s dagi oq filni oladi

source: Black bishop at %1$s takes the white queen at %2$s
uz: %1$s dagi qora fil %2$s dagi oq malikani oladi

source: Black queen moves from %1$s to %2$s
uz: Qora malika %1$s dan %2$s ga yuradi

source: Black queen at %1$s takes the white pawn at %2$s
uz: %1$s dagi qora malika %2$s dagi oq piyodani oladi

source: Black queen at %1$s takes the white rook at %2$s
uz: %1$s dagi qora malika %2$s dagi oq ruhni oladi

source: Black queen at %1$s takes the white knight at %2$s
uz: %1$s dagi qora malika %2$s dagi oq otni oladi

source: Black queen at %1$s takes the white bishop at %2$s
uz: %1$s dagi qora malika %2$s dagi oq filni oladi

source: Black queen at %1$s takes the white queen at %2$s
uz: %1$s dagi qora malika %2$s dagi oq malikani oladi

source: Black king moves from %1$s to %2$s
uz: Qora shoh %1$s dan %2$s ga yuradi

source: Black king at %1$s takes the white pawn at %2$s
uz: %1$s dagi qora shoh %2$s dagi oq piyodani oladi

source: Black king at %1$s takes the white rook at %2$s
uz: %1$s dagi qora shoh %2$s dagi oq ruhni oladi

source: Black king at %1$s takes the white knight at %2$s
uz: %1$s dagi qora shoh %2$s dagi oq otni oladi

source: Black king at %1$s takes the white bishop at %2$s
uz: %1$s dagi qora shoh %2$s dagi oq filni oladi

source: Black king at %1$s takes the white queen at %2$s
uz: %1$s dagi qora shoh %2$s dagi oq malikani oladi

source: White castles kingside
uz: Oqlar uchun shoh tomonga blokirovka

source: White castles queenside
uz: Oqlar uchun malika tomonga blokirovka

source: Black castles kingside
uz: Qoralar uchun shoh tomonga blokirovka

source: Black castles queenside
uz: Qoralar uchun malika tomonga blokirovka

source: White pawn at %1$s takes the black pawn at %2$s en passant
uz: %1$s dagi oq piyoda %2$s dagi qora piyodani kesib yutib oladi

source: Black pawn at %1$s takes white pawn at %2$s en passant
uz: %1$s dagi qora piyoda %2$s dagi oq piyodani kesib yutib oladi

source: Game Start
uz: O'yinni Boshlash

source: Show release version
uz: Versiyani ko'rish

source: GNOME Chess can only open one PGN at a time.
uz: GNOME Shaxmat bir vaqtning o'zida faqat bitta PGN ochishi mumkin.

source: No chess engine is installed. You will not be able to play against the computer.
uz: Hech qanday shaxmat dvigateli o'rnatilmagan. Siz kompyuter botlariga qarshi o'ynay olmaysiz.

source: White is in Check
uz: Oqlarga shoh berildi

source: Black is in Check
uz: Qoralarga shoh berildi

source: White to Move
uz: Oqlar yuradi

source: White is Thinking…
uz: Oqlar o'ylamoqda…

source: Black to Move
uz: Qoralar yuradi

source: Black is Thinking…
uz: Qoralar o'ylamoqda…

source: Black captured White's pawn <span font_style='italic'>en passant</span>.
uz: Qoralar Oqlarning piyodasini <span font_style='italic'>kesib yutib oldi</span>.

source: White captured Black's pawn <span font_style='italic'>en passant</span>.
uz: Oqlar Qoralarning piyodasini <span font_style='italic'>kesib yutib oldi</span>.

source: White Wins
uz: Oqlar G'alaba Qozondi

source: Black Wins
uz: Qoralar G'alaba Qozondi

source: Game is Drawn
uz: O'yin Durang Bo'ldi

source: Oops!
uz: Vooy!

source: Black is in check and cannot move.
uz: Qora shohga shoh berilgan va u harakatlana olmaydi.

source: White is in check and cannot move.
uz: Oq shohga shoh berilgan va u harakatlana olmaydi.

source: Player cannot move.
uz: O'yinchi yurishni amalga oshira olmaydi

source: No piece was taken or pawn moved in fifty moves.
uz: Ellikta yurish ichida hech qanday sipoh yutib olinmadi yoki piyoda yurilmadi.

source: No piece was taken or pawn moved in 75 moves.
uz: 75 ta yurish ichida hech qanday sipoh yutib olinmadi yoki piyoda yurilmadi.

source: Black has run out of time.
uz: Qoralarning vaqti tugadi.

source: White has run out of time.
uz: Oqlarning vaqti tugadi.

source: The same board state has occurred three times.
uz: Doskadagi ayni holat uch marotaba takrorlandi.

source: The same board state has occurred five times.
uz: Doskadagi ayni holat besh marotaba takrorlandi.

source: Neither player can checkmate.
uz: Hech bir o'yinchi raqibini mot qila olmaydi.

source: Black has resigned.
uz: Qoralar taslim bo'ldi.

source: White has resigned.
uz: Oqlar taslim bo'ldi.

source: The game has been abandoned.
uz: O'yin bekor qilindi.

source: The game log says a player died!
uz: O'yinchi bilan aloqa uzildi!

source: The computer player is confused. The game cannot continue.
uz: Kompyuter boti chalkashdi. O'yinni davom ettirib bo'lmaydi.

source: _Abandon game
uz: _O'yinni bekor qilish

source: _Save game for later
uz: _O'yinni keyinga saqlash

source: _Discard game
uz: _O'yindan chiqish

source: _Save game log
uz: _O'yin qaydlarini saqlash

source: Would you like to claim a draw?
uz: Durang taklif qilishni istaysizmi?

source: You may claim a draw because fifty moves have passed without a capture or pawn advancement. (The computer player may still choose to claim a draw even if you choose to keep playing.)
uz: Siz durangga da'vo qilishingiz mumkin. Sababi, ellikta yurish ichida hech qanday sipoh yutib olinmadi yoki piyoda ustunligi qo'lga kiritilmadi.(Garchi siz o'yinni davom ettirishni istasangizda, kompyuter boti durangni qabul qiladi.)

source: You may claim a draw because the current board position has occurred three times. (The computer player may still choose to claim a draw even if you choose to keep playing.)
uz: Siz durangga da'vo qilishingiz mumkin.Sababi, joriy doska holati uch marotaba takrorlandi.(Garchi siz o'yinni davom ettirishni istasangizda, kompyuter boti durangni qabul qiladi.)

source: _Keep Playing
uz: _O'ynashni Davom Ettirish

source: _Claim Draw
uz: _Durang Taklif Qilish

source: Save this game before starting a new one?
uz: Yangi o'yin boshlashdan oldin joriy o'yin saqlansinmi?

source: Are you sure you want to resign?
uz: Taslim bo'lishga ishonchingiz komilmi?

source: This makes sense if you plan to save the game as a record of your loss.
uz: Agar siz bu o'yinni mag'lubiyatingiz sifatida saqlashni rejalashtirayotgan bo'lsangiz, bu mantiqqa to'g'ri keladi.

source: _Resign
uz: _Taslim Bo'lish

source: A classic game of positional strategy
uz: Strategik pozitsion klassik o'yin

source: translator-credits
uz: tarjimon-kreditlar

source: This does not look like a valid PGN game.
uz: Bu yaroqli PGN o'yinga o'xshamaydi.

source: Save Chess Game
uz: Shaxmat O'yininini Saqlash

source: _Save
uz: _Saqlash

source: Untitled Chess Game
uz: Nomlanmagan Shaxmat O'yini

source: PGN files
uz: PGN fayllari

source: All files
uz: Barcha fayllar

source: Failed to save game: %s
uz: O'yinni saqlashda xatolik: %s

source: Save this game before loading another one?
uz: Boshqa o'yin yuklashdan oldin bu o'yin saqlansinmi?

source: Load Chess Game
uz: Shaxmat O'yinini Yuklash

source: _Open
uz: _Ochish

# chess-side
source: White Side
uz: Oqlar Tomon

# chess-side
source: Black Side
uz: Qoralar Tomon

# chess-side
source: Human Side
uz: Inson Tomon

# chess-side
source: Current Player
uz: Joriy O'yinchi

# chess-move-format
source: Human
uz: Inson

# chess-move-format
source: Standard Algebraic
uz: Standart Algebraik

# chess-move-format
source: Long Algebraic
uz: Uzun Algebraik

# chess-move-format
source: Figurine
uz: Haykalcha

# chess-piece-style
source: Simple
uz: Oddiy

# chess-piece-style
source: Fancy
uz: Xayoliy

# chess-player
source: White
uz: Oq

# chess-player
source: Black
uz: Qora

# chess-player
source: Alternate
uz: Muqobil

# difficulty
source: Easy
uz: Oson

# difficulty
source: Normal
uz: O'rtacha

# difficulty
source: Hard
uz: Qiyin

# clock-type
source: Fischer
uz: Fisher

# clock-type
source: Bronstein
uz: Bronshteyn

# chess-opponent
source: Human
uz: Inson
