Repository: nizomovasadbek/i10n
Catalog: gnome/43/gnome-terminal.gnome-43.po
Languages: uz

source: Use the command line
uz: Buyruqlar qatoridan foydalaning

source: New Window
uz: Yangi oyna

source: Preferences
uz: Parametrlar

source: GPL-3.0+ or GFDL-1.3-only
uz: GPL-3.0+ yoki faqat GFDL-1.3

source: GNOME Terminal is a terminal emulator application for accessing a UNIX shell environment which can be used to run programs available on your system.
uz: GNOME Terminal - UNIX shellga kirish uchun terminal emulyator ilovasitizimingizda mavjud dasturlarni ishga tushirish uchun ishlatilishi mumkin bo'lgan muhit.

source: It supports several profiles, multiple tabs and implements several keyboard shortcuts.
uz: U bir nechta profillarni, bir nechta yorliqlarni qo'llab-quvvatlaydi va bir nechta klaviaturani klavishlarni amalga oshiradi

source: console
uz: konsol

source: keyboard
uz: klaviatura

source: pointing
uz: ishora

source: HighContrast
uz: Yuqori kontrast

source: ModernToolkit
uz: Zamonaviy asboblar to'plami

source: SearchProvider
uz: Qidiruv provayderi

source: UserDocs
uz: Foydalanuvchi qo'llanmasi

source: Terminal plugin for Files
uz: Fayllar uchun terminal plagini

source: Open a terminal from Files
uz: Fayllardan terminalni oching

source: Open Terminal is a plugin for the Files application that adds a menu item to the context menu to open a terminal in the currently browsed directory.
uz: Open Terminal - bu menyu bandini qo'shadigan Files ilovasi uchun plaginko'rib chiqilayotgan katalogdagi terminalni ochish uchun kontekst menyusi.

# visible-name
source: 'Unnamed'
uz: Nomsiz

source: Human-readable name of the profile
uz: Profilning inson tomonidan o'qiladigan nomi

source: Human-readable name of the profile.
uz: Profilning inson tomonidan o'qiladigan nomi

source: Default color of text in the terminal
uz: Terminaldagi matnning standart rangi

source: Default color of text in the terminal, as a color specification (can be HTML-style hex digits, or a color name such as “red”).
uz: Terminaldagi matnning standart rangi, rang spetsifikatsiyasi sifatida (HTML uslubidagi olti burchakli raqamlaryoki 'qizil kabi rang nomi bo'lishi mumkin

source: Default color of terminal background
uz: Terminal fonining standart rangi

source: Default color of terminal background, as a color specification (can be HTML-style hex digits, or a color name such as “red”).
uz: Terminaldagi matnning standart rangi, rang spetsifikatsiyasi sifatida (HTML uslubidagi olti burchakli raqamlaryoki 'qizil kabi rang nomi bo'lishi mumkin

source: Default color of bold text in the terminal
uz: Terminaldagi qalin matnning standart rangi

source: Default color of bold text in the terminal, as a color specification (can be HTML-style hex digits, or a color name such as “red”). This is ignored if bold-color-same-as-fg is true.
uz: Terminaldagi qalin matnning standart rangi, rang spetsifikatsiyasi sifatida (bo'lishi mumkinHTML uslubidagi olti burchakli raqamlar yoki 'qizil' kabi rang nomi). Bu e'tiborga olinmaydi, agarqalin-rang-fg bilan bir xil.

source: Whether bold text should use the same color as normal text
uz: Qalin matn oddiy matn bilan bir xil rangdan foydalanishi kerakmi?

source: If true, boldface text will be rendered using the same color as normal text.
uz: Agar rost bo'lsa, qalin harfli matn oddiy matn bilan bir xil rangda ko'rsatiladi

source: Scale factor for the cell width to increase letter spacing. (Does not increase the font’s width.)
uz: Qator oralig'ini oshirish uchun katak balandligi uchun masshtab koeffitsienti. (Yo'qshrift balandligini oshiring.)

source: Whether to use custom cursor colors
uz: Maxsus kursor ranglarini ishlatish kerakmi

source: If true, use the cursor colors from the profile.
uz: Agar rost bo'lsa, profildagi kursor ranglarini ishlating.

source: Cursor background color
uz: Kursor fon rangi

source: Custom color of the background of the terminal’s cursor, as a color specification (can be HTML-style hex digits, or a color name such as “red”). This is ignored if cursor-colors-set is false.
uz: Terminal kursorining fonining rang sifatida moslashtirilgan rangispetsifikatsiya (HTML uslubidagi olti burchakli raqamlar yoki 'qizil' kabi rang nomi bo'lishi mumkin).Kursor-ranglar to'plami noto'g'ri bo'lsa, bu e'tiborga olinmaydi.

source: Cursor foreground colour
uz: Kursorning oldingi rangi

source: Custom color for the foreground of the text character at the terminal’s cursor position, as a color specification (can be HTML-style hex digits, or a color name such as “red”). This is ignored if cursor-colors-set is false.
uz: Terminaldagi matn belgisining oldingi qismi uchun moslashtirilgan rangkursor o'rni, rang spetsifikatsiyasi sifatida (HTML uslubidagi olti burchakli raqamlar bo'lishi mumkin yokirang nomi, masalan, 'qizil'). Agar kursor-ranglar to'plami noto'g'ri bo'lsa, bu e'tiborga olinmaydi.

source: Whether to use custom highlight colors
uz: Maxsus ta'kidlash ranglarini ishlatish kerakmi

source: If true, use the highlight colors from the profile.
uz: Agar rost bo'lsa, profildagi yorqin ranglardan foydalaning.

source: Highlight background color
uz: Fon rangini ajratib ko'rsatish

source: Custom color of the background of the terminal’s highlight, as a color specification (can be HTML-style hex digits, or a color name such as “red”). This is ignored if highlight-colors-set is false.
uz: Terminalni ajratib ko'rsatish fonining moslashtirilgan rangi, rang sifatidaspetsifikatsiya (HTML uslubidagi olti burchakli raqamlar yoki 'qizil' kabi rang nomi bo'lishi mumkin).Agar ta'kidlash ranglari to'plami noto'g'ri bo'lsa, bu e'tiborga olinmaydi.

source: Highlight foreground colour
uz: Old fon rangini ajratib ko'rsatish

source: Custom color for the foreground of the text character at the terminal’s highlight position, as a color specification (can be HTML-style hex digits, or a color name such as “red”). This is ignored if highlight-colors-set is false.
uz: Terminaldagi matn belgisining oldingi qismi uchun moslashtirilgan rangrang spetsifikatsiyasi sifatida pozitsiyani ta'kidlang (HTML uslubidagi olti burchakli raqamlar bo'lishi mumkin,yoki rang nomi, masalan, 'qizil'). Agar ta'kidlash ranglari to'plami bo'lsa, bu e'tiborga olinmaydi.

source: Whether to perform bidirectional text rendering
uz: Ikki tomonlama matn ko'rsatishni amalga oshirish kerakmi

source: If true, perform bidirectional text rendering (“BiDi”).
uz: Agar rost boʻlsa, ikki tomonlama matnni koʻrsatish (“BiDi”)

source: Whether to perform Arabic shaping
uz: Arabcha shakllantirishni bajarish kerakmi

source: If true, shape Arabic text.
uz: Agar rost bo'lsa, arabcha matnni shakllantiring

source: Whether to enable SIXEL images
uz: SIXEL tasvirlarni yoqish kerakmi"

source: If true, SIXEL sequences are parsed and images are rendered.
uz: Agar rost boʻlsa, SIXEL ketma-ketliklari tahlil qilinadi va tasvirlar koʻrsatiladi.

source: Whether bold is also bright
uz: Qalin ham yorqin bo'ladimi

source: If true, setting bold on the first 8 colors also switches to their bright variants.
uz: Agar rost bo'lsa, dastlabki 8 ta rangdagi qalin belgi ham yorqin rangga o'tadi

source: Whether to ring the terminal bell
uz: Terminal qo'ng'irog'ini jiringlash kerakmi

source: List of ASCII punctuation characters that are not to be treated as part of a word when doing word-wise selection
uz: ASCII tinish belgilarining bir qismi sifatida ko'rib chiqilmaydigan ro'yxatiso'zni tanlashda so'z

source: Default number of columns
uz: Standart ustunlar soni

source: Number of columns in newly created terminal windows. Has no effect if use_custom_default_size is not enabled.
uz: Yangi yaratilgan terminal oynalaridagi ustunlar soni. Hech qanday ta'siri yo'q use_custom_default_size yoqilmagan.

source: Default number of rows
uz: Birlamchi qatorlar soni

source: Number of rows in newly created terminal windows. Has no effect if use_custom_default_size is not enabled.
uz: Yangi yaratilgan terminal oynalaridagi qatorlar soni. Hech qanday ta'siri yo'q use_custom_default_size yoqilmagan.

source: When to show the scrollbar
uz: O'tkazish paneli qachon ko'rsatilishi kerak

source: Number of lines to keep in scrollback
uz: Orqaga aylantirishda saqlanadigan qatorlar soni

source: Number of scrollback lines to keep around. You can scroll back in the terminal by this number of lines; lines that don’t fit in the scrollback are discarded. If scrollback_unlimited is true, this value is ignored.
uz: Atrofda ushlab turish uchun orqaga o'tish qatorlari soni. Orqaga o'tishingiz mumkin bu qatorlar soni bo'yicha terminal; orqaga aylantirishga mos kelmaydigan satrlaro'chirildi. Agar scrollback_unlimited rost bo'lsa, bu qiymat e'tiborga olinmaydi.

source: Whether an unlimited number of lines should be kept in scrollback
uz: Orqaga aylantirishda cheksiz miqdordagi qatorlar saqlanishi kerakmi

source: If true, scrollback lines will never be discarded. The scrollback history is stored on disk temporarily, so this may cause the system to run out of disk space if there is a lot of output to the terminal.
uz: Agar rost bo'lsa, orqaga o'tish satrlari hech qachon o'chirilmaydi. Orqaga aylantirish tarixi Vaqtinchalik diskda saqlanadi, shuning uchun bu tizimda diskning tugashiga olib kelishi mumkinterminalga juda ko'p chiqish bo'lsa, bo'sh joy.

source: Whether to scroll to the bottom when a key is pressed
uz: Klaviatura bosilganda pastga o'tish kerakmi

source: If true, pressing a key jumps the scrollbar to the bottom.
uz: Agar rost bo'lsa, tugmani bosish aylantirish panelini pastga o'tkazadi.

source: Whether to scroll to the bottom when there’s new output
uz: Yangi chiqish paydo bo'lganda, pastga o'tish kerakmi

source: If true, whenever there’s new output the terminal will scroll to the bottom.
uz: Agar rost bo'lsa, har safar yangi chiqish bo'lsa, terminal pastga siljiydi.

source: What to do with the terminal when the child command exits
uz: Bola buyrug'i chiqqanda terminal bilan nima qilish kerak

source: Possible values are “close” to close the terminal, “restart” to restart the command, and “hold” to keep the terminal open with no command running inside.
uz: Mumkin bo'lgan qiymatlar terminalni yopish uchun "yaqin", qayta ishga tushirish uchun "qayta ishga tushirish"

source: Whether to launch the command in the terminal as a login shell
uz: Buyruqni terminalda shell sifatida ishga tushirish kerakmi

source: If true, the command inside the terminal will be launched as a login shell (argv[0] will have a hyphen in front of it).
uz: Agar rost bo'lsa, terminal ichidagi buyruq shell sifatida ishga tushiriladi(argv[0] oldida tire bo'ladi).

source: Whether to preserve the working directory when opening a new terminal
uz: Yangi terminalni ochishda ishchi jild saqlash kerakmi

source: Controls when opening a new terminal from a previous one carries over the working directory of the opening terminal to the new one.
uz: Oldingi terminaldan yangi terminalni ochishda boshqaruvlarOchilish terminalining yangisiga ish jildi.

source: Whether to run a custom command instead of the shell
uz: Shell o'rniga maxsus buyruqni ishga tushirish kerakmi

source: If true, the value of the custom_command setting will be used in place of running a shell.
uz: Agar rost bo'lsa, custom_command sozlamasining qiymati o'rniga ishlatiladishellni ishga tushirish.

source: Whether to blink the cursor
uz: Kursorni miltillash kerakmi

source: The possible values are “system” to use the global cursor blinking settings, or “on” or “off” to set the mode explicitly.
uz: Mumkin bo'lgan qiymatlar global kursor miltillovchi sozlamalaridan foydalanish uchun 'tizim',

source: The cursor appearance
uz: Kursor ko'rinishi

source: Possible values are “always” or “never” allow blinking text, or only when the terminal is “focused” or “unfocused”.
uz: Mumkin bo'lgan qiymatlar “har doim” yoki “hech qachon” matnning miltillashiga yo'l qo'ymaydi yoki faqat “terminal 'fokuslangan' yoki 'fokuslanmagan'

source: Custom command to use instead of the shell
uz: Shell o'rniga foydalanish uchun maxsus buyruq

source: Run this command in place of the shell, if use_custom_command is true.
uz: Agar use_custom_command to'g'ri bo'lsa, ushbu buyruqni shell o'rniga ishga tushiring.

source: Palette for terminal applications
uz: Terminal ilovalari uchun palitrasi

source: A Pango font name and size
uz: Pango shrifti nomi va hajmi

source: The code sequence the Backspace key generates
uz: Backspace tugmasi yaratadigan kod ketma-ketligi

source: The code sequence the Delete key generates
uz: Delete tugmasi yaratadigan kod ketma-ketligi

source: Whether to use the colors from the theme for the terminal widget
uz: Terminal vidjeti uchun mavzudagi ranglardan foydalanish kerakmi

source: Whether to use the system monospace font
uz: Tizim monospace shriftidan foydalanish kerakmi

source: Whether to rewrap the terminal contents on window resize
uz: Oyna o'lchamini o'zgartirishda terminal tarkibini qayta o'rash kerakmi

source: Which encoding to use
uz: Qaysi kodlashdan foydalanish kerak

source: Whether ambiguous-width characters are narrow or wide when using UTF-8 encoding
uz: UTF-8 dan kodlash foydalanganda noaniq kenglikdagi belgilar tor yokikeng bo'ladimi

source: Keyboard shortcut to open a new tab
uz: Yangi varaqni ochish uchun klaviatura yorlig'i

source: Keyboard shortcut to open a new window
uz: Yangi oyna ochish uchun klaviatura yorlig'i

source: Keyboard shortcut to save the current tab contents to file
uz: Joriy yorliq mazmunini faylga saqlash uchun klaviatura yorlig'i

source: Keyboard shortcut to export the current tab contents to file in various formats
uz: Joriy yorliq tarkibini turli xil faylga eksport qilish uchun klaviatura yorlig'iformatlar

source: Keyboard shortcut to print the current tab contents to printer or file
uz: Joriy yorliq tarkibini printer yoki faylga chop etish uchun klaviatura yorlig'i

source: Keyboard shortcut to close a tab
uz: Yorliqni yopish uchun klaviatura yorlig'i

source: Keyboard shortcut to close a window
uz: Oynani yopish uchun klaviatura yorlig'i

source: Keyboard shortcut to copy text
uz: Matnni nusxalash uchun klaviatura yorlig'i

source: Keyboard shortcut to copy text as HTML
uz: Matnni HTML sifatida nusxalash uchun klaviatura yorlig'i

source: Keyboard shortcut to paste text
uz: Matnni joylashtirish uchun klaviatura yorlig'i

source: Keyboard shortcut to select all text
uz: Barcha matnni tanlash uchun klaviatura yorlig'i

source: Keyboard shortcut to open the Preferences dialog
uz: Afzalliklar dialogini ochish uchun klaviatura yorlig'i

source: Keyboard shortcut to toggle full screen mode
uz: Toʻliq ekran rejimiga oʻtish uchun klaviatura yorligʻi

source: Keyboard shortcut to toggle the visibility of the menubar
uz: Menyu panelining ko'rinishini almashtirish uchun klaviatura yorlig'i

source: Keyboard shortcut to toggle the read-only state
uz: Faqat o'qish holatini almashtirish uchun klaviatura yorlig'i

source: Keyboard shortcut to reset the terminal
uz: Terminalni qayta o'rnatish uchun klaviatura yorlig'i

source: Keyboard shortcut to reset and clear the terminal
uz: Terminalni tiklash va tozalash uchun klaviatura yorlig'i

source: Keyboard shortcut to open the search dialog
uz: Qidiruv oynasini ochish uchun klaviatura yorlig'i

source: Keyboard shortcut to find the next occurrence of the search term
uz: Qidiruv so'zining keyingi takrorlanishini topish uchun klaviatura yorlig'i

source: Keyboard shortcut to find the previous occurrence of the search term
uz: Qidiruv so'zining oldingi joylashuvini topish uchun klaviatura yorlig'i

source: Keyboard shortcut to clear the find highlighting
uz: Topilmani ajratib ko'rsatishni tozalash uchun klaviatura yorlig'i

source: Keyboard shortcut to switch to the previous tab
uz: Oldingi sahifaga o'tish uchun klaviatura yorlig'i

source: Keyboard shortcut to switch to the next tab
uz: Keyingi sahifaga oʻtish uchun klaviatura yorligʻi

source: Keyboard shortcut to move the current tab to the left
uz: Joriy varaqni chapga siljitish uchun klaviatura yorlig'i

source: Keyboard shortcut to move the current tab to the right
uz: Joriy varaqni o'ngga siljitish uchun klaviatura yorlig'i

source: Keyboard shortcut to detach current tab
uz: Joriy varaqni ajratish uchun klaviatura yorlig'i

source: Keyboard shortcut to switch to the last tab
uz: Oxirgi tabga o'tish uchun klaviatura yorlig'i

source: Keyboard shortcut to launch help
uz: Yordamni ishga tushirish uchun klaviatura yorlig'i

source: Keyboard shortcut to make font larger
uz: Shriftni kattalashtirish uchun klaviatura yorlig'i

source: Keyboard shortcut to make font smaller
uz: Shriftni kichikroq qilish uchun klaviatura yorlig'i

source: Keyboard shortcut to make font normal-size
uz: Shriftni normal o'lchamda qilish uchun klaviatura yorlig'i

source: Keyboard shortcut to show the primary menu
uz: Asosiy menyuni ko'rsatish uchun klaviatura yorlig'i

source: Whether the menubar has access keys
uz: Menyu panelida kirish tugmalari mavjudmi

source: Whether to have Alt+letter access keys for the menubar. They may interfere with some applications run inside the terminal so it’s possible to turn them off.
uz: Menyu paneli uchun Alt+harf kirish tugmalari bormi. Ular xalaqit berishi mumkinba'zi ilovalar terminal ichida ishlaydi, shuning uchun ularni aylantirish mumkin

source: Whether shortcuts are enabled
uz: Yorliqlar yoqilganmi yoki yo'qmi

source: Whether shortcuts are enabled. They may interfere with some applications run inside the terminal so it’s possible to turn them off.
uz: Yorliqlar yoqilganmi. Ular ba'zi ilovalarning ishlashiga xalaqit berishi mumkinterminal ichida, shuning uchun ularni o'chirish mumkin.

source: Whether the standard GTK shortcut for menubar access is enabled
uz: Menyu satriga kirish uchun standart GTK yorlig'i yoqilganmi yoki yo'qmi

source: Normally you can access the menubar with F10. This can also be customized via gtkrc (gtk-menu-bar-accel = "whatever"). This option allows the standard menubar accelerator to be disabled.
uz: Odatda siz F10 bilan menyu paneliga kirishingiz mumkin. Buni ham sozlash mumkin gtkrc orqali (gtk-menu-bar-accel = "whatever"). Bu parametr standart menyu acceleratori o'chirilishi kerak.

source: Whether the shell integration is enabled
uz: Shell integratsiyasi yoqilganmi yoki yo'qmi

source: Whether to ask for confirmation before closing a terminal
uz: Terminalni yopishdan oldin tasdiqlashni so'rash kerakmi

source: Additional info section items to appear in the context menu
uz: Qo'shimcha ma'lumotlar bo'limi elementlari kontekst menyusida paydo bo'ladi

source: Whether to show the menubar in new windows
uz: Yangi oynalarda menyu satrini ko'rsatish kerakmi

source: Whether to open new terminals as windows or tabs
uz: Yangi terminallarni oyna yoki yorliq sifatida ochish kerakmi

source: When to show the tabs bar
uz: Yorliqlar paneli qachon ko'rsatilishi kerak

source: The position of the tab bar
uz: Yorliqlar panelining joylashuvi

source: Which theme variant to use
uz: Qaysi mavzu variantidan foydalanish kerak

source: Whether new tabs should open next to the current one or at the last position
uz: Yangi varaqlar joriyning yonida yoki oxirgi holatda ochilishi kerakmi

source: Window
uz: Oyna

source: Last
uz: Oxirgi

source: Next
uz: Keyingisi

# theme variant
source: Default
uz: Standart

# theme variant
source: Light
uz: Yorug'

# theme variant
source: Dark
uz: Qorong'i

source: Narrow
uz: Tor

source: Wide
uz: Keng

source: Block
uz: Bloklash

source: I-Beam
uz: I-nur

source: Underline
uz: tagiga chizish

source: Default
uz: Standart

source: Enabled
uz: Yoqilgan

source: Disabled
uz: O‘chirilgan

source: Never
uz: Hech qachon

source: When focused
uz: Fokuslanganda

source: When unfocused
uz: E'tibor berilmaganda

source: Always
uz: Har doim

source: Replace initial title
uz: Boshlang'ich sarlavhani almashtiring

source: Append initial title
uz: Boshlang'ich sarlavhani qo'shing

source: Prepend initial title
uz: Boshlang'ich sarlavhani qo'shing

source: Keep initial title
uz: Boshlang'ich sarlavhani saqlang

source: Exit the terminal
uz: Terminaldan chiqing

source: Restart the command
uz: Buyruqni qayta ishga tushiring

source: Hold the terminal open
uz: Terminalni ochiq tuting

source: Linux console
uz: Linux konsoli

source: Solarized
uz: Solarizatsiyalangan

source: Custom
uz: Maxsus

source: Automatic
uz: Avtomatik

source: Escape sequence
uz: Escape ketma-ketlik

source: TTY Erase
uz: TTY o'chirish

source: Shell only
uz: Faqat shell

source: _Show menubar by default in new terminals
uz: Yangi terminallarda standart bo'yicha menyu satrini ko'rsatish

source: _Enable mnemonics (such as Alt+F to open the File menu)
uz: _Mnemonikani yoqish (Fayl menyusini ochish uchun Alt+F kabi)

source: Enable the _menu accelerator key (F10 by default)
uz: _menu accelerator tugmachasini yoqing (standart F10)

source: Theme _variant:
uz: Mavzu _variant:

source: Open _new terminals in:
uz: _yangi terminallarni oching:

source: New tab _position:
uz: Yangi varaq _pozitsiyasi:

source: _Enable shortcuts
uz: _Yorliqlarni yoqish

source: Text Appearance
uz: Matn ko'rinishi

source: Initial terminal si_ze:
uz: Boshlang'ich terminal o'lchami:

source: columns
uz: ustunlar

source: rows
uz: qatorlar

source: Rese_t
uz: Qayta o'rnatish

source: Custom _font:
uz: Maxsus _shrift:

source: Choose A Terminal Font
uz: Terminal shriftini tanlang

source: Cell spaci_ng:
uz: Hujayra oralig'i:

source: Allow b_linking text:
uz: b_linking matniga ruxsat berish:

source: Cursor
uz: Kursor

source: Cursor _shape:
uz: Kursor _shakli:

source: Cursor blin_king:
uz: Kursor miltillashi:

source: Sound
uz: Ovoz

source: Terminal _bell
uz: Terminal _qo'ng'iroq

source: Profile ID:
uz: Profil identifikatori ID:

source: Text
uz: Matn

source: Text and Background Color
uz: Matn va fon rangi

source: _Use colors from system theme
uz: _Tizim mavzusidagi ranglardan foydalaning

source: Built-in sche_mes:
uz: O'rnatilgan sxemalar:

source: Background
uz: Fon

source: _Default color:
uz: _Birlamchi rang:

source: Choose Terminal Text Color
uz: Terminal matn rangini tanlang

source: Choose Terminal Background Color
uz: Terminal fon rangini tanlang

source: Bo_ld color:
uz: Bo'yalgan rang:

source: Choose Terminal Bold Text Color
uz: Terminal qalin matn rangini tanlang

source: _Underline color:
uz: _Ustiga chizilgan rang:

source: Choose Terminal Underlined Text Color
uz: Terminal tagiga chizilgan matn rangini tanlang

source: Cu_rsor color:
uz: Kursor rangi:

source: Choose Terminal Cursor Foreground Color
uz: Terminal kursorining oldingi rangini tanlang

source: Choose Terminal Cursor Background Color
uz: Terminal kursorining fon rangini tanlang

source: _Highlight color:
uz: _Rangni ta'kidlash:

source: Choose Terminal Highlight Foreground Color
uz: Terminalni ta'kidlash old fon rangini tanlang

source: Choose Terminal Highlight Background Color
uz: Terminalni ta'kidlash fon rangini tanlang

source: Palette
uz: Palitra

source: Built-in _schemes:
uz: O'rnatilgan sxemalar:

source: Color p_alette:
uz: Ranglar palitrasi:

source: Show _bold text in bright colors
uz: Yorqin ranglarda _qalin matnni ko'rsatish

source: Colors
uz: Ranglar

source: _Show scrollbar
uz: _O'tkazish panelini ko'rsatish

source: Scroll on _output
uz: _output ustiga aylantiring

source: Scroll on _keystroke
uz: _Klaviatura bo'ylab aylantiring

source: _Limit scrollback to:
uz: _Orqaga aylantirishni cheklash:

source: lines
uz: chiziqlar

source: Scrolling
uz: Oʻtkazish

source: _Run command as a login shell
uz: _Run buyrug'i shell sifatida

source: Ru_n a custom command instead of my shell
uz: Mening shell o'rniga maxsus buyruqni ishga tushiring

source: Custom co_mmand:
uz: Maxsus co_mmand:

source: _Preserve working directory:
uz: _Ishchi jildni saqlash:

source: When command _exits:
uz: _Buyruq chiqqanda:

source: Command
uz: Buyruq
