Repository: nizomovasadbek/i10n
Catalog: gnome/43/gnome-robots.master.po
Languages: uz

source: _New Game
uz: _Yangi o'yin

source: _Scores
uz: _Ballar

source: _Preferences
uz: _Afzalliklar

source: _Help
uz: _Yordam

source: _About Robots
uz: _Robots haqida

source: Avoid the robots and make them crash into each other
uz: Robotlardan qoching va ularni bir-biriga urib qo'ying

source: It is the distant future: the year 2000. Evil robots are trying to kill you. Avoid the robots or face certain death.
uz: Bu uzoq kelajak: 2000 yil. Yovuz robotlar sizni o'ldirmoqchi.Robotlardan qoching yoki aniq o'limga duch keling.

source: Fortunately, the robots are extremely stupid and will always move directly towards you. Trick them into colliding into each other, resulting in their destruction, or into the junk piles that result. You can defend yourself by moving the junk piles, or escape to safety with your handy teleportation device.
uz: Yaxshiyamki, robotlar juda ahmoq va har doim to'g'ridan-to'g'ri harakat qilishadisiz tomon. Ularni aldab bir-biriga to'qnashib, natijada Yo'q bo'lib ketish yoki buning natijasida paydo bo'ladigan axlat uyumlari. Siz o'zingizni himoya qilishingiz mumkin keraksiz qoziqlarni ko'chiring yoki o'zingizning qulay teleportatsiyangiz bilan xavfsiz joyga qochingqurilma.

source: Your supply of safe teleports is limited, and once you run out, teleportation could land you right next to a robot, who will kill you. Survive for as long as possible!
uz: Sizning xavfsiz teleportlaringiz cheklangan va siz tugashi bilan,Teleportatsiya sizni robotning yoniga qo'yishi mumkin, u sizni o'ldiradi.Iloji boricha uzoqroq yashang!

source: The GNOME Project
uz: GNOME loyihasi

source: game;arcade;teleport;
uz: o'yin;arkada;teleport;

source: Show toolbar
uz: Asboblar panelini ko‘rsatish

source: Show toolbar. A standard option for toolbars.
uz: Asboblar panelini ko‘rsatish. Asboblar paneli uchun standart variant.

source: Robot image theme
uz: Robot tasvir mavzusi

source: Robot image theme. The theme of the images to use for the robots.
uz: Robot tasvir mavzusi. Robotlar uchun ishlatiladigan tasvirlar mavzusi.

source: Background color
uz: Orqa fon rangi

source: Background color. The hex specification of the background color.
uz: Fon rangi. Fon rangining olti burchakli spetsifikatsiyasi.

source: Game type
uz: O'yin turi

source: Game type. The name of the game variation to use.
uz: O'yin turi. Foydalanish uchun o'yin variantining nomi.

source: Use safe moves
uz: Xavfsiz harakatlardan foydalaning

source: Use safe moves. The safe moves option will help you to avoid being killed due to a mistake. If you try to make a move that would lead to your death when there is a safe move available you will not be allowed to proceed.
uz: Xavfsiz harakatlardan foydalaning. Xavfsiz harakatlar opsiyasi sizni o'ldirmaslikka yordam beradi xato tufayli. Agar siz o'limga olib keladigan harakat qilmoqchi bo'lsangiz Xavfsiz harakat mavjud bo'lganda, sizga davom etishingizga ruxsat berilmaydi.

source: Use super safe moves
uz: Super xavfsiz harakatlardan foydalaning

source: Use super safe moves. The player is alerted when there is no safe move and the only option is to teleport out.
uz: O'ta xavfsiz harakatlardan foydalaning. Xavfsiz harakat bo'lmasa, o'yinchi ogohlantiriladi va Yagona variant - teleportatsiya qilish.

source: Enable game sounds
uz: O'yin tovushlarini yoqing

source: Enable game sounds. Play sounds for various events throughout the game.
uz: O'yin tovushlarini yoqing. O'yin davomida turli hodisalar uchun tovushlarni yoqing

source: Key to move NW
uz: Shimolga ko'chirish tugmasi

source: The key used to move north-west.
uz: Kalit shimoli-g'arbiy tomonga harakat qilish uchun ishlatiladi.

source: Key to move N
uz: N harakatlanish tugmasi

source: The key used to move north.
uz: Kalit shimolga harakat qilish uchun ishlatiladi.

source: Key to move NE
uz: NE harakatlantirish uchun kalit

source: The key used to move north-east.
uz: Kalit shimoliy-sharqqa harakat qilish uchun ishlatiladi.

source: Key to move W
uz: W ni harakatlantirish uchun kalit

source: The key used to move west.
uz: G'arb tomon harakatlanish uchun ishlatiladigan kalit.

source: Key to hold
uz: Tutish uchun kalit

source: The key used to hold still.
uz: Kalit harakatsiz ushlab turish uchun ishlatilgan.

source: Key to move E
uz: E harakatlanish uchun kalit

source: The key used to move east.
uz: Kalit sharqqa harakat qilish uchun ishlatiladi.

source: Key to move SW
uz: SWni siljitish uchun kalit

source: The key used to move south-west.
uz: Kalit janubi-g'arbiy tomon harakatlanish uchun ishlatiladi.

source: Key to move S
uz: S ni harakatlantirish uchun kalit

source: The key used to move south.
uz: Kalit janubga siljish uchun ishlatiladi.

source: Key to move SE
uz: SEni siljitish uchun kalit

source: The key used to move south-east.
uz: Kalit janubi-sharqqa harakatlanish uchun ishlatiladi.

source: Width of the window in pixels
uz: Oynaning kengligi piksellarda

source: Height of the window in pixels
uz: Oynaning piksellardagi balandligi

source: true if the window is maximized
uz: agar oyna kattalashtirilsa true

source: The program Robots was unable to find any valid game configuration files. Please check that the program is installed correctly.
uz: Robots dasturi hech qanday yaroqli o'yin konfiguratsiya faylini topa olmadi.Iltimos, dastur to'g'ri o'rnatilganligini tekshiring.

source: Are you sure you want to discard the current game?
uz: Haqiqatan ham joriy oʻyinni bekor qilmoqchimisiz?

source: Keep _Playing
uz: _O'ynashda davom eting

source: Based on classic BSD Robots
uz: Klassik BSD robotlariga asoslangan

source: Congratulations, You Have Defeated the Robots!! But Can You do it Again?
uz: Tabriklaymiz, siz robotlarni mag'lub etdingiz!! Ammo buni yana qila olasizmi?

source: There are no teleport locations left!!
uz: Teleport joylari qolmadi!!

source: Preferences
uz: Afzalliklar

source: Game Type
uz: O'yin turi

source: _Use safe moves
uz: _Xavfsiz harakatlardan foydalaning

source: Prevent accidental moves that result in getting killed.
uz: O'limga olib keladigan tasodifiy harakatlarni oldini oling.

source: U_se super safe moves
uz: Super xavfsiz harakatlardan foydalaning

source: Prevents all moves that result in getting killed.
uz: O'limga olib keladigan barcha harakatlarni oldini oladi.

source: _Enable sounds
uz: _Ovozlarni yoqish

source: Play sounds for events like winning a level and dying.
uz: Darajani yutish va o'lish kabi hodisalar uchun tovushlarni ijro eting.

source: _Image theme:
uz: _Rasm mavzusi:

source: _Background color:
uz: _Orqa fon rangi:

source: Appearance
uz: Tashqi ko'rinish

source: _Restore Defaults
uz: _Birlamchi sozlamalarni tiklash

source: Keyboard
uz: Klaviatura

source: Classic robots
uz: Klassik robotlar

source: Classic robots with safe moves
uz: Xavfsiz harakatlarga ega klassik robotlar

source: Classic robots with super-safe moves
uz: Juda xavfsiz harakatlarga ega klassik robotlar

source: Nightmare with safe moves
uz: Xavfsiz harakatlar bilan dahshatli tush

source: Nightmare with super-safe moves
uz: Juda xavfsiz harakatlar bilan dahshatli tush

source: Robots2 with safe moves
uz: Xavfsiz harakatlar bilan Robots2

source: Robots2 with super-safe moves
uz: Juda xavfsiz harakatlarga ega Robots2

source: Robots2 easy with safe moves
uz: Robots2 oson

source: Robots2 easy with super-safe moves
uz: Robots2 juda xavfsiz harakatlar bilan oson

source: Robots with safe teleport
uz: Xavfsiz teleportga ega robotlar

source: Robots with safe teleport with safe moves
uz: Xavfsiz harakatga ega xavfsiz teleportli robotlar

source: Teleport _Randomly
uz: _Tasodifiy teleport qilish

source: _Wait for Robots
uz: _Robotlarni kuting

source: Level: %d Score: %d
uz: Daraja: %d Hisob: %d

source: (Remaining: %d)
uz: (Qolgan: %d)

source: Teleport _Safely
uz: _Xavfsiz teleport
