Repository: nizomovasadbek/i10n
Catalog: gnome/43/gnome-online-accounts.gnome-43.po
Languages: uz

source: List of providers that are allowed to be loaded
uz: Yuklashga ruxsat berilgan provayderlar ro'yxati

source: A list of strings representing the providers that are allowed to be loaded (default: 'all'). This is only evaluated on startup.
uz: Yuklashga ruxsat berilgan provayderlarni ifodalovchi qatorlar ro'yxati(standart: 'barchasi'). Bu faqat ishga tushirilganda baholanadi.

source: Failed to find a provider for: %s
uz: Quyidagi uchun provayder topilmadi: %s

source: IsLocked property is set for account
uz: IsLocked xususiyati hisob uchun o'rnatiladi

source: ProviderType property is not set for account
uz: ProviderType xususiyati hisob uchun sozlanmagan

source: Failed to parse autodiscover response XML
uz: XML autodiscover javobini tahlil qilib bo‘lmadi

source: Failed to find “%s” element
uz: “%s” elementi topilmadi

source: Failed to find ASUrl and OABUrl in autodiscover response
uz: Avtomatik aniqlash javobida ASUrl va OABUrl topilmadi

source: Invalid password with username “%s” (%s, %d):
uz: “%s” foydalanuvchi nomi bilan parol noto‘g‘ri (%s, %d):

source: _Password
uz: _Parol

source: _Custom
uz: _Maxsus

source: User_name
uz: Foydalanuvchi_nomi

source: _Cancel
uz: _Bekor qilish

source: C_onnect
uz: Ulanmoq

source: Connecting…
uz: Ulanmoqda…

source: Dialog was dismissed
uz: Dialog yopildi

source: Dialog was dismissed (%s, %d):
uz: Muloqot oynasi yopildi (%s, %d):

source: _Ignore
uz: _E'tibor bermaslik

source: _Try Again
uz: _Qayta urinib ko'ring

source: Error connecting to Microsoft Exchange server
uz: Microsoft Exchange serveriga ulanishda xatolik yuz berdi

source: Ticketing is disabled for account
uz: Hisob uchun chipta o'chirib qo'yilgan

source: Could not find saved credentials for principal “%s” in keyring
uz: Kalit zanjiridagi asosiy “%s” uchun saqlangan hisob maʼlumotlarini topib boʻlmadi

source: Did not find password for principal “%s” in credentials
uz: Hisob maʼlumotlarida asosiy “%s” uchun parol topilmadi

source: Error connecting to Fedora
uz: Fedora-ga ulanishda xatolik yuz berdi

source: Identity service returned invalid key
uz: Identifikatsiya xizmati yaroqsiz kalitni qaytardi

source: Expected status 200 when requesting your identity, instead got status %d (%s)
uz: Shaxsingizni so'rashda kutilgan holat 200, o'rniga %d (%s) maqomi berildi

source: Could not parse response
uz: Javobni tahlil qilib bo‘lmadi

source: Service not available
uz: Xizmat mavjud emas

source: Authentication failed
uz: Autentifikatsiya amalga oshmadi

source: Server does not support PLAIN
uz: Server PLAINni qo‘llab-quvvatlamaydi

source: Server does not support STARTTLS
uz: Server STARTTLSni qo‘llab-quvvatlamaydi

source: IMAP and SMTP
uz: IMAP va SMTP

source: Invalid %s with username “%s” (%s, %d):
uz: “%s” foydalanuvchi nomi bilan yaroqsiz %s (%s, %d):

source: _Encryption
uz: _Shifrlash

source: None
uz: Yo'q

source: STARTTLS after connecting
uz: Ulanishdan keyin STARTTLS

source: SSL on a dedicated port
uz: Maxsus portda SSL

source: _Name
uz: _Nom

source: _Forward
uz: _Oldinga

source: Error connecting to IMAP server
uz: IMAP serveriga ulanishda xatolik yuz berdi

source: Error connecting to SMTP server
uz: SMTP serveriga ulanishda xatolik yuz berdi

source: Name
uz: Nom

source: Enterprise Login (Kerberos)
uz: Korxonaga kirish (Kerberos)

source: _Principal
uz: _Direktor

source: Operation was cancelled
uz: Operatsiya bekor qilindi

source: Log In to Realm
uz: Realmga kiring

source: Please enter your password below.
uz: Quyida parolingizni kiriting.

source: Remember this password
uz: Ushbu parolni eslab qoling

source: Error connecting to enterprise identity server
uz: Korporativ identifikator serveriga ulanishda xatolik yuz berdi

source: Error connecting to Last.fm
uz: Last.fm ga ulanishda xatolik yuz berdi

source: Personal content can be added to your applications through a media server account.
uz: Shaxsiy tarkibni ilovalaringizga media server orqali qo'shish mumkin

source: Available Media Servers
uz: Mavjud media serverlar

source: No media servers found
uz: Hech qanday media server topilmadi

source: Expected status 200 when requesting access token, instead got status %d (%s)
uz: Kirish tokenini soʻrashda kutilgan holat 200, oʻrniga %d (%s) maqomiga ega boʻldi

source: Authorization response:
uz: Avtorizatsiya javobi:

source: Authorization response: %s
uz: Avtorizatsiya javobi: %s

source: Error getting an Access Token:
uz: Kirish tokenini olishda xatolik yuz berdi:

source: Error getting identity:
uz: Shaxsni olishda xatolik yuz berdi:

source: Was asked to log in as %s, but logged in as %s
uz: %s sifatida tizimga kirish so‘ralgan, lekin %s sifatida kirgan

source: Credentials do not contain access_token
uz: Hisob ma'lumotlarida access_token mavjud emas

source: Failed to refresh access token (%s, %d):
uz: Kirish tokenini yangilab boʻlmadi (%s, %d):

source: Error connecting to Nextcloud server
uz: Nextcloud serveriga ulanishda xatolik yuz berdi

source: _Mail
uz: _Pochta

source: Cale_ndar
uz: Kalendar

source: _Contacts
uz: _Kontaktlar

source: _Documents
uz: _Hujjatlar

source: M_usic
uz: Musiqa

source: _Photos
uz: _Rasmlar

source: _Files
uz: _Fayllar

source: _Read Later
uz: _Keyinroq o'qing

source: Prin_ters
uz: Printerlar

source: _Maps
uz: _Xaritalar

source: T_o Do
uz: Qilish

source: Use for
uz: uchun foydalaning

source: Account is disabled
uz: Hisob o'chirilgan

source: Unknown error
uz: Noma'lum xato

source: ensure_credentials_sync is not implemented on type %s
uz: %s turida hisob maʼlumotlarini sinxronlash amalga oshirilmaganiga ishonch hosil qiling

source: TLS not available
uz: TLS mavjud emas

source: Unknown authentication mechanism
uz: Noma'lum autentifikatsiya mexanizmi

source: Error logging into the account
uz: Hisobga kirishda xatolik yuz berdi

source: Credentials have expired
uz: Hisob maʼlumotlari muddati tugagan

source: Sign in to enable this account.
uz: Ushbu hisobni yoqish uchun tizimga kiring.

source: _Sign In
uz: _Tizimga kirish

source: A %s account already exists for %s
uz: %s uchun %s hisobi allaqachon mavjud

source: %s Account
uz: %s hisobi

source: Failed to delete credentials from the keyring
uz: Kalit so'zidan ishonch yorliqlarini olib tashlab bo'lmadi

source: Failed to retrieve credentials from the keyring
uz: Hisobga olish ma'lumotlari kalit so'zidan olinmadi

source: No credentials found in the keyring
uz: Kalitda hech qanday hisob ma'lumotlari topilmadi

source: Error parsing result obtained from the keyring:
uz: Keyringdan olingan tahlil natijasi:

source: GOA %s credentials for identity %s
uz: %s identifikatori uchun GOA %s hisob maʼlumotlari

source: Failed to store credentials in the keyring
uz: Hisob maʼlumotlarini kalit halqasida saqlab boʻlmadi

source: Cannot find WebDAV endpoint
uz: WebDAV oxirgi nuqtasi topilmadi

source: Code: %u — Unexpected response from server
uz: Kod: %u — Serverdan kutilmagan javob

source: The signing certificate authority is not known.
uz: Imzolovchi sertifikat organi noma'lum.

source: The certificate does not match the expected identity of the site that it was retrieved from.
uz: Sertifikat saytning kutilgan identifikatoriga mos kelmaydidan olingan.

source: The certificate’s activation time is still in the future.
uz: Sertifikatni faollashtirish muddati hali oldinda.

source: The certificate has expired.
uz: Sertifikat muddati tugagan.

source: The certificate has been revoked.
uz: Sertifikat bekor qilindi.

source: The certificate’s algorithm is considered insecure.
uz: Sertifikat algoritmi xavfli deb hisoblanadi.

source: Invalid certificate.
uz: Yaroqsiz sertifikat.

source: Did not find %s with identity “%s” in credentials
uz: Hisob maʼlumotlarida “%s” identifikatorli %s topilmadi

source: Loading “%s”…
uz: “%s” yuklanmoqda…

source: Initial secret key is invalid
uz: Dastlabki maxfiy kalit yaroqsiz

source: Couldn't get GoaObject for object path %s
uz: %s obyekt yo‘li uchun GoaObject ni olib bo‘lmadi

source: The network realm %s needs some information to sign you in.
uz: %s tarmoq hududiga kirish uchun baʼzi maʼlumotlar kerak.

source: Could not find identity in credential cache:
uz: Hisob maʼlumotlari keshida identifikator topilmadi:

source: Could not find identity credentials in cache:
uz: Keshda identifikatsiya ma'lumotlarini topib bo'lmadi:

source: Could not sift through identity credentials in cache:
uz: Keshdagi identifikatsiya maʼlumotlarini saralab boʻlmadi:

source: Could not finish up sifting through identity credentials in cache:
uz: Keshdagi identifikatsiya maʼlumotlarini saralashni tugatib boʻlmadi:

source: No associated identification found
uz: Hech qanday aloqador identifikatsiya topilmadi

source: Could not create credential cache:
uz: Hisob maʼlumotlari keshini yaratib boʻlmadi:

source: Could not initialize credentials cache:
uz: Hisob maʼlumotlari keshini ishga tushirib boʻlmadi:

source: Could not store new credentials in credentials cache:
uz: Hisob maʼlumotlari keshida yangi hisob maʼlumotlarini saqlab boʻlmadi:

source: Could not renew identity: Not signed in
uz: Shaxsni yangilab bo‘lmadi: tizimga kirilmagan

source: Could not renew identity:
uz: Shaxsni yangilab bo‘lmadi:

source: Could not get new credentials to renew identity %s:
uz: %s identifikatorini yangilash uchun yangi hisob maʼlumotlarini olib boʻlmadi:

source: Could not erase identity:
uz: Shaxsni oʻchirib boʻlmadi:

source: Could not find identity
uz: Shaxs topilmadi

source: Could not create credential cache for identity
uz: Identifikatsiya uchun hisob maʼlumotlari keshini yaratib boʻlmadi
