Repository: nizomovasadbek/i10n
Catalog: gnome/43/gnome-shell-extensions.main.po
Languages: uz

source: This session logs you into GNOME Classic
uz: Ushbu seans sizni GNOME Classic tizimiga kiritadi

source: GNOME Classic on Wayland
uz: Waylanddagi GNOME Classic

source: GNOME Classic on Xorg
uz: Xorg-da GNOME Classic

source: Favorites
uz: Sevimlilar

source: Applications
uz: Ilovalar

source: Application and workspace list
uz: Ilova va ish joylari ro'yxati

source: A list of strings, each containing an application id (desktop file name), followed by a colon and the workspace number
uz: Har birida dastur identifikatori (ish stoli fayl nomi) bo'lgan satrlar ro'yxatikeyin ikki nuqta va ish maydoni raqami

source: Workspace Rules
uz: Ish maydoni qoidalari

source: Add Rule
uz: Qoida qo'shish

source: Ejecting drive “%s” failed:
uz: “%s” diskini chiqarib bo‘lmadi:

source: Removable devices
uz: Olinadigan qurilmalar

source: Open Files
uz: Fayllarni oching

source: Use more screen for windows
uz: Oynalar uchun ko'proq ekrandan foydalaning

source: Try to use more screen for placing window thumbnails by adapting to screen aspect ratio, and consolidating them further to reduce the bounding box. This setting applies only with the natural placement strategy.
uz: Ekranga moslashish orqali oyna eskizlarini joylashtirish uchun ko'proq ekrandan foydalanishga harakat qilingaspekt nisbati va chegaraviy qutini kamaytirish uchun ularni yanada mustahkamlash.Ushbu sozlama faqat tabiiy joylashtirish strategiyasi uchun amal qiladi.

source: Place window captions on top
uz: Oyna sarlavhalarini tepaga joylashtiring

source: If true, place window captions on top the respective thumbnail, overriding shell default of placing it at the bottom. Changing this setting requires restarting the shell to have any effect.
uz: Agar rost bo'lsa, oyna taglavhalarini tegishli eskiz ustiga qo'ying, bekor qilingshellning standart bo'yicha uni pastki qismga joylashtirish. Bu sozlamani o'zgartirish uchun Har qanday ta'sir qilish uchun shellni qayta ishga tushirish.

source: Places
uz: Joylar

source: Failed to launch “%s”
uz: “%s”ni ishga tushirib bo‘lmadi

source: Failed to mount volume for “%s”
uz: “%s” uchun ovoz balandligini o‘rnatib bo‘lmadi

source: Computer
uz: Kompyuter

source: Home
uz: Uy

source: Browse Network
uz: Tarmoqni ko'rib chiqish

source: Cycle Screenshot Sizes
uz: Cycle skrinshoti oʻlchamlari

source: Cycle Screenshot Sizes Backward
uz: Skrinshot o'lchamlarini orqaga qarab aylantirish

source: Theme name
uz: Mavzu nomi

source: The name of the theme, to be loaded from ~/.themes/name/gnome-shell
uz: ~/.themes/name/gnome-shell dan yuklanadigan mavzu nomi

source: Close
uz: Yopish

source: Unminimize
uz: Kamaytirish

source: Minimize
uz: Minimallashtirish

source: Unmaximize
uz: Ko'paytirish

source: Maximize
uz: Maksimallashtirish

source: Minimize all
uz: Hammasini minimallashtiring

source: Unminimize all
uz: Hammasini kamaytirish

source: Maximize all
uz: Hammasini maksimallashtirish

source: Unmaximize all
uz: Hammasini ko'paytirish

source: Close all
uz: Hammasini yoping

source: Window List
uz: Oyna ro'yxati

source: When to group windows
uz: Oynalarni qachon guruhlash kerak

source: Decides when to group windows from the same application on the window list. Possible values are “never”, “auto” and “always”.
uz: Oynalar ro'yxatida bir xil dasturdagi oynalarni qachon guruhlash kerakligini hal qiladi.Mumkin bo'lgan qiymatlar ”hech qachon”, ”avtomatik” va ”har doim”.

source: Show windows from all workspaces
uz: Barcha ish joylaridan oynalarni ko'rsatish

source: Whether to show windows from all workspaces or only the current one.
uz: Oynalarni barcha ish joylaridan yoki faqat joriyidan ko'rsatish kerak.

source: Show the window list on all monitors
uz: Barcha monitorlarda oynalar ro'yxatini ko'rsatish

source: Whether to show the window list on all connected monitors or only on the primary one.
uz: Oyna ro'yxati barcha ulangan monitorlarda yoki faqat

source: Window Grouping
uz: Oynalarni guruhlash

source: Never group windows
uz: Hech qachon oynalarni guruhlamang

source: Group windows when space is limited
uz: Oynalarni guruhlash uchun joy cheklangan

source: Always group windows
uz: Har doim oynalarni guruhlash

source: Show on all monitors
uz: Barcha monitorlarda ko'rsatish

source: Workspace Indicator
uz: Ish maydoni ko'rsatkichi

source: Workspace %d
uz: Ish maydoni %d

source: Workspace Names
uz: Ish joyi nomlari

source: Add Workspace
uz: Ish maydoni qo'shish
