Repository: nizomovasadbek/i10n
Catalog: gnome/43/grilo-plugins.master.po
Languages: uz

source: Bookmarks
uz: Bookmarklar

source: A source for organizing media bookmarks
uz: Media Bookmarklarini tashkil qilish uchun manba

source: Failed to get bookmark metadata
uz: Bookmark metama’lumotlarini olinmadi

source: Failed to find bookmarks: %s
uz: Bookmarklarni topib bo‘lmadi: %s

source: Failed to remove: %s
uz: O‘chirib tashlab bo‘lmadi: %s

source: Failed to store: %s
uz: Saqlab bo‘lmadi: %s

source: No database connection
uz: Maʼlumotlar bazasiga ulanish yoʻq

source: A plugin to get metadata using gstreamer framework
uz: Gstreamer Framework yordamida metadata olish uchun plagin

source: A source for browsing the DLNA server “%s”
uz: “%s” DLNA serverini koʻrish uchun manba

source: Upload failed, target source destroyed
uz: Yuklash amalga oshmadi, maqsadli manba yo‘q qilindi

source: Upload failed, “%s”, transferred %lu of %lu bytes
uz: Yuklash amalga oshmadi, “%s”, %lu baytdan %lu uzatildi

source: Failed to retrieve item properties (BrowseObjects error %d: %s)
uz: Element xususiyatlarini olib bo‘lmadi (BrowseObjects xatosi %d: %s)

source: Upload failed, URL missing on the media object to be transferred
uz: Yuklab bo‘lmadi, o‘tkaziladigan media obyektida URL manzili yo‘q

source: A source for browsing the DAAP server “%s”
uz: “%s” DAAP serverini koʻrish uchun manba

source: Albums
uz: Albomlar

source: Artists
uz: Rassomlar

source: Invalid container identifier %s
uz: Konteyner identifikatori noto‘g‘ri %s

source: A source for browsing the DPAP server “%s”
uz: “%s” DPAP serverini koʻrish uchun manba

source: Photos
uz: Rasmlar

source: Filesystem
uz: Fayl tizimi

source: A source for browsing the filesystem
uz: Fayl tizimini ko'rib chiqish uchun manba

source: File %s does not exist
uz: %s fayli mavjud emas

source: Cannot get media from %s
uz: %s dan media olinmadi

source: A source for browsing and searching Flickr photos
uz: Flickr fotosuratlarini ko'rish va qidirish uchun manba

source: A source for browsing and searching %s’s flickr photos
uz: %s ning flickr fotosuratlarini ko‘rish va qidirish uchun manba

source: A source for browsing Freebox TV channels
uz: Freebox telekanallarini ko'rish uchun manba

source: A source for browsing Freebox radio channels
uz: Freebox radio kanallarini ko'rib chiqish uchun manba

source: Avatar provider from Gravatar
uz: Gravatardan avatar provayderi

source: A plugin to get avatars for artist and author fields
uz: Rassom va muallif maydonlari uchun avatarlarni olish uchun plagin

source: Local Metadata Provider
uz: Mahalliy metadata provayderi

source: A source providing locally available metadata
uz: Mahalliy metamaʼlumotlarni taqdim etuvchi manba

source: Failed to resolve: %s
uz: Yechilmadi: %s

source: Cannot resolve any of the given keys
uz: Berilgan kalitlarning hech birini ishlatib bo'lmaydi

source: A GIO supported URL for images is required
uz: Rasmlar uchun GIO tomonidan qoʻllab-quvvatlanadigan URL manzili talab qilinadi

source: Genres
uz: Janrlar

source: A source for browsing music
uz: Musiqalarni ko'rish uchun manba

source: Failed to get database from magnatune: %s
uz: Magnatunedan maʼlumotlar bazasini olib boʻlmadi: %s

source: Failed to save database from magnatune: “%s”
uz: Ma'lumotlar bazasini magnatunedan saqlab bo'lmadi: “%s”

source: Failed to get table from magnatune db: %s
uz: Magnatune db dan jadvalni olib bo‘lmadi: %s

source: Fail before returning media to user: %s
uz: Mediani foydalanuvchiga qaytarishdan oldin bajarilmadi: %s

source: Metadata Store
uz: Metadata do'koni

source: A plugin for storing extra metadata information
uz: Qo'shimcha metadata ma'lumotlarini saqlash uchun plagin

source: Failed to update metadata: %s
uz: Metamaʼlumotlarni yangilab boʻlmadi: %s

source: specified keys are not writable
uz: belgilangan kalitlarni yozish mumkin emas

source: Failed to update metadata
uz: Metamaʼlumotlarni yangilab boʻlmadi

source: “source-id” not available
uz: “manba identifikatori” mavjud emas

source: Failed to resolve
uz: Yechilmadi

source: Failed to search: %s
uz: Qidirib bo‘lmadi: %s

source: OpenSubtitles Provider
uz: OpenSubtitles provayderi

source: A source providing a list of subtitles for a video
uz: Video uchun subtitrlar roʻyxatini taqdim etuvchi manba

source: Optical Media
uz: Optik media

source: A source for browsing optical media
uz: Optik medialarni ko'rish uchun manba

source: A source for browsing podcasts
uz: Podkastlarni ko'rish uchun manba

source: Failed to get podcast streams: %s
uz: Podkast streamlarini olib bo‘lmadi: %s

source: Failed to parse content
uz: Kontentni tahlil qilib bo‘lmadi

source: Failed to parse podcast contents
uz: Podkast tarkibini tahlil qilib bo‘lmadi

source: Empty response
uz: Bo'sh javob

source: Failed to get podcast information
uz: Podkast ma’lumotlarini olib bo‘lmadi

source: Failed to get podcasts list: %s
uz: Podkastlar roʻyxatini olib boʻlmadi: %s

source: Failed to get podcast stream metadata
uz: Podkast strim metama’lumotlarini olib bo‘lmadi

source: Failed to get podcast metadata
uz: Podkast metamaʼlumotlarini olinmadi

source: URL required
uz: URL talab qilinadi

source: Most Popular
uz: Eng mashhur

source: Recent
uz: Yaqinda

source: A source for browsing and searching Rai.tv videos
uz: Rai.tv videolarini ko'rish va qidirish uchun manba

source: Black and White
uz: Qora va oq

source: Cinema
uz: Kino

source: Comedians
uz: Komediyachilar

source: Chronicle
uz: Xronika

source: Culture
uz: Madaniyat

source: Economy
uz: Iqtisodiyot

source: Fiction
uz: Badiiy adabiyot

source: Junior
uz: Kichik

source: Interviews
uz: Intervyular

source: Music
uz: Musiqa

source: News
uz: Yangiliklar

source: Health
uz: Salomatlik

source: Satire
uz: Kinoya

source: Society
uz: Jamiyat

source: Show
uz: Ko'rsatish

source: History
uz: Tarix

source: Politics
uz: Siyosat

source: Leisure
uz: Dam olish

source: Travel
uz: Sayohat

source: Failed to browse: %s
uz: Ko‘rib chiqilmadi: %s

source: A source for browsing SHOUTcast radios
uz: SHOUTcast radiolarini ko'rish uchun manba

source: Failed to parse response
uz: Javobni tahlil qilib bo‘lmadi

source: Cannot find media %s
uz: %s media topilmadi

source: Failed to connect: %s
uz: Ulanib bo‘lmadi: %s

source: non-NULL search text is required
uz: NULL bo'lmagan qidiruv matni talab qilinadi

source: A source for fetching metadata of television shows
uz: Televizor ko'rsatuvlarning metama'lumotlarini olish uchun manba

source: Remote data does not contain valid identifier
uz: Masofaviy maʼlumotlarda yaroqli identifikator mavjud emas

source: Failed to query: %s
uz: So‘rov amalga oshmadi: %s

source: Failed to get media from uri: %s
uz: URI-dan media olinmadi: %s

source: Empty query
uz: Bo'sh so'rov

source: ID “%s” is not known in this source
uz: Bu manbada “%s” IDsi nomaʼlum

source: A plugin for searching multimedia content using Tracker3
uz: Tracker3 yordamida multimedia kontentini qidirish uchun plagin

source: A plugin for searching multimedia content using Tracker
uz: Tracker yordamida multimedia kontentini qidirish uchun plagin

source: Standard feeds
uz: Standart tasma

source: Categories
uz: Kategoriyalar

source: Top Rated
uz: Eng yuqori baholangan

source: A source for browsing and searching YouTube videos
uz: YouTube videolarini ko'rish va qidirish uchun manba

source: Failed to get feed
uz: Tasmani olib bo‘lmadi

source: Invalid feed identifier %s
uz: Yaroqsiz tasma identifikatori %s

source: Invalid category identifier %s
uz: Kategoriya identifikatori yaroqsiz %s
