Repository: nizomovasadbek/i10n
Catalog: gnome/43/grilo.master.po
Languages: uz

source: No mock definition found
uz: Hech qanday soxta ta'rif topilmadi

source: Could not find mock content %s
uz: %s soxta kontent topilmadi

source: Could not access mock content: %s
uz: Soxta tarkibga kira olmadi: %s

source: Cannot connect to the server
uz: Serverga ulanib bo'lmadi

source: Cannot connect to the proxy server
uz: Proksi-serverga ulanib bo'lmadi

source: Invalid request URI or header: %s
uz: Noto‘g‘ri so‘rov URI yoki sarlavha: %s

source: Authentication required: %s
uz: Autentifikatsiya talab qilinadi: %s

source: The requested resource was not found: %s
uz: Soʻralgan manba topilmadi: %s

source: The entry has been modified since it was downloaded: %s
uz: Yozuv yuklab olinganidan beri oʻzgartirildi: %s

source: Operation was cancelled
uz: Operatsiya bekor qilindi

source: Data not available
uz: Maʼlumotlar mavjud emas

source: Invalid URL %s
uz: Yaroqsiz URL %s

source: Semicolon-separated paths containing Grilo plugins
uz: Grilo plaginlarini o'z ichiga olgan nuqta-vergul bilan ajratilgan yo'llar

source: Colon-separated paths containing Grilo plugins
uz: Grilo plaginlarini o'z ichiga olgan ikki nuqta bilan ajratilgan yo'llar

source: Colon-separated list of Grilo plugins to use
uz: Foydalanish uchun Grilo plaginlarining ikki nuqta bilan ajratilgan roʻyxati

source: Grilo Options
uz: Grilo imkoniyatlari

source: Show Grilo Options
uz: Grilo parametrlarini ko'rsatish

source: No searchable sources available
uz: Qidiriladigan manbalar mavjud emas

source: Could not resolve media for URI “%s”
uz: “%s” URI uchun mediani hal qilib bo‘lmadi

source: Plugin “%s” is already loaded
uz: “%s” plagini allaqachon yuklangan

source: Failed to initialize plugin from %s
uz: %s plaginini ishga tushirib bo‘lmadi

source: Metadata key “%s” already registered in different format
uz: “%s” metamaʼlumotlar kaliti allaqachon boshqa formatda roʻyxatdan oʻtgan

source: Metadata key “%s” cannot be registered
uz: “%s” metamaʼlumotlar kalitini roʻyxatdan oʻtkazib boʻlmaydi

source: Source with id “%s” was not found
uz: “%s” identifikatorli manba topilmadi

source: Failed to load plugin from %s
uz: %s plaginini yuklab bo‘lmadi

source: Invalid plugin file %s
uz: Yaroqsiz plagin fayli %s

source: “%s” is not a valid plugin file
uz: “%s” yaroqli plagin fayli emas

source: Plugin “%s” already exists
uz: “%s” plagini allaqachon mavjud

source: Invalid path %s
uz: Yaroqsiz yo‘l %s

source: All configured plugin paths are invalid
uz: Barcha sozlangan plagin yoʻllari yaroqsiz

source: Plugin “%s” not available
uz: “%s” plagini mavjud emas

source: Plugin not found: “%s”
uz: Plagin topilmadi: “%s”

source: Plugin configuration does not contain “plugin-id” reference
uz: Plagin konfiguratsiyasida “plugin-id” havolasi mavjud emas

source: Some keys could not be written
uz: Ba'zi kalitlarni yozib bo'lmadi

source: None of the specified keys are writable
uz: Belgilangan kalitlarning hech biri yozilmaydi

source: Media has no “id”, cannot remove
uz: Mediada “id” yo'q, uni olib tashlab bo'lmaydi
