Repository: nizomovasadbek/i10n
Catalog: gnome/43/gsettings-desktop-schemas.master.po
Languages: uz

source: On-screen keyboard
uz: Ekrandagi klaviatura

source: Whether the on-screen keyboard is turned on.
uz: Ekrandagi klaviatura yoqilganmi yoki yo'qmi.

source: Screen magnifier
uz: Ekran kattalashtiruvchi

source: Whether the screen magnifier is turned on.
uz: Ekran lupasi yoqilganmi yoki yo'qmi.

source: Screen reader
uz: Ekran o'quvchi

source: Whether the screen reader is turned on.
uz: Ekranni o'qish moslamasi yoqilganmi yoki yo'qmi.

source: Always show the Universal Access status icon
uz: Har doim Universal Access holati belgisini ko'rsating

source: This key overrides the automatic hiding of the Universal Access status icon when no accessibility features are enabled.
uz: Ushbu kalit universal kirish holati belgisini avtomatik yashirishni bekor qiladihech qanday maxsus imkoniyatlar yoqilmaganda.

source: Always show the text caret
uz: Har doim matn karetini ko'rsating

source: This key overrides the hiding of the text caret in noneditable text in applications.
uz: Ushbu kalit matn karetini tahrir qilib bo'lmaydigan matnda yashirishni bekor qiladi

source: Whether to use the high contrast style.
uz: Yuqori kontrastli uslubdan foydalanish kerakmi.

source: Enable accessibility keyboard shortcuts
uz: Maxsus imkoniyatlar klaviatura yorliqlarini yoqing

source: Beep when a keyboard accessibility feature changes
uz: Klaviaturadan foydalanish imkoniyati oʻzgarganda signal

source: Whether to beep when a keyboard accessibility feature is enabled or disabled.
uz: Klaviaturadan foydalanish imkoniyati yoqilgan yoki o'chirilgan bo'lsa, signal eshitiladimi.

source: Disable keyboard accessibility after a timeout
uz: Vaqt tugashi bilan klaviaturadan foydalanish imkoniyatini o'chirib qo'ying

source: Whether to disable keyboard accessibility after a timeout, useful for shared machines.
uz: Klaviaturadan foydalanishni vaqtinchalik vaqtdan keyin o'chirib qo'yish kerakmi, umumiy foydalanish uchun foydali

source: Duration of the disabling timeout
uz: O'chirish vaqtining davomiyligi

source: Duration of the timeout before disabling the keyboard accessibility.
uz: Klaviaturadan foydalanish imkoniyatini o'chirib qo'yishdan oldin kutish vaqti.

source: Enable “Bounce Keys”
uz: “Bounce Keys”ni yoqish

source: Whether the “Bounce Keys” keyboard accessibility feature is turned on.
uz: “Bounce Keys” klaviaturadan foydalanish imkoniyati yoqilganmi yoki yo‘qmi.

source: Minimum interval in milliseconds
uz: Minimal interval millisekundlarda

source: Ignore multiple presses of the same key within this many milliseconds.
uz: Shu millisekundlarda bir xil tugmani bir necha marta bosishga e'tiborsiz qoldiring

source: Beep when a key is rejected
uz: Kalit rad etilganda signal eshitiladi

source: Whether to beep when a key is rejected.
uz: Kalit rad etilganda signal berish kerakmi.

source: Enable “Mouse Keys”
uz: ”Sichqoncha tugmachalari” ni yoqing

source: Whether the “Mouse Keys” accessibility feature is turned on.
uz: ”Sichqoncha tugmachalari” maxsus imkoniyatlari yoqilganmi yoki yo'qmi.

source: Pixels per seconds
uz: Soniyadagi piksellar

source: How many pixels per second to move at the maximum speed.
uz: Maksimal tezlikda harakat qilish uchun soniyada qancha piksel.

source: How long to accelerate in milliseconds
uz: Millisekundlarda qancha vaqt tezlashtirish kerak

source: How many milliseconds it takes to go from 0 to maximum speed.
uz: 0 dan maksimal tezlikka o'tish uchun qancha millisekund kerak bo'ladi.

source: Initial delay in milliseconds
uz: Millisekundlarda dastlabki kechikish

source: How many milliseconds to wait before mouse movement keys start to operate.
uz: Sichqoncha harakat tugmalari ishlay boshlaguncha qancha millisekund kutish kerak.

source: Enable “Slow Keys”
uz: “Sekin tugmalar”ni yoqish

source: Whether the “Slow Keys” accessibility feature is turned on.
uz: “Sekin tugmalar” maxsus imkoniyatlar funksiyasi yoqilganmi yoki yo‘qmi.

source: Do not accept a key as being pressed unless held for this many milliseconds.
uz: Ko'p millisekund ushlab turmaguncha, tugmachani bosilgan deb qabul qilmang.

source: Beep when a key is first pressed
uz: Tugma birinchi marta bosilganda signal eshitiladi

source: Whether to beep when a key is first pressed.
uz: Tugma birinchi marta bosilganda signal eshitiladimi.

source: Beep when a key is accepted
uz: Kalit qabul qilinganda signal eshitiladi

source: Whether to beep when a key is accepted.
uz: Kalit qabul qilinganda signal eshitiladimi.

source: Enable sticky keys
uz: Sticky tugmachalarni yoqing

source: Whether the sticky keys accessibility feature is turned on.
uz: Sticky kalitlarga kirish imkoniyati yoqilganmi yoki yo'qmi.

source: Disable when two keys are pressed at the same time
uz: Ikki tugma bir vaqtning o'zida bosilganda o'chiring

source: Whether to disable sticky keys if two keys are pressed at the same time.
uz: Agar ikkita tugma bir vaqtning o'zida bosilsa, sticky tugmachalarni o'chirib qo'yish kerakmi.

source: Beep when a modifier is pressed.
uz: Modifikator bosilganda signal eshitiladi.

source: Whether to beep when a modifier key is pressed.
uz: Modifikator tugmasi bosilganda signal eshitiladimi.

source: Enable “Toggle Keys”
uz: ”Klavishlarni almashtirish” ni yoqing

source: Whether the “Toggle Keys” accessibility feature is turned on.
uz: “Klaviaturalarni almashtirish” maxsus imkoniyatlar xususiyati yoqilganmi yoki yo‘qmi.

source: Mouse Tracking Mode
uz: Sichqonchani kuzatish rejimi

source: Determines the position of the magnified mouse image within the magnified view and how it reacts to system mouse movement. The values are • none: no mouse tracking; • centered: the mouse image is displayed at the center of the zoom region (which also represents the point under the system mouse) and the magnified contents are scrolled as the system mouse moves; • proportional: the position of the magnified mouse in the zoom region is proportionally the same as the position of the system mouse on screen; • push: when the magnified mouse intersects a boundary of the zoom region, the contents are scrolled into view.
uz: Kattalashtirilgan sichqoncha tasvirining kattalashtirilgan ichidagi o'rnini aniqlaydiko'rish va tizim sichqoncha harakatiga qanday munosabatda bo'lishini ko'ring. Qiymatlar • hech: yo'q sichqonchani kuzatish; • markazlashtirilgan: sichqoncha tasviri markazida ko'rsatiladi.kattalashtirish mintaqasi (bu tizim sichqonchasi ostidagi nuqtani ham ifodalaydi) vakattalashtirilgan tarkib tizim sichqonchasi harakatlanayotganda aylantiriladi; • proportsional: kattalashtirilgan sichqonchaning masshtabdagi joylashuvitizim sichqonchasining ekrandagi holati bilan mutanosib ravishda bir xil; • surish: kattalashtirilgan sichqoncha kattalashtirish hududi chegarasini kesib o'tganda, tarkiblar ko'rinishga aylantiriladi.

source: Focus Tracking Mode
uz: Fokusni kuzatish rejimi

source: Determines the position of the focused widget within magnified view. The values are: • none: no focus tracking • centered: the focused image is displayed at the center of the zoom region (which also represents the point under the system focus) and the magnified contents are scrolled as the system focus moves • proportional: the position of the magnified focus in the zoom region is proportionally the same as the position of the system focus on screen • push: when the magnified focus intersects a boundary of the zoom region, the contents are scrolled into view
uz: Kattalashtirilgan ko'rinishdagi fokuslangan vidjetning o'rnini aniqlaydi. qiymatlar: • hech biri: fokus kuzatilmaydi • markazlashtirilgan: fokuslangan tasvir kattalashtirish mintaqasining markazida ko'rsatiladi (bu nuqtani ham ifodalayditizim fokusi ostida) va kattalashtirilgan tarkib sifatida aylantiriladi.tizim fokusi proportsional harakat qiladi: kattalashtirilgan fokusning joylashuvi kattalashtirish mintaqasi tizimning pozitsiyasi bilan mutanosib ravishda bir xilekranda fokus • surish: kattalashtirilgan fokus chegarani kesib o'tganda kattalashtirish hududi, kontent ko'rinishga aylantiriladi

source: Caret Tracking Mode
uz: Karetni kuzatish rejimi

source: Determines the position of the caret within magnified view. The values are: • none: no caret tracking • centered: the image of the caret is displayed at the center of the zoom region (which also represents the point under the system caret) and the magnified contents are scrolled as the system caret moves • proportional: the position of the magnified caret in the zoom region is proportionally the same as the position of the system caret on screen • push: when the magnified caret intersects a boundary of the zoom region, the contents are scrolled into view
uz: Karetning kattalashtirilgan ko'rinishdagi o'rnini aniqlaydi. Qiymatlar: • hech: karet kuzatilmaydi • markazlashtirilgan: karetaning tasviri da ko'rsatiladikattalashtirish mintaqasining markazi (bu ostidagi nuqtani ham ifodalayditizim kareti) va kattalashtirilgan tarkiblar tizim karetasi sifatida aylantiriladi.harakat qiladi • proportsional: kattalashtirilgan karetaning masshtab mintaqasidagi o'rnitizim karetasi ekrandagi joylashuvi bilan mutanosib ravishda bir xil bo'ladi • surish: kattalashtirilgan karetka kattalashtirish hududi chegarasini kesib o'tganda, tarkib ko'rinishga aylantiriladi

source: Screen position
uz: Ekran holati

source: The magnified view either fills the entire screen, or occupies the top-half, bottom-half, left-half, or right-half of the screen.
uz: Kattalashtirilgan ko'rinish butun ekranni to'ldiradi yoki yuqori yarmini egallaydi

source: Magnification factor
uz: Kattalashtirish faktori

source: The power of the magnification. A value of 1.0 means no magnification. A value of 2.0 doubles the size.
uz: Kattalashtirishning kuchi. 1,0 qiymati kattalashtirishning yo'qligini bildiradi. A 2.0 qiymati o'lchamni ikki baravar oshiradi.

source: Enable lens mode
uz: Ob'ektiv rejimini yoqing

source: Whether the magnified view should be centered over the location of the system mouse and move with it.
uz: Kattalashtirilgan ko'rinish o'rtada joylashgan bo'lishi kerakmitizim sichqonchasi va u bilan harakatlaning.

source: Scroll magnified contents beyond the edges of the desktop
uz: Kattalashtirilgan tarkibni ish stoli chetlaridan tashqariga aylantiring

source: For centered mouse tracking, when the system pointer is at or near the edge of the screen, the magnified contents continue to scroll such that the screen edge moves into the magnified view.
uz: Sichqonchani markazlashtirilgan kuzatish uchun, tizim ko'rsatkichi chetida yoki yonida bo'lgandaekranda kattalashtirilgan tarkib shunday aylanishda davom etadiekran qirrasi kattalashtirilgan ko'rinishga o'tadi.

source: Show or hide crosshairs
uz: Kesishishlarni ko'rsatish yoki yashirish

source: Enables/disables display of crosshairs centered on the magnified mouse sprite.
uz: Kattalashtirilgan sichqonchaning markazida bo'lgan kesishuvni ko'rsatishni yoqadi/o'chiradi

source: Thickness of the crosshairs in pixels
uz: Pikseldagi o'zaro faoliyat chizig'ining qalinligi

source: Width in pixels of the vertical and horizontal lines that make up the crosshairs.
uz: Vertikal va gorizontal chiziqlarning piksellardagi kengligi

source: Color of the crosshairs
uz: Chiziqning rangi

source: The color of the the vertical and horizontal lines that make up the crosshairs.
uz: Vertikal va gorizontal chiziqlarning rangi

source: Opacity of the crosshairs
uz: Kesishishning shaffofligi

source: Determines the transparency of the crosshairs, from fully opaque to fully transparent.
uz: To'liq noaniqdan to'liqgacha bo'lgan chiziqning shaffofligini aniqlaydi

source: Length of the crosshairs in pixels
uz: Chiziqning piksellardagi uzunligi

source: Determines the length in pixels of the vertical and horizontal lines that make up the crosshairs.
uz: Vertikal va gorizontal chiziqlarning piksellardagi uzunligini aniqlaydiKesishtirgichni tuzing.

source: Clip the crosshairs at the center
uz: Markazdagi kesishgan chiziqni kesib oling

source: Determines whether the crosshairs intersect the magnified mouse sprite, or are clipped such that the ends of the horizontal and vertical lines surround the mouse image.
uz: Kixhraytirgich kattalashtirilgan sichqoncha sprite bilan kesishadimi yoki yo'qligini aniqlaydigorizontal va vertikal chiziqlarning uchlari atrofni o'rab oladigan darajada kesiladisichqoncha tasviri.

source: Inverse lightness
uz: Teskari yengillik

source: Determines whether the lightness values are inverted: darker colors become lighter and vice versa, and white and black are interchanged.
uz: Yengillik qiymatlari teskari yoki yo'qligini aniqlaydi: quyuqroq ranglar Yengilroq va aksincha, oq va qora o'zaro almashinadi.

source: Color Saturation
uz: Rangning toʻyinganligi

source: Represents a change to the color saturation, from 0.0 (grayscale) to 1.0 (full color).
uz: 0,0 (kulrang) dan 1,0 gacha bo'lgan rangning to'yinganligi o'zgarishini ifodalaydi(to'liq rangli).

source: Change brightness of red
uz: Qizilning yorqinligini o'zgartiring

source: Represents a change to the default brightness of the red component. Zero indicates no change, values less than zero indicate a decrease, and values greater than zero indicate an increase.
uz: Qizil komponentning standart yorqinligini o'zgartirishni ifodalaydi. Nol o'zgarish yo'qligini bildiradi, noldan kichik qiymatlar pasayishni va qiymatlarni ko'rsatadinoldan kattaroq o'sishni ko'rsatadi.

source: Change brightness of green
uz: Yashil rangning yorqinligini o'zgartiring

source: Represents a change to the default brightness for the green component. Zero indicates no change, values less than zero indicate a decrease, and values greater than zero indicate an increase.
uz: Yashil komponent uchun standart yorqinlikni o'zgartirishni ifodalaydi. Nol o'zgarish yo'qligini bildiradi, noldan kichik qiymatlar pasayishni va qiymatlarni ko'rsatadinoldan kattaroq o'sishni ko'rsatadi.

source: Change brightness of blue
uz: Moviy rangning yorqinligini o'zgartiring

source: Represents a change to the default brightness for the blue component. Zero indicates no change, values less than zero indicate a decrease, and values greater than zero indicate an increase.
uz: Moviy komponent uchun standart nashrida o'zgarishlarni ifodalaydi. Nol o'zgarish yo'qligini bildiradi, noldan kichik qiymatlar pasayishni va qiymatlarni ko'rsatadinoldan kattaroq o'sishni ko'rsatadi.

source: Change contrast of red
uz: Qizil rangning kontrastini o'zgartiring

source: Represents a change to the default contrast of the red component. Zero indicates no change in contrast, values less than zero indicate a decrease, and values greater than zero indicate an increase.
uz: Qizil komponentning standart kontrastini o'zgartirishni ifodalaydi. Nol va noldan katta qiymatlar o'sishni ko'rsatadi.

source: Change contrast of green
uz: Yashil rangning kontrastini o'zgartiring

source: Represents a change to the default contrast of the green component. Zero indicates no change in contrast, values less than zero indicate a decrease, and values greater than zero indicate an increase.
uz: Yashil komponentning standart kontrastini o'zgartirishni ifodalaydi. Nol va noldan katta qiymatlar o'sishni ko'rsatadi.

source: Change contrast of blue
uz: Ko'kning kontrastini o'zgartiring

source: Represents a change to the default contrast of the blue component. Zero indicates no change in contrast, values less than zero indicate a decrease, and values greater than zero indicate an increase.
uz: Moviy komponentning standart kontrastini o'zgartirishni ifodalaydi. Nol va noldan katta qiymatlar o'sishni ko'rsatadi.

source: Dwell click time
uz: Kutish vaqti

source: Time in seconds before a click is triggered.
uz: Bosish boshlanishidan oldin soniyalarda vaqt.

source: Movement threshold
uz: Harakat chegarasi

source: Distance in pixels before movement will be recognized.
uz: Harakatdan oldin piksellardagi masofa aniqlanadi.

source: Gesture single click
uz: Imo-ishora bir marta bosish

source: Direction to perform a single click (“left”, “right”, “up”, “down”).
uz: Bir marta bosish yo'nalishi (“chap“, “o'ng“, “yuqoriga“, “pastga“).

source: Gesture double click
uz: Imo-ishora bilan ikki marta bosing

source: Direction to perform a double click (“left”, “right”, “up”, “down”).
uz: Ikki marta bosish yo'nalishi (”chap”, ”o'ng”, ”yuqoriga”, ”pastga”).

source: Gesture drag click
uz: Imo-ishora bilan surib bosing"

source: Direction to perform dragging (“left”, “right”, “up”, “down”).
uz: Surish yo'nalishi (“chap“, “o'ng“, “yuqoriga“, “pastga“).

source: Gesture secondary click
uz: Imo-ishora bilan ikkinchi marta bosish

source: Direction to perform a secondary click (“left”, “right”, “up”, “down”).
uz: Ikkilamchi bosishni amalga oshirish uchun yo'nalish (“chap“, “o'ng“, “yuqoriga“, “pastga“).

source: Dwell click mode
uz: Doimiy bosish rejimi

source: The active dwell click mode. Possible values are “window” and “gesture”.
uz: Faol bosish rejimi. Mumkin qiymatlar “oyna“ va “imo-ishora“ dir.

source: Show click type window
uz: Bosish turi oynasini ko'rsatish

source: Show click type window.
uz: Bosish turi oynasini ko'rsatish

source: Enable dwell clicks
uz: Doimiy bosishlarni yoqing

source: Enable dwell clicks.
uz: Doimiy bosishlarni yoqing

source: Secondary click enabled
uz: Ikkilamchi bosish yoqilgan

source: Enable simulated secondary clicks
uz: Simulyatsiya qilingan ikkilamchi bosishlarni yoqing

source: Secondary click time
uz: Ikkilamchi bosish vaqti

source: Time in seconds before a simulated secondary click is triggered.
uz: Simulyatsiya qilingan ikkilamchi bosish boshlanishidan oldin soniyalarda vaqt.

source: Folder children
uz: Ichki jildlar

source: List of relative settings paths at which app-folders are stored. Each folder uses the org.gnome.desktop.app-folders.folder schema.
uz: Ilova jildlari saqlanadigan nisbiy sozlamalar yo'llari ro'yxati. Har bir jild org.gnome.desktop.app-folders.folder sxemasidan foydalanadi.

source: Folder name
uz: Jild nomi

source: The name of the application folder.
uz: Ilova jildining nomi.

source: Translate the name
uz: Nomni tarjima qiling

source: Whether the name key is a filename to be looked up in /usr/share/desktop-directories.
uz: Nom kaliti /usr/share/desktop-da qidiriladigan fayl nomimi yoki yo'qmi-

source: Applications
uz: Ilovalar

source: The list of IDs of applications that are explicitly included in this folder.
uz: Ushbu jildga aniq kiritilgan ilovalar identifikatorlari ro'yxati.

source: Categories
uz: Kategoriyalar

source: A list of categories for which apps will be placed into this folder by default, in addition to the apps that are listed in the apps key.
uz: Ushbu jildga ilovalar joylashtiriladigan toifalar roʻyxatiilovalar kalitida ko'rsatilgan ilovalarga qo'shimcha ravishda birlamchi.

source: Excluded applications
uz: Cheklangan ilovalar

source: A list of IDs of applications that are excluded from this folder. This can be used to remove applications that would otherwise be included by category.
uz: Ushbu jilddan chiqarib tashlangan ilovalar identifikatorlari ro'yxati. Bu mumkin aks holda toifaga kiritilishi mumkin bo'lgan ilovalarni o'chirish uchun foydalaniladi.

source: Picture Options
uz: Rasm parametrlari

source: Determines how the image set by wallpaper_filename is rendered. Possible values are “none”, “wallpaper”, “centered”, “scaled”, “stretched”, “zoom”, “spanned”.
uz: Oboy_filename tomonidan o'rnatilgan tasvir qanday ko'rsatilishini aniqlaydi. Mumkin qiymatlar “yo'q“, “fon rasmi“, “markazlashtirilgan“, “miqyosli“, “cho'zilgan“, “kattalashtirish“,

source: Picture URI
uz: Rasm URI

source: URI to use for the background image. Note that the backend only supports local (file://) URIs.
uz: Fon tasviri uchun foydalanish uchun URI. E'tibor bering, orqa qism faqat mahalliy (fayl://) URI'lar.

source: Picture URI (dark)
uz: Rasm URI (qora)

source: Picture Opacity
uz: Rasm shaffofligi

source: Opacity with which to draw the background picture.
uz: Fon rasmini chizish uchun shaffoflik.

source: Primary Color
uz: Asosiy rang

source: Left or Top color when drawing gradients, or the solid color.
uz: Gradientlarni chizishda chap yoki yuqori rang yoki bitta rang.

source: Secondary Color
uz: Ikkilamchi rang

source: Right or Bottom color when drawing gradients, not used for solid color.
uz: Gradientlarni chizishda o'ng yoki pastki rang, tekis rang uchun ishlatilmaydi.

source: Color Shading Type
uz: Rangni soyalash turi

source: How to shade the background color. Possible values are “horizontal”, “vertical”, and “solid”.
uz: Fon rangini qanday soya qilish kerak. Mumkin qiymatlar ”gorizontal”, ”vertikal” va ”qattiq”.

source: Have file manager handle the desktop
uz: Fayl menejeri ish stolini boshqaradi

source: If set to true, then file manager will draw the icons on the desktop.
uz: Agar ”rost” qiymati o'rnatilgan bo'lsa, fayl menejeri ish stolidagi piktogrammalarni chizadi.

source: Show the week date in the calendar
uz: Taqvimda hafta sanasini ko'rsating

source: If true, display the ISO week date in the calendar.
uz: Agar rost boʻlsa, kalendarda ISO hafta sanasini koʻrsating.

source: Automatically update timezone
uz: Vaqt mintaqasini avtomatik yangilash

source: Whether to automatically update the timezone using geolocation.
uz: Geolokatsiya yordamida vaqt mintaqasini avtomatik yangilash kerakmi.

source: Default calendar
uz: Standart kalendar

source: Default calendar application DEPRECATED: This key is deprecated and ignored. The preferred calendar application is the application handling the text/calendar mime type.
uz: Birlamchi taqvim ilovasi QO'SHILGAN: Bu kalit eskirgan va e'tiborga olinmagan.Maqbul taqvim ilovasi matn bilan ishlaydigan ilovadir/taqvim mim turi.

source: Calendar needs terminal
uz: Kalendarga terminal kerak

source: Whether the default calendar application needs a terminal to run. DEPRECATED: This key is deprecated and ignored. The preferred calendar application is the application handling the text/calendar mime type, whether it needs a terminal is taken from its desktop file.
uz: Birlamchi kalendar ilovasi ishlashi uchun terminal kerakmi yoki yo'qmi.QO'SHILGAN: Bu kalit eskirgan va e'tiborga olinmagan. Afzal kalendar Ilova - bu matn/taqvim mimikasi turini boshqaradigan dastur, xohUning ish stoli faylidan olingan terminal kerak.

source: Default tasks
uz: Standart vazifalar

source: Default tasks application.
uz: Standart vazifalar ilovasi.

source: Tasks needs terminal
uz: Vazifalar uchun terminal kerak

source: Whether the default tasks application needs a terminal to run.
uz: Standart vazifalar ilovasi ishlashi uchun terminal kerakmi yoki yo'qmi.

source: Terminal application
uz: Terminal ilovasi

source: Terminal program to use when starting applications that require one. DEPRECATED: This key is deprecated and ignored. The default terminal is handled in GIO.
uz: Talab qiladigan ilovalarni ishga tushirishda foydalanish uchun terminal dasturi.QO'SHILGAN: Bu kalit eskirgan va e'tiborga olinmagan. Standart terminal GIO da ishlanadi.

source: Exec Arguments
uz: Exec argumentlari

source: Argument used to execute programs in the terminal defined by the “exec” key. DEPRECATED: This key is deprecated and ignored. The default terminal and how to invoke it is handled in GIO.
uz: Argument “exec” tugmasi bilan belgilangan terminalda dasturlarni bajarish uchun ishlatiladi.QO'SHILGAN: Bu kalit eskirgan va e'tiborga olinmagan. Standart terminal va qanday Uni chaqirish GIO da ishlanadi.

source: Current input source
uz: Joriy kirish manbai
