Repository: nizomovasadbek/i10n
Catalog: gnome/43/gsettings-desktop-schemas.master.po
Languages: uz

source: Enable tap-and-drag-lock with touchpad
uz: Sensorli panel yordamida teginish va sudrab qulflash funksiyasini yoqing

source: Set this to TRUE to lock the dragging process within a short timeout when the finger is lifted on the touchpad and the tap-and-drag setting is enabled.
uz: Qisqa vaqt ichida sudrab olish jarayonini bloklash uchun buni ROST ga sozlangbarmoq sensorli panelda ko'tariladi va teginish va tortish sozlamalari yoqilgan.

source: Touchpad enabled
uz: Sensorli panel yoqilgan

source: Defines the situations in which the touchpad is enabled.
uz: TouchPad yoqilgan vaziyatlarni belgilaydi.

source: Touchpad button orientation
uz: Sensorli panel tugmasi yo'nalishi

source: Swap left and right mouse buttons for left-handed mice with “left”, “right” for right-handed, “mouse” to follow the mouse setting.
uz: Sichqonchaning chap va o'ng tugmalarini chap qo'l sichqonchalari uchun “chap“, “o'ng“ bilan almashtiring o'ng qo'li uchun, ”sichqoncha” sichqoncha sozlamalari amal qilish.

source: Acceleration profile
uz: Akselerator profili

source: Acceleration profile used for connected touchpads. The acceleration profile can be set to either default (“default”) which uses the default acceleration profile for each device, flat (“flat”), which accelerates by a device specific constant factor derived from the configured pointer speed, or adaptive (“adaptive”) which adapts the acceleration depending on the mouse movement. If a touchpad doesn’t support the configured profile, “default” will be used.
uz: Ulangan sensorli panellar uchun akselerator profili ishlatiladi. Akselerator profilistandart bo'yicha (”standart”) o'rnatilishi mumkin, bu standart akseleratordan foydalanadihar bir qurilma uchun profil, yassi (”tekis”), qurilma tomonidan akseleratsiya qilinadi sozlangan ko'rsatkich tezligidan olingan o'ziga xos doimiy omil yokimoslashuvchan (moslashuvchi) sichqonchaga qarab tezlashuvni moslashtiradiharakat. Agar sensorli panel sozlangan profilni qo'llab-quvvatlamasa, ”standart” ishlatiladi.

source: Pointer speed
uz: Ko'rsatkich tezligi

source: Pointer speed for the touchpad. Accepted values are in the [-1..1] range (from “unaccelerated” to “fast”). A value of 0 is the system default.
uz: Sensorli panel uchun ko'rsatkich tezligi. Qabul qilingan qiymatlar [-1..1] oralig'ida (”tezlatilmagan” dan ”tez” ga). 0 qiymati tizimning standart bo'yicha hisoblanadi.

source: Natural scrolling
uz: Tabiiy aylantirish

source: Set this to TRUE to enable natural (reverse) scrolling for touchpads.
uz: Sensorli panellar uchun tabiiy (teskari) aylantirishni yoqish uchun buni ROST ga sozlang.

source: Click method
uz: Bosish usuli

source: How to generate software-emulated buttons, either disabled (“none”), through specific areas (“areas”), number of fingers (“fingers”) or left as hardware default (“default”).
uz: Qanday qilib o'chirilgan (”yo'q”) dasturiy ta'minotga taqlid qilingan tugmalarni orqali yaratish mumkinma'lum joylar (”maydonlar”), barmoqlar soni (”barmoqlar”) yoki apparat sifatida qoldirilgan standart (”standart”).

source: Emulate middle click
uz: O'rta bosishni taqlid qilish

source: Set this to TRUE to enable middle click during simultaneous left and right click.
uz: Bir vaqtning o'zida chap va o'ngda o'rta bosishni yoqish uchun buni ROST qilib qo'yingbosing.

source: Keyboard repeat
uz: Klaviatura takrori

source: Set this to TRUE to enable keyboard repeat.
uz: Klaviatura takrorini yoqish uchun buni ROST qilib belgilang.

source: Key Repeat Interval
uz: Tugmani takrorlash oralig'i

source: Delay between repeats in milliseconds.
uz: Takrorlashlar orasidagi kechikish millisekundlarda.

source: Initial Key Repeat Delay
uz: Boshlang'ich tugmani takrorlash kechikishi

source: Initial key repeat delay in milliseconds.
uz: Boshlang'ich tugmachani millisekundlarda takrorlash kechikishi.

source: Remember NumLock state
uz: NumLock holatini eslab qolish

source: When set to true, GNOME will remember the state of the NumLock LED between sessions.
uz: Rost ga o'rnatilganda, GNOME NumLock LED holatini eslab qoladi.

source: NumLock state
uz: NumLock holati

source: The remembered state of the NumLock LED.
uz: NumLock LED ning eslab qolgan holati.

source: Mouse button orientation
uz: Sichqoncha tugmasi yo'nalishi

source: Swap left and right mouse buttons for left-handed mice.
uz: Sichqonchaning chap va o'ng tugmalarini chap qo'l sichqonchalari bilan almashtiring.

source: Pointer speed for mice. Accepted values are in the [-1..1] range (from “unaccelerated” to “fast”). A value of 0 is the system default.
uz: Sichqonlar uchun ko'rsatkich tezligi. Qabul qilingan qiymatlar [-1..1] oralig'ida (dan ”Tezlashtirilmagan” dan ”tez” ga). 0 qiymati tizimning standart bo'yicha hisoblanadi.

source: Set this to TRUE to enable natural (reverse) scrolling for mice.
uz: Sichqoncha uchun tabiiy (teskari) aylantirishni yoqish uchun buni TRUE qilib belgilang.

source: Acceleration profile used for connected mice. The acceleration profile can be set to either default (“default”) which uses the default acceleration profile for each device, flat (“flat”), which accelerates by a device specific constant factor derived from the configured pointer speed, or adaptive (“adaptive”) which adapts the acceleration depending on the mouse movement. If a mouse doesn’t support the configured profile, “default” will be used.
uz: Ulangan sichqonlar uchun akselerator profili ishlatiladi. Akselerator profili

source: Double click time
uz: Ikki marta bosish vaqti

source: Length of a double click in milliseconds.
uz: Ikki marta bosish uzunligi millisekundlarda.

source: Drag threshold
uz: Chegarani belgilang

source: Distance before a drag is started.
uz: Surish boshlanishidan oldingi masofa.

source: Drawing tablet mapping
uz: Planshet xaritasini chizish

source: EDID information of the output the tablet is mapped to. Must be in the format [vendor, product, serial]. ["","",""] relies on automatic mapping.
uz: Planshet ko'rsatilgan chiqishning EDID ma'lumoti. format [vendor, mahsulot, seriya]. ["","",""] avtomatik ga asoslangan.

source: Tablet mapping
uz: Planshet xaritalash

source: How input affects the pointer on the screen
uz: Kirish ekrandagi ko'rsatgichga qanday ta'sir qiladi

source: Tablet area
uz: Planshet maydoni

source: Dead area padding around the active area, in percentages. Respectively applied to left,right,top and bottom sides.
uz: Faol hudud atrofida ishlatilmaydigan maydon to'plami, foizlarda. Mos ravishda chap, o'ng, yuqori va pastki tomonlarga qo'llaniladi.

source: Tablet aspect ratio
uz: Planshet tomonlar nisbati

source: Enable this to restrict the tablet area to match the aspect ratio of the output.
uz: Planshet maydonini tomonlar nisbatiga mos keladigan tarzda cheklash uchun buni yoqingchiqish.

source: Tablet left-handed mode
uz: Planshetning chap qo'l rejimi

source: Enable this to allow physically rotating the tablet for left-handed setups
uz: Chap qo'lda sozlash uchun planshetni jismoniy aylantirishga ruxsat berish uchun buni yoqing

source: Stylus pressure curve
uz: Stylus bosimi egri chizig'i

source: Set this to x1, y1 and x2, y2 of the pressure curve applied to the stylus.
uz: Buni stilusga qo'llaniladigan bosim egri chizig'ining x1, y1 va x2, y2 ga o'rnating.

source: Eraser pressure curve
uz: O'chirg'ich bosimi egri chizig'i

source: Set this to x1, y1 and x2, y2 of the pressure curve applied to the eraser.
uz: Buni o'chirg'ichga qo'llaniladigan bosim egri chizig'ining x1, y1 va x2, y2 ga o'rnating.

source: Stylus button action, this button is located along the pen handle.
uz: Stylus tugmasi harakati, bu tugma qalam tutqichi bo'ylab joylashgan.

source: Secondary button action
uz: Ikkilamchi tugma harakati

source: Secondary stylus button action, this button is located along the pen handle on some styli like the Grip Pen. Other styli like the Airbrush Pen or the Inking Pen only have one button, this setting is ineffective on those.
uz: Ikkinchi darajali stilus tugmasi harakati, bu tugma qalam tutqichi bo'ylab joylashgan Grip Pen kabi ba'zi stillarda. Boshqa stillarda Airbrush Pen yoki Siyohli qalam faqat bitta tugmaga ega, bu sozlama ular uchun samarasiz.

source: Tertiary button action
uz: Uchinchi darajali tugma harakati

source: Tertiary stylus button action, this button is located along the pen handle on some styli like the 3D Pen. Other styli like the Grip Pen only have two buttons, this setting is ineffective on those.
uz: Uchinchi darajali stilus tugmasi harakati, bu tugma qalam tutqichi bo'ylab joylashgan3D qalam kabi ba'zi stiluslarda. Grip Pen kabi boshqa stillarda faqat ikkitasi bortugmalar, bu sozlama ular uchun samarasiz.

source: Pad button action type
uz: Pad tugmasi harakat turi

source: The type of action triggered by the button being pressed.
uz: Tugmani bosish orqali ishga tushiriladigan harakat turi.

source: Key combination for the custom action
uz: Maxsus harakat uchun tugmalar birikmasi

source: The keyboard shortcut generated when the button is pressed for custom actions.
uz: Klaviatura yorlig'i maxsus tugma bosilganda hosil bo'ladiharakatlar.

source: Touchscreen output mapping
uz: Sensorli ekran chiqish xaritasi

source: EDID information of the output the touchscreen is mapped to. Must be in the format [vendor, product, serial]. ["","",""] relies on automatic mapping.
uz: Sensorli ekran ko'rsatilgan chiqishning EDID ma'lumotlari. ichida bo'lishi kerak.format [vendor, mahsulot, seriya]. ["","",""] avtomatik ga asoslangan.

source: Mouse wheel emulation button. 0 to disable the feature.
uz: Sichqoncha g'ildiragi emulyatsiyasi tugmasi. 0 funksiyani o'chirish uchun.

source: Mouse wheel emulation button lock
uz: Sichqoncha g'ildiragi emulyatsiyasi tugmasi qulfi

source: Set this to TRUE to enable button locking for the wheel emulation button. If enabled, the first click of the button enables scrolling, the second click disables scrolling again.
uz: G'ildirak emulyatsiyasi tugmasi uchun tugmani qulflashni yoqish uchun buni ROST ga o'rnating. Agar yoqilgan, tugmani birinchi bosish aylantirishni, ikkinchi marta bosishqayta aylantirishni o'chirib qo'yadi.

source: Acceleration profile used for the trackball. The acceleration profile can be set to either default (“default”) which uses the default acceleration profile, flat (“flat”), which accelerates by a device specific constant factor derived from the configured speed, or adaptive (“adaptive”) which adapts the acceleration depending on the movement. If the trackball doesn’t support the configured profile, “default” will be used.
uz: Trekbol uchun akselerator profili ishlatiladi. Akselerator profili bo'lishi mumkinstandart akseleratordan foydalanadigan birlamchi (”standart”) ga o'rnating profil, yassi (”tekis”), bu qurilmaning o'ziga xos konstantasi bilan tezlashadi faktor sozlangan tezlikdan kelib chiqadi yoki moslashuvchan (”moslashuvchi”) akseleratori harakatga qarab moslashtiradi. Agar trekbol bo'lmasa konfiguratsiya qilingan profilni qo'llab-quvvatlang, ”standart” ishlatiladi.

source: Pointer speed for pointing sticks. Accepted values are in the [-1..1] range (from “unaccelerated” to “fast”). A value of 0 is the system default.
uz: Ko'rsatkich tayoqchalari uchun ko'rsatkich tezligi. Qabul qilingan qiymatlar [-1..1] oralig'ida(“tezlatilmagan“ dan “tez“ ga). 0 qiymati tizimning standart bo'yicha hisoblanadi.

source: Acceleration profile used for the pointing stick. The acceleration profile can be set to either default (“default”) which uses the default acceleration profile, flat (“flat”), which accelerates by a device specific constant factor derived from the configured speed, or adaptive (“adaptive”) which adapts the acceleration depending on the movement. If the pointing stick doesn’t support the configured profile, “default” will be used.
uz: Ko'rsatkich tayoq uchun ishlatiladigan akselerator profili. Akselerator profili standart bo'yicha (”standart bo'yicha”) o'rnatilishi mumkin, bu standart akseleratordan foydalanadiprofil, yassi (”tekis”), bu qurilmaning o'ziga xos konstantasi bilan tezlashadi faktor sozlangan tezlikdan kelib chiqadi yoki moslashuvchan (”moslashuvchi”) harakatga qarab akseleratorni moslashtiradi. Agar ko'rsatuvchi tayoq konfiguratsiya qilingan profilni qo'llab-quvvatlamaydi, ”standart” ishlatiladi.

source: Scrolling method
uz: O'tkazish usuli

source: Scrolling method used for pointing sticks. The scrolling method can be set to either default (“default”) which uses the default method, none (“none”), which disables scrolling, or middle-button (“on-button-down”) which enables scrolling whilst the middle button is held down.
uz: Yo'naltiruvchi tayoqlarni aylantirish usuli ishlatiladi. O'tkazish usulini sozlash mumkin standart bo'yicha (“standart“) birlamchi usuldan foydalanadi, hech biri (“yo'q“), aylantirishni o'chiradigan yoki o'rta tugma (“yoqish tugmasi“) o'rta tugmani bosib ushlab turganda aylantirish.

source: Controls visibility of personal information
uz: Shaxsiy ma'lumotlarning ko'rinishini nazorat qiladi

source: If set to true, the system will make an effort to not divulge the user’s identity on screen or on the network.
uz: Agar “rost“ qiymati o'rnatilsa, tizim foydalanuvchi ma'lumotlarini oshkor qilmaslikka harakat qiladiekranda yoki tarmoqdagi identifikatsiya.

source: Show full name in the user menu
uz: Foydalanuvchi menyusida to'liq ismini ko'rsating

source: Whether the users full name is shown in the user menu or not.
uz: Foydalanuvchilarning to'liq ismi foydalanuvchi menyusida ko'rsatiladimi yoki yo'qmi.

source: Whether to remove old files from the trash automatically
uz: Eski fayllarni chiqindi qutisidan avtomatik ravishda o'chirib tashlansinmi

source: If TRUE, automatically remove files from the trash when they are older than “old-files-age” days.
uz: Agar ROST bo'lsa, fayllar eskirganidan keyin avtomatik ravishda chiqindi qutisidan o'chirib tashlang”Eski fayllar yoshi” kunlari.

source: Whether to remove old temporary files automatically
uz: Eski vaqtinchalik fayllarni avtomatik ravishda o'chirib tashlash kerakmi

source: If TRUE, automatically remove temporary files when they are older than “old-files-age” days.
uz: Agar ROST bo'lsa, vaqtinchalik fayllar “eski-“ dan eski bo'lganda avtomatik ravishda o'chiring.“fayllar yoshi“ kunlari.

source: Number of days to keep trash and temporary files
uz: Chiqindi va vaqtinchalik fayllarni saqlash uchun kunlar soni

source: Consider trash and temporary files old after this many days.
uz: Ko'p kundan keyin chiqindi va vaqtinchalik fayllarni ko'rib chiqing.

source: Whether to remember recently used files
uz: Yaqinda foydalanilgan fayllarni eslab qolish kerakmi

source: If FALSE, applications will not remember recently used files.
uz: Agar YOLG'ON bo'lsa, ilovalar yaqinda ishlatilgan fayllarni eslab qolmaydi.

source: Number of days to remember recently used files for
uz: Yaqinda foydalanilgan fayllarni eslab qolish uchun kunlar soni

source: Recently used files will be remembered for this many days. If set to 0, recent files will not be remembered; if set to -1, they will be retained indefinitely.
uz: Yaqinda foydalanilgan fayllar shuncha kun davomida esda qoladi. Agar 0 ga o'rnatilgan bo'lsa, so'nggi fayllar eslab qolmaydi; agar -1 ga o'rnatilgan bo'lsa, ular saqlanadi

source: Whether to remember application usage
uz: Ilovadan foydalanishni eslab qolish kerakmi

source: If FALSE, application usage will not be monitored and recorded.
uz: Agar YOLG'ON bo'lsa, ilovadan foydalanish kuzatilmaydi va qayd etilmaydi.

source: Send statistics when applications are removed or installed
uz: Ilovalar o'chirilgan yoki o'rnatilganda statistikani yuboring

source: If FALSE, no anonymous installation or removal information will be sent to the vendor.
uz: Agar YOLG'ON bo'lsa, hech qanday anonim o'rnatish yoki olib tashlash ma'lumotlari yuborilmaydisotuvchi.

source: Send reports of technical problems to the vendor
uz: Sotuvchiga texnik muammolar haqida hisobot yuboring

source: If TRUE, anonymized reports will be sent automatically to the vendor.
uz: Agar ROST bo'lsa, anonim hisobotlar avtomatik ravishda sotuvchiga yuboriladi.

source: Don’t allow applications to access the microphone
uz: Ilovalarga mikrofonga kirishiga ruxsat bermang

source: If TRUE, applications should not use the microphone.
uz: Agar ROST bo'lsa, ilovalar mikrofondan foydalanmasligi kerak.

source: Don’t allow applications to access the camera
uz: Ilovalarning kameraga kirishiga ruxsat bermang

source: If TRUE, applications should not use the camera.
uz: Agar ROST boʻlsa, ilovalar kameradan foydalanmasligi kerak.

source: Don’t allow applications to output sound
uz: Ilovalarga ovoz chiqarishga ruxsat bermang

source: If TRUE, applications should not make sound.
uz: Agar ROST bo'lsa, ilovalar ovoz chiqarmasligi kerak.

source: Whether to protect USB devices
uz: USB qurilmalarini himoya qilish kerakmi

source: If the USBGuard service is present and this setting is enabled, USB devices will be protected as configured in the usb-protection-level setting.
uz: Agar USBGuard xizmati mavjud bo'lsa va bu sozlama yoqilgan bo'lsa, USB qurilmalariusb-himoya darajasi sozlamalarida konfiguratsiya qilinganidek himoyalangan bo'ladi.

source: When USB devices should be rejected
uz: Qachon USB qurilmalari rad etilishi kerak

source: If set to “lockscreen”, only when the lock screen is present new USB devices will be rejected; if set to “always”, all new USB devices will always be rejected.
uz: Agar ”bloklangan ekran” ga o'rnatilgan bo'lsa, faqat qulflangan ekran yangi USB qurilmalari mavjud bo'lganda rad qilinadi; agar ”har doim” ga o'rnatilgan bo'lsa, barcha yangi USB qurilmalar har doim rad etilgan.

source: Whether the privacy screen is enabled
uz: Maxfiylik ekrani yoqilganmi

source: If the underlying hardware has privacy screen support and this setting is enabled, the panels supporting this technology will be obscured from lateral view.
uz: Agar asosiy uskunada maxfiylik ekrani qo'llab-quvvatlansa va bu sozlama yoqilgan bo'lsa, ushbu texnologiyani qo'llab-quvvatlaydigan panellar yon tomondan yashiriladiko'rinish.

source: Activate when idle
uz: Bo'sh turganda faollashtiring

source: Set this to TRUE to activate the screensaver when the session is idle. DEPRECATED: This key is deprecated and ignored. Set org.gnome.desktop.session idle-delay to 0 if you do not want to activate the screensaver.
uz: Seans bo'sh turganda ekran pardasini faollashtirish uchun buni ROST qilib sozlang.QO'SHILGAN: Bu kalit eskirgan va e'tiborga olinmagan. Org.gnome.desktopni o'rnating.Agar siz ekran pardasini faollashtirishni xohlamasangiz, sessiya bo'sh vaqtini 0 ga kechiktiring.

source: Lock on activation
uz: Faollashtirishni bloklash

source: Set this to TRUE to lock the screen when the screensaver goes active.
uz: Ekran pardasi faollashganda ekranni qulflash uchun buni ROST qilib sozlang.

source: Time before locking
uz: Qulflashdan oldingi vaqt

source: The number of seconds after screensaver activation before locking the screen.
uz: Ekran pardasi faollashtirilgandan keyin ekranni qulflashdan oldingi soniyalar soni.

source: Show full name in the lock screen
uz: Bloklangan ekranda toʻliq ismni koʻrsating

source: Whether the user’s full name is shown in the lock screen or not. This only affects the screen shield, the name is always shown in the unlock dialog.
uz: Foydalanuvchining to'liq ismi bloklangan ekranda ko'rsatiladimi yoki yo'qmi. Bu faqat ekran qalqoniga ta'sir qiladi, nom har doim qulfni ochish dialogida ko'rsatiladi.

source: Allow embedding a keyboard into the window
uz: Klaviaturani oynaga joylashtirishga ruxsat bering

source: Set this to TRUE to allow embedding a keyboard into the window when trying to unlock. The “keyboard_command” key must be set with the appropriate command. DEPRECATED: This key is deprecated and ignored.
uz: Urinishda klaviaturani oynaga kiritishga ruxsat berish uchun buni ROST qilib qo'yingqulfni ochish uchun. ”keyboard_command” tugmasi tegishli bilan o'rnatilishi kerak.buyruq. QO'SHILGAN: Bu kalit eskirgan va e'tiborga olinmagan.

source: Embedded keyboard command
uz: O'rnatilgan klaviatura buyrug'i

source: The command that will be run, if the “embedded_keyboard_enabled” key is set to TRUE, to embed a keyboard widget into the window. This command should implement an XEMBED plug interface and output a window XID on the standard output. DEPRECATED: This key is deprecated and ignored.
uz: Agar ”embedded_keyboard_enabled” tugmasi o'rnatilgan bo'lsa, bajariladigan buyruq ”ROST”ga klaviatura vidjetini oynaga joylashtirish uchun. Bu buyruq XEMBED vilkasi interfeysini qo'llang va standartda XID oynasini chiqaringchiqish. QO'SHILGAN: Bu kalit eskirgan va e'tiborga olinmagan.

source: Allow logout
uz: Chiqishga ruxsat bering

source: Set this to TRUE to offer an option in the unlock dialog to allow logging out after a delay. The delay is specified in the “logout_delay” key. DEPRECATED: This key is deprecated and ignored.
uz: Ro'yxatga kirishga ruxsat berish uchun qulfni ochish dialog oynasida variantni taklif qilish uchun buni ROST qilib qo'yingkechikishdan keyin chiqish. Kechikish “logout_delay“ tugmachasida ko'rsatilgan. QO'SHILGAN: Bu kalit eskirgan va e'tiborga olinmagan.

source: Time before logout option
uz: Chiqish variantidan oldingi vaqt

source: The number of seconds after the screensaver activation before a logout option will appear in the unlock dialog. This key has effect only if the “logout_enable” key is set to TRUE. DEPRECATED: This key is deprecated and ignored
uz: Chiqishdan oldin ekran pardasi faollashtirilgandan keyingi soniyalar soniopsiya qulfni ochish dialog oynasida paydo bo'ladi. Bu kalit faqat “logout_enable” tugmasi ROST ga oʻrnatildi. QO'SHILGAN: Bu kalit eskirgan va e'tiborsiz

source: Logout command
uz: Chiqish buyrug'i

source: The command to invoke when the logout button is clicked. This command should simply log the user out without any interaction. This key has effect only if the “logout_enable” key is set to TRUE. DEPRECATED: This key is deprecated and ignored.
uz: Chiqish tugmasi bosilganda chaqiriladigan buyruq. Bu buyruq Foydalanuvchini hech qanday shovqinsiz tizimdan chiqing. Bu kalit faqat agar “logout_enable” tugmasi ROST ga o‘rnatildi. DEPRECATED: bu kalit eskirgan va e'tibor bermadi.

source: Allow user switching
uz: Foydalanuvchini almashtirishga ruxsat bering

source: Set this to TRUE to offer an option in the unlock dialog to switch to a different user account.
uz: Qulfni ochish dialog oynasida oʻtish variantini taklif qilish uchun buni ROST qilib belgilang.boshqa foydalanuvchi hisobi.

source: Allow the session status message to be displayed
uz: Seans holati haqidagi xabarni ko'rsatishga ruxsat bering

source: Allow the session status message to be displayed when the screen is locked. DEPRECATED: This key is deprecated and ignored.
uz: Ekran qulflanganda seans holati xabarini ko'rsatishga ruxsat bering.QO'SHILGAN: Bu kalit eskirgan va e'tiborga olinmagan.

source: Disable all external search providers
uz: Barcha tashqi qidiruv provayderlarini o'chirib qo'ying

source: Set to true to disable all external search provider programs, whether or not they are independently disabled or enabled. External search providers are installed by applications in $XDG_DATA_DIR/gnome-shell/search-providers.
uz: Barcha tashqi qidiruv provayder dasturlarini o'chirish uchun rost qiymatini o'rnating.Ular mustaqil ravishda o'chirilgan yoki yoqilgan. Tashqi qidiruv provayderlari $XDG_DATA_DIR/gnome-shell/search-provayderlardagi ilovalar tomonidan o'rnatilgan.

source: List of desktop file IDs for which the associated default-enabled search provider should be disabled
uz: Birgalikda qidiruv yoqilgan ish stoli fayl identifikatorlari ro'yxatiprovayder o'chirilgan bo'lishi kerak
