Repository: nizomovasadbek/i10n
Catalog: gnome/43/gsettings-desktop-schemas.master.po
Languages: uz

source: The zero-based index into the input sources list specifying the current one in effect. The value is automatically capped to remain in the range [0, sources_length) as long as the sources list isn’t empty. DEPRECATED: This key is deprecated and ignored.
uz: Kirish manbalari ro'yxatidagi nolga asoslangan indeks joriyni ko'rsatadiAmalda. Qiymat [0, oralig'ida qolish uchun avtomatik ravishda cheklanadi.sources_length) manbalar ro'yxati bo'sh bo'lmaguncha. TASHLATIB: Bu Kalit eskirgan va e'tiborga olinmagan.

source: List of input sources
uz: Kirish manbalari ro'yxati

source: List of input source identifiers available. Each source is specified as a tuple of 2 strings. The first string is the type and can be one of “xkb” or “ibus”. For “xkb” sources the second string is “xkb_layout+xkb_variant” or just “xkb_layout” if a XKB variant isn’t needed. For “ibus” sources the second string is the IBus engine name. An empty list means that the X server’s current XKB layout and variant won’t be touched and IBus won’t be used.
uz: Mavjud kirish manbasi identifikatorlari ro'yxati. Har bir manba sifatida ko'rsatilgan.2 satrdan iborat kortej. Birinchi qator turi va ”xkb” yoki dan biri bo'lishi mumkin.”ibus”. ”xkb” manbalari uchun ikkinchi qator ”xkb_layout+xkb_variant” yoki XKB varianti kerak bo'lmasa, faqat ”xkb_layout”. ”ibus” manbalari uchun ikkinchi qator - IBus dvigatelining nomi. Bo'sh ro'yxat X serverning joriy XKB tartibi va variantiga tegilmaydi va IBus bo'lmaydiishlatilgan.

source: List of most recently used input sources
uz: Eng so'nggi foydalanilgan kirish manbalari ro'yxati

source: List of most recently used input sources. The value is in the same format as the available sources list.
uz: Eng so'nggi foydalanilgan kiritish manbalari ro'yxati. Qiymat bir xil formatda mavjud manbalar ro'yxati.

source: List of XKB options
uz: XKB variantlari ro'yxati

source: List of XKB options. Each option is an XKB option string as defined by xkeyboard-config’s rules files.
uz: XKB opsiyalari roʻyxati. Har bir variant XKB opsiya qatori tomonidan belgilangan.xkeyboard-config qoidalari fayllari.

source: Show all installed input sources
uz: Barcha o'rnatilgan kirish manbalarini ko'rsatish

source: Makes all installed input sources available for choosing in System Settings.
uz: Tizim sozlamalarida tanlash uchun barcha o'rnatilgan kirish manbalarini mavjud qiladi.

source: Use different input sources for each window
uz: Har bir oyna uchun turli xil kirish manbalaridan foydalaning

source: When enabled, input sources get attached to the currently focused window when activated.
uz: Yoniq bo'lganda, kiritish manbalari hozirda fokuslangan oynaga biriktiriladifaollashtirilganda.

source: Enable Toolkit Accessibility
uz: Asboblar to'plamiga kirish imkoniyatini yoqing

source: Whether toolkits should load accessibility related modules.
uz: Asboblar to'plamlari mavjudlik bilan bog'liq modullarni yuklashi kerakmi.

source: Enable Animations
uz: Animatsiyalarni yoqish

source: Whether animations should be displayed. Note: This is a global key, it changes the behaviour of the window manager, the panel etc.
uz: Animatsiyalar ko'rsatilishi kerakmi. Eslatma: Bu global kalit, u Oyna boshqaruvchisi, panel va boshqalarning xatti-harakatlarini o'zgartiradi.

source: Menus Have Tearoff
uz: Menyularda uzilishlar mavjud

source: Can Change Accels
uz: Tezlashtirishni o'zgartirishi mumkin

source: Whether the user can dynamically type a new accelerator when positioned over an active menuitem.
uz: Foydalanuvchi yangi tezlatkichni dinamik ravishda kirita oladimi yoki yo'qmifaol menyu elementi.

source: Toolbar Style
uz: Asboblar paneli uslubi

source: Toolbar Style. Valid values are “both”, “both-horiz”, “icons”, and “text”.
uz: Asboblar paneli uslubi. Yaroqli qiymatlar ”ikkalasi”, ”ikkalasi ham”, ”belgilar” va ”matn”.

source: Menubar Detachable
uz: Ochiladigan menyu

source: Whether the user can detach menubars and move them around.
uz: Foydalanuvchi menyu panelini ajratib olishi va ularni ko'chirishi mumkinmi.

source: Toolbar Detachable
uz: Asboblar paneli ajratib olinadi

source: Whether the user can detach toolbars and move them around.
uz: Foydalanuvchi asboblar panelini ajratib olishi va ularni harakatlantirishi mumkinmi.

source: Toolbar Icon Size
uz: Asboblar paneli ikon hajmi

source: Size of icons in toolbars, either “small” or “large”.
uz: Asboblar panelidagi ikonkalarning o'lchami, ”kichik” yoki ”katta”.

source: Cursor Blink
uz: Kursor miltillaydi

source: Whether the cursor should blink.
uz: Kursor miltillashi kerakmi.

source: Cursor Blink Time
uz: Kursor miltillash vaqti

source: Length of the cursor blink cycle, in milliseconds.
uz: Kursor miltillash davrining uzunligi, millisekundlarda.

source: Cursor Blink Timeout
uz: Kursor miltillash vaqti tugashi

source: Time after which the cursor stops blinking, in seconds.
uz: Kursor miltillashdan to'xtagan vaqt, soniyalarda.

source: Icon Theme
uz: Ikonka mavzusi

source: Icon theme to use for the panel, nautilus etc.
uz: Panel, nautilus va boshqalar uchun foydalanish uchun ikonka mavzusi.

source: Gtk+ Theme
uz: Gtk+ mavzusi

source: Basename of the default theme used by gtk+.
uz: gtk+ tomonidan ishlatiladigan standart mavzuning asosiy nomi.

source: Gtk+ Keybinding Theme
uz: Gtk+ tugmachalarni ulash mavzusi

source: Basename of the default keybinding theme used by gtk+.
uz: gtk+ tomonidan ishlatiladigan birlamchi tugmalarni ulash mavzusining asosiy nomi.

source: Default font
uz: Standart shrift

source: Name of the default font used by gtk+.
uz: gtk+ tomonidan ishlatiladigan standart shrift nomi.

source: Directories with avatar faces
uz: Avatar yuzlari bilan kataloglar

source: Directories to override the default avatar faces installed by gnome-control-center.
uz: Gnome-control tomonidan o'rnatilgan standart avatar yuzlarini bekor qilish uchun kataloglar-markaz.

source: Text scaling factor
uz: Matnni masshtablash faktori

source: Factor used to enlarge or reduce text display, without changing font size.
uz: Faktor shrift o'lchamini o'zgartirmasdan, matn ko'rinishini kattalashtirish yoki kamaytirish uchun ishlatiladi.

source: Window scaling factor
uz: Oyna masshtabining faktori

source: Integer factor used to scale windows by. For use on high-dpi screens. 0 means pick automatically based on monitor.
uz: Butun son koeffitsienti oynalarni kattalashtirish uchun ishlatiladi. Yuqori dpi ekranlarda foydalanish uchun. 0 Monitor asosida avtomatik tanlash degani.

source: GTK IM Preedit Style
uz: GTK IM oldindan tahrirlash uslubi

source: Name of the GTK+ input method Preedit Style used by gtk+.
uz: gtk+ tomonidan ishlatiladigan GTK+ kiritish usulining nomi Preedit Style.

source: GTK IM Status Style
uz: GTK IM holati uslubi

source: Name of the GTK+ input method Status Style used by gtk+.
uz: gtk+ tomonidan ishlatiladigan GTK+ kiritish usulining nomi Status Style

source: GTK IM Module
uz: GTK IM moduli

source: Name of the input method module used by GTK+.
uz: GTK+ tomonidan ishlatiladigan kiritish usuli modulining nomi.

source: Document font
uz: Hujjat shrifti

source: Name of the default font used for reading documents.
uz: Hujjatlarni o'qish uchun ishlatiladigan standart shrift nomi.

source: Monospace font
uz: Monospace shrifti

source: Name of a monospaced (fixed-width) font for use in locations like terminals.
uz: Terminallar kabi joylarda foydalanish uchun monospaced (belgilangan kenglik) shrift nomi.

source: Keyboard shortcut to open the menu bars.
uz: Menyu satrlarini ochish uchun klaviatura yorlig'i.

source: Cursor theme
uz: Kursor mavzusi

source: Cursor theme name. Used only by Xservers that support the Xcursor extension.
uz: Kursor mavzusi nomi. Faqat Xkursor kengaytmasini qo'llab-quvvatlaydigan Xserverlar tomonidan qo'llaniladi.

source: Cursor size
uz: Kursor o'lchami

source: Size of the cursor used as cursor theme.
uz: Kursor mavzusi sifatida foydalaniladigan kursor o'lchami.

source: Timeout before click repeat
uz: Takrorlashni bosishdan oldin kutish vaqti

source: Timeout in milliseconds before a click starts repeating (on spinner buttons for example).
uz: Bosihlar takrorlanishi boshlanishidan oldin millisekundlarda vaqt tugashi (spinner tugmalarida

source: Timeout between click repeats
uz: Bosishni takrorlash orasidagi vaqt tugashi

source: Timeout in milliseconds between repeated clicks when a button is left pressed.
uz: Bir tugma qolganda takroriy bosishlar orasidagi millisekundlarda vaqt tugashi

source: Palette used in the color selector
uz: Rang tanlashda ishlatiladigan palitra

source: Palette used in the color selector as defined by the “gtk-color-palette” setting
uz: ”Gtk-color-palette” tomonidan belgilangan rang tanlashda ishlatiladigan palitrasozlash

source: List of symbolic names and color equivalents
uz: Ramziy nomlar va rang ekvivalentlari ro'yxati

source: A “\n” separated list of “name:color” as defined by the “gtk-color-scheme” setting
uz: ”gtk-color-scheme” tomonidan belgilangan ”ism:rang” ning ”\n” ajratilgan ro'yxati sozlash

source: Whether the clock displays in 24h or 12h format
uz: Soat 24 soat yoki 12 soat formatida ko'rsatiladimi

source: Whether the clock shows seconds
uz: Soat soniyalarni ko'rsatilsinmi

source: If true, display seconds in the clock.
uz: Agar rost bo'lsa, soniyalarni soatda ko'rsating.

source: Show date in clock
uz: Sanani soatda ko'rsatish

source: If true, display date in the clock, in addition to time.
uz: Agar rost boʻlsa, vaqtdan tashqari sanani soatda koʻrsatiladi

source: Show weekday in clock
uz: Ish kunini soat bo'yicha ko'rsatish

source: If true, display weekday in the clock, in addition to time.
uz: Agar rost boʻlsa, vaqtdan tashqari ish kunini soatda koʻrsatiladi

source: If true, the activities overview can be accessed by moving the mouse to the top-left corner.
uz: Agar rost bo'lsa, sichqonchani ga siljitish orqali harakatlar umumiy ko'rinishiga kirish mumkin

source: Show battery percentage
uz: Batareya foizini ko'rsatish

source: If true, display battery percentage in the status menu, in addition to the icon.
uz: Agar rost bo'lsa, holat menyusida batareya foizini ko'rsatiladiikonka.

source: Enable the primary paste selection
uz: Birlamchi joylashtirish tanlovini yoqing

source: If true, gtk+ uses the primary paste selection, usually triggered by a middle mouse button click.
uz: Agar rost bo'lsa, gtk+ odatda asosiy joylashtirish tanlovidan foydalanadi.sichqonchaning o'rta tugmachasini bosing.

source: Allow overlay scrolling
uz: Overlay aylantirishga ruxsat bering

source: Whether scrollbars should be overlayed as indicators. Depending on input devices in use, permanent scrollbars may still be displayed.
uz: O'tkazish panellari indikator sifatida joylashtirilishi kerakmi. Kirishga qarab ishlatilayotgan qurilmalar, doimiy aylantirish panellari hali ham ko'rsatilishi mumkin.

source: If true, pressing a key will highlight the current pointer location on screen.
uz: Agar rost bo'lsa, tugmani bosish ko'rsatgichning joriy joyini ta'kidlaydiekran.

source: The type of antialiasing to use when rendering fonts. Possible values are: “none” for no antialiasing, “grayscale” for standard grayscale antialiasing, and “rgba” for subpixel antialiasing (LCD screens only).
uz: Shriftlarni renderlashda foydalanish uchun antialiasing turi. Mumkin qiymatlar: Qaratishni yo'q qilish uchun ”yo'q”, standart kulrang shkalani antialiasing uchun ”kulrang rang”, va ”rgba” subpixel antialiasing uchun (faqat LCD ekranlar uchun).

source: Hinting
uz: Ishora

source: The type of hinting to use when rendering fonts. Possible values are: “none” for no hinting and “slight” for fitting only to the Y-axis like Microsoft’s ClearType, DirectWrite and Adobe’s proprietary font rendering engine. Ignores native hinting within the font, generates hints algorithmically. Used on Ubuntu by default. Recommended. The meaning of “medium” and “full” depends on the font format (.ttf, .otf, .pfa/.pfb) and the installed version of FreeType. They usually try to fit glyphs to both the X and the Y axis (except for .otf: Y-only). This can lead to distortion and/or inconsistent rendering depending on the quality of the font, the font format and the state of FreeType’s font engines.
uz: Shriftlarni renderlashda foydalaniladigan ishora turi. Mumkin qiymatlar: ”yo'q” Hech qanday maslahat va ”slight” faqat Microsoft kabi Y o'qiga moslashish uchun ClearType, DirectWrite va Adobe-ning xususiy shriftlarni ko'rsatish mexanizmi.Shrift ichidagi mahalliy maslahatlarga e'tibor bermaydi, maslahatlarni algoritmik tarzda yaratadi.Ubuntuda standart ishlatiladi. Tavsiya etiladi. ”O'rta” va ”to'liq” ma'nosi shrift formatiga (.ttf, .otf, .pfa/.pfb) va o'rnatilgan versiyaga bog'liqFreeType. Ular odatda X va Y o'qlariga gliflarni moslashtirishga harakat qilishadi(.otf bundan mustasno: Y-faqat). Bu buzilish va/yoki nomuvofiqlikka olib kelishi mumkin shrift, shrift formati va sifatiga qarab renderlashFreeType shrift dvigatellarining holati.

source: RGBA order
uz: Rgba tartibi

source: The order of subpixel elements on an LCD screen; only used when antialiasing is set to “rgba”. Possible values are: “rgb” for red on left (most common), “bgr” for blue on left, “vrgb” for red on top, “vbgr” for red on bottom.
uz: LCD displeydagi subpiksel elementlarning tartibi; faqat antialiasing paytida ishlatiladi ”rgba” ga o'rnatilgan. Mumkin qiymatlar: chapdagi qizil uchun ”rgb” (eng keng tarqalgan), Chapdagi ko'k uchun ”bgr”, tepada qizil uchun ”vrgb”, pastda qizil uchun ”vbgr”.

source: Color scheme
uz: Rang sxemasi

source: The preferred color scheme for the user interface. Valid values are “default”, “prefer-dark”, “prefer-light”.
uz: Foydalanuvchi interfeysi uchun afzal rang sxemasi. Tanlovlar ”standart”, ”afzal-qorong'i”, ”afzal-yorug'lik”.

source: Prevent the user from accessing the terminal or specifying a command line to be executed. For example, this would disable access to the panel’s “Run Application” dialog.
uz: Foydalanuvchining terminalga kirishini oldini olish yoki buyruq qatorini belgilashbajarilishi kerak. Masalan, bu paneldagi ”Ishga tushirish” ga kirishni o'chirib qo'yadi.”Ilova” dialog oynasi.

source: Disable saving files to disk
uz: Fayllarni diskka saqlashni o'chirib qo'ying

source: Prevent the user from saving files to disk. For example, this would disable access to all applications’ “Save as” dialogs.
uz: Foydalanuvchining fayllarni diskka saqlashiga yo'l qo'ymaslik. Masalan, bu o'chirib qo'yadi barcha ilovalarning ”Boshqa saqlash” dialog oynalariga kirish.

source: Disable printing
uz: Chop etishni o‘chiring

source: Prevent the user from printing. For example, this would disable access to all applications’ “Print” dialogs.
uz: Foydalanuvchining chop etishiga yo'l qo'ymaslik. Masalan, bu barcha ilovalarning “Chop etish“ dialog oynalari.

source: Disable print setup
uz: Chop etish sozlamalarini o'chirib qo'ying

source: Disable user switching
uz: Foydalanuvchi almashinuvini o'chirib qo'ying

source: Prevent the user from switching to another account while his session is active.
uz: Foydalanuvchining seans ishlayotgan vaqtda boshqa hisobga o'tishini oldini olish

source: Disable lock screen
uz: Bloklash ekranini o'chiring

source: Prevent the user to lock his screen.
uz: Foydalanuvchining ekranini qulflashiga yo'l qo'ymaslik.

source: Disable URL and MIME type handlers
uz: URL va MIME tipidagi ishlov beruvchilarni o'chirib qo'ying

source: Prevent running any URL or MIME type handler applications.
uz: Har qanday URL yoki MIME tipidagi ishlov beruvchi ilovalarini ishga tushirishni oldini oling.

source: Disable log out
uz: Chiqishni o'chirish

source: Prevent the user from logging out.
uz: Foydalanuvchining tizimdan chiqishini oldini olish.

source: Disable user administration
uz: Foydalanuvchi boshqaruvini o'chirib qo'ying

source: Stop the user from modifying user accounts. By default, we allow adding and removing users, as well as changing other users settings.
uz: Foydalanuvchining foydalanuvchi hisoblarini o'zgartirishini to'xtating. Odatiy bo'lib, biz qo'shishga ruxsat beramiz va foydalanuvchilarni olib tashlash, shuningdek, boshqa foydalanuvchilar sozlamalarini o'zgartirish.

source: Mount removable storage devices as read-only
uz: Olinadigan xotira qurilmalarini faqat o'qish uchun o'rnating

source: Prevent users from writing or modifying files on removable storage devices (i.e. flash disks, mobile phones, cameras).
uz: Foydalanuvchilarni olinadigan xotira qurilmalarida fayllarni yozish yoki o'zgartirishni oldini olish(masalan, flesh-disklar, mobil telefonlar, kameralar).

source: Disable password showing
uz: Parolni ko'rsatishni o'chiring

source: Disable the "Show Password" menu item in password entries.
uz: Parol yozuvlarida "Parolni ko'rsatish" menyu bandini o'chirib qo'ying.

source: Whether to automatically mount media
uz: Media avtomatik ravishda o'rnatiladimi

source: If set to true, then Nautilus will automatically mount media such as user-visible hard disks and removable media on start-up and media insertion.
uz: Agar “rost“ qiymati o'rnatilsa, Nautilus avtomatik ravishda foydalanuvchi kabi mediani o'rnatadi.ko'rinadigan qattiq disklar va olinadigan muhitlar ishga tushirilganda va media qo'shiladi.

source: Whether to automatically open a folder for automounted media
uz: Avtomatik o'rnatilgan media uchun jildni avtomatik ravishda ochish kerakmi

source: If set to true, then Nautilus will automatically open a folder when media is automounted. This only applies to media where no known x-content/* type was detected; for media where a known x-content type is detected, the user configurable action will be taken instead.
uz: Agar “rost“ ga o'rnatilgan bo'lsa, media yoqilganda Nautilus avtomatik ravishda jildni ochadiavtomatik o'rnatilgan. Bu faqat x-kontent/* turi ma'lum bo'lmagan media uchun amal qiladianiqlandi; ma'lum x-kontent turi aniqlangan media uchun foydalanuvchi o'rniga sozlanishi mumkin bo'lgan harakat amalga oshiriladi.

source: Never prompt or autorun/autostart programs when media are inserted
uz: Media qo'yilganda hech qachon dasturlarni so'ramang yoki avtomatik ishga tushirmang/avtomatik ishga tushirmang

source: If set to true, then Nautilus will never prompt nor autorun/autostart programs when a medium is inserted.
uz: Agar “rost“ ga o'rnatilgan bo'lsa, Nautilus hech qachon so'ramaydi va avtomatik ishga tushirmaydi/avtomatik ishga tushirmaydiO'rta vosita kiritilganda dasturlar.

source: List of x-content/* types where the preferred application will be launched
uz: Afzal ilova ishga tushiriladigan x-content/* turlari ro'yxati

source: List of x-content/* types for which the user have chosen to start an application in the preference capplet. The preferred application for the given type will be started on insertion on media matching these types.
uz: Foydalanuvchi boshlash uchun tanlagan x-content/* turlari ro'yxatiafzal kappletdagi ilova. uchun afzal qilingan ilova.Belgilangan tur ushbu turlarga mos keladigan mediaga o'rnatilganda boshlanadi.

source: List of x-content/* types set to “Do Nothing”
uz: X-content/* turlari roʻyxati “Hech narsa qilmaslik”ga oʻrnatilgan

source: List of x-content/* types for which the user have chosen “Do Nothing” in the preference capplet. No prompt will be shown nor will any matching application be started on insertion of media matching these types.
uz: Foydalanuvchi ”Hech narsa qilmaslik” ni tanlagan x-content/* turlari ro'yxatiafzal capplet. Hech qanday so'rov ko'rsatilmaydi va mos kelmaydigan Ushbu turlarga mos keladigan ommaviy axborot vositalarini kiritish bo'yicha dastur boshlanadi.

source: List of x-content/* types set to “Open Folder”
uz: X-content/* turlari roʻyxati “Ochiq jild

source: List of x-content/* types for which the user have chosen “Open Folder” in the preferences capplet. A folder window will be opened on insertion of media matching these types.
uz: Foydalanuvchi “Jildni ochish“ ni tanlagan x-content/* turlari ro'yxatiSozlamalar kappleti. Qo'shilganda papka oynasi ochiladi ushbu turlarga mos keladigan ommaviy axborot vositalari.

source: Show notification banners
uz: Bildirishnoma bannerlarini ko'rsatish

source: Whether notification banners are visible for application notifications.
uz: Ilova bildirishnomalari uchun bildirishnoma bannerlari koʻrinadimi.

source: Show notifications in the lock screen
uz: Bloklangan ekranda bildirishnomalarni ko'rsatish

source: Whether notifications are shown in the lock screen or not.
uz: Bloklangan ekranda bildirishnomalar ko'rsatiladimi yoki yo'qmi.

source: Application ID
uz: Ilova ID

source: The application that this policy is for.
uz: Ushbu siyosat tegishli ilova.

source: Enable notifications
uz: Bildirishnomalarni yoqish

source: Whether notifications are globally enabled for this application.
uz: Ushbu ilova uchun bildirishnomalar global miqyosda yoqilganmi yoki yo'qmi.

source: Enable sound alerts
uz: Ovozli ogohlantirishlarni yoqish

source: Whether notifications should be accompanied by sound alerts.
uz: Bildirishnomalar ovozli ogohlantirishlar bilan birga bo'lishi kerakmi.

source: Whether notifications from this application are expanded automatically when in banner mode.
uz: Ushbu ilovadan bildirishnomalar qachon avtomatik ravishda kengaytiriladimibanner rejimida.

source: Show in the lock screen
uz: Bloklangan ekranda ko'rsatish

source: Whether notifications from this application are shown when the screen is locked.
uz: Ekran ochilganda ushbu ilovadan bildirishnomalar ko'rsatiladimi

source: Show details in the lock screen
uz: Bloklangan ekranda tafsilotlarni ko'rsatish

source: Whether the summary and body of notifications from this application will be visible in the locked screen.
uz: Ushbu ilovadagi bildirishnomalarning xulosasi va asosiy qismi bo'ladimiqulflangan ekranda ko'rinadi.

source: Whether edge scrolling is enabled
uz: Edge scrolling yoqilganmi

source: When enabled, touchpads that support edge scrolling will have that feature enabled.
uz: Yoqilganda, edge scrolling-ni qo'llab-quvvatlaydigan touchpads ushbu xususiyatga ega bo'ladi yoqilgan.

source: Whether two-finger scrolling is enabled
uz: Ikki barmoq bilan aylantirish yoqilganmi

source: When enabled, touchpads that support two-finger scrolling will have that feature enabled.
uz: Ikki barmoq bilan aylantirishni qo'llab-quvvatlaydigan sensorli panellar yoqilganda, shunday bo'ladifunksiya yoqilgan.

source: Whether to disable the touchpad while typing
uz: Yozish paytida sensorli panelni o'chirib qo'yish

source: When enabled, touchpads will be disabled while typing on the keyboard.
uz: Yoqilganda, klaviaturada yozish paytida sensorli panellar o'chiriladi

source: Enable mouse clicks with touchpad
uz: Sensorli panel yordamida sichqonchani bosishni yoqing

source: Set this to TRUE to be able to send mouse clicks by tapping on the touchpad.
uz: Sensorli panelni bosish orqali sichqonchani bosishlarni yuborish imkoniyatiga ega bo‘lish uchun buni ROST qilib qo‘ying.

source: Tap Button Map
uz: Tugma xaritasiga teging

source: Defines the mapping between the number of fingers and touchpad buttons. The default is to have a 1, 2 and 3 finger tap to map to the left, right and middle button ("lrm"), respectively.
uz: Barmoqlar soni va sensorli panel tugmalari orasidagi xaritani belgilaydi. Birlamchi parametr - chap, o'ng va xaritani aniqlash uchun 1, 2 va 3 barmoq bilan teginishmos ravishda o'rta tugma ("lrm").

source: Enable tap-and-drag with touchpad
uz: Sensorli panel yordamida teginish va tortish funksiyasini yoqing

source: Set this to TRUE to be able to start a drag by tapping and immediately moving the finger that’s now pressed on the touchpad.
uz: Bosish orqali va darhol tortib olish uchun buni ROST qilib qo‘yingsensorli panelda bosilgan barmoqni harakatlantirish.
