Repository: nizomovasadbek/i10n
Catalog: gnome/43/gsettings-desktop-schemas.master.po
Languages: uz

source: Some applications disregard specifications in ways that result in window manager misfeatures. This option puts the WM in a rigorously correct mode, which gives a more consistent user interface, provided one does not need to run any misbehaving applications.
uz: Ba'zi ilovalar spetsifikatsiyalarni e'tiborsiz qoldiradi, natijada oyna paydo bo'ladimenejerning noto'g'ri xususiyatlari. Bu parametr WMni qat'iy to'g'ri rejimga qo'yadi, bu foydalanuvchi interfeysini yanada barqaror qiladi, agar kerak bo'lmasahar qanday noto'g'ri ishlaydigan ilovalarni ishga tushiring.

source: The names of the workspaces
uz: Ish joylarining nomlari

source: Defines the names that should be assigned to workspaces. If the list is too long for the current number of workspaces, names in excess will be ignored. If the list is too short, or includes empty names, missing values will be replaced with the default (“Workspace N”).
uz: Ish joylariga tayinlanishi kerak bo'lgan nomlarni belgilaydi. Agar ro'yxat juda bo'lsa Joriy ish joylari soni uzoq davom etsa, ortiqcha nomlar e'tiborga olinmaydi.Agar ro'yxat juda qisqa bo'lsa yoki bo'sh nomlarni o'z ichiga olsa, yetishmayotgan qiymatlar standart bilan almashtirildi (”Ish maydoni N”).

source: The locale to use for dates / numbers formats
uz: Sana/raqam formatlari uchun foydalaniladigan til

source: Specify the locale to be used for displaying dates, times and numbers formats.
uz: Sana, vaqt va raqamlarni ko'rsatish uchun ishlatiladigan tilni belgilang

source: Geolocation services are enabled.
uz: Geolokatsiya xizmatlari yoqilgan

source: If true, applications are allowed to access location information.
uz: Agar rost boʻlsa, ilovalarga joylashuv maʼlumotlariga kirishga ruxsat beriladi.

source: The maximum accuracy level of location.
uz: Joylashuvning maksimal aniqlik darajasi.

source: Configures the maximum level of location accuracy applications are allowed to see. Valid options are “country”, “city”, “neighborhood”, “street”, and “exact” (typically requires GPS receiver). Please keep in mind that this only controls what GeoClue will allow applications to see and they can find user’s location on their own using network resources (albeit with street-level accuracy at best).
uz: Ilovalarga ruxsat berilgan joylashuv aniqligining maksimal darajasini sozlaydikoʻrish uchun. Yaroqli variantlar: ”mamlakat”, ”shahar”, ”mahalla”, ”koʻcha” va ”aniq” (odatda GPS qabul qiluvchisi talab qilinadi). Shuni yodda tutingki, bu faqat GeoClue ilovalarni ko'rishga ruxsat berishini nazorat qiladi va ular topishi mumkintarmoq resurslaridan foydalangan holda foydalanuvchining joylashuvi (ko'chada bo'lsa ham-Eng yaxshi darajadagi aniqlik).

source: Proxy configuration mode
uz: Proksi-server konfiguratsiya rejimi

source: Select the proxy configuration mode. Supported values are “none”, “manual”, “auto”. If this is “none”, then proxies are not used. If it is “auto”, the autoconfiguration URL described by the “autoconfig-url” key is used. If it is “manual”, then the proxies described by “/system/proxy/http”, “/system/proxy/https”, “/system/proxy/ftp” and “/system/proxy/socks” will be used. Each of the 4 proxy types is enabled if its “host” key is non-empty and its “port” key is non-0. If an http proxy is configured, but an https proxy is not, then the http proxy is also used for https. If a SOCKS proxy is configured, it is used for all protocols, except that the http, https, and ftp proxy settings override it for those protocols only.
uz: Proksi-serverni sozlash rejimini tanlang. Qo'llab-quvvatlanadigan qiymatlar ”yo'q”, ”qo'lda”, ”avto”. Agar bu ”yo'q” bo'lsa, proksi-serverlar ishlatilmaydi. Agar ”avtomatik” bo'lsa, ”autoconfig-url” tugmasi bilan tavsiflangan avtomatik sozlash URL manzili ishlatiladi. Agar shunday bo'lsa ”qo'lda”, keyin ”/system/proxy/http”, ”/system/” tomonidan tavsiflangan proksi-serverlar”proksi/https”, ”/system/proxy/ftp” va ”/system/proxy/socks” ishlatiladi.4 proksi-server turining har biri yoqilgan bo'lsa, uning ”host” kaliti bo'sh bo'lmasa va “port” kaliti 0 emas. Agar http proksi-server sozlangan bo'lsa, lekin https proksi-server yo'q, http proksi-server https uchun ham ishlatiladi. Agar SOCKS proksi-server konfiguratsiya qilingan, u barcha protokollar uchun ishlatiladi, bundan tashqari http, https va ftp proksi-server sozlamalari faqat ushbu protokollar uchun uni bekor qiladi.

source: Automatic proxy configuration URL
uz: Avtomatik proksi-server konfiguratsiyasi URL

source: URL that provides proxy configuration values. When mode is “auto”, this URL is used to look up proxy information for all protocols.
uz: Proksi-server konfiguratsiya qiymatlarini taqdim qiluvchi URL. Rejim “avtomatik“ bo'lsa, bu URL barcha protokollar uchun proksi-server ma'lumotlarini qidirish uchun ishlatiladi.

source: Non-proxy hosts
uz: Proksi bo'lmagan xostlar

source: This key contains a list of hosts which are connected to directly, rather than via the proxy (if it is active). The values can be hostnames, domains (using an initial wildcard like *.foo.com), IP host addresses (both IPv4 and IPv6) and network addresses with a netmask (something like 192.168.0.0/24).
uz: Ushbu kalit to'g'ridan-to'g'ri bog'langan hostlar ro'yxatini o'z ichiga oladi, aksinchaproksi-server orqali ko'ra (agar u faol bo'lsa). Qiymatlar xost nomlari, domenlar bo'lishi mumkin (*.foo.com kabi boshlang'ich wilcard belgidan foydalangan holda), IP xost manzillari (IPv4 va IPv6) va tarmoq maskali tarmoq manzillari (masalan, 192.168.0.0/24).

source: Use HTTP proxy for all protocols
uz: Barcha protokollar uchun HTTP proksi-serveridan foydalaning

source: Whether to use the HTTP proxy for all protocols or not.
uz: Barcha protokollar uchun HTTP proksi-serveridan foydalanish kerakmi yoki yo'qmi.

source: Unused; ignore
uz: Foydalanilmagan; e'tibor bermaslik

source: This key is not used; HTTP proxying is enabled when the host key is non-empty and the port is non-0.
uz: Ushbu kalit ishlatilmaydi; host kaliti bo'lmaganda HTTP proksi-server xizmati yoqiladibo'sh va port 0 emas.

source: HTTP proxy host name
uz: HTTP proksi-xost nomi

source: The machine name to proxy HTTP through.
uz: HTTP orqali proksi-server uchun mashina nomi.

source: HTTP proxy port
uz: HTTP proksi porti

source: The port on the machine defined by “/system/proxy/http/host” that you proxy through.
uz: Mashinadagi port “/system/proxy/http/host“ tomonidan belgilangan proksi-server orqali.

source: Authenticate proxy server connections
uz: Proksi-server ulanishlarini autentifikatsiya qilish

source: If true, then connections to the proxy server require authentication. The username/password combo is defined by “/system/proxy/http/authentication-user” and “/system/proxy/http/authentication-password”. This applies only to the http proxy; when using a separate https proxy, there is currently no way to specify that it should use authentication.
uz: Agar rost bo'lsa, proksi-serverga ulanishlar autentifikatsiyani talab qiladi. foydalanuvchi nomi/parol kombinatsiyasi “/system/proxy/http/authentication-“ bilan belgilanadi.foydalanuvchi va “/system/proxy/http/authentication-password“. Bu uchun amal qiladi.http proksi-server; alohida https proksi-serveridan foydalanganda hozircha hech qanday yo'l yo'qu autentifikatsiyadan foydalanishi kerakligini ko'rsatish uchun.

source: HTTP proxy username
uz: HTTP proksi foydalanuvchi nomi

source: User name to pass as authentication when doing HTTP proxying.
uz: HTTP proksi-serverini amalga oshirishda autentifikatsiya sifatida o'tish uchun foydalanuvchi nomi.

source: HTTP proxy password
uz: HTTP proksi paroli

source: Password to pass as authentication when doing HTTP proxying.
uz: HTTP proksi-serverini amalga oshirishda autentifikatsiya sifatida o'tish uchun parol.

source: Secure HTTP proxy host name
uz: Xavfsiz HTTP proksi-xost nomi

source: The machine name to proxy secure HTTP through.
uz: HTTP orqali himoyalangan proksi-server uchun mashina nomi.

source: Secure HTTP proxy port
uz: Xavfsiz HTTP proksi-porti

source: The port on the machine defined by “/system/proxy/https/host” that you proxy through.
uz: Mashinadagi port “/system/proxy/https/host“ tomonidan belgilangan proksi-server orqali.

source: FTP proxy host name
uz: FTP proksi-xost nomi

source: The machine name to proxy FTP through.
uz: FTP orqali proksi-server uchun mashina nomi.

source: FTP proxy port
uz: FTP proksi porti

source: The port on the machine defined by “/system/proxy/ftp/host” that you proxy through.
uz: Mashinadagi port “/system/proxy/ftp/host“ tomonidan belgilangan proksi-server orqali.

source: SOCKS proxy host name
uz: SOCKS proksi-xost nomi

source: The machine name to use as a SOCKS proxy.
uz: SOCKS proksi sifatida foydalanish uchun mashina nomi.

source: SOCKS proxy port
uz: SOCKS proksi-porti

source: The port on the machine defined by “/system/proxy/socks/host” that you proxy through.
uz: Mashinadagi port “/system/proxy/socks/host“ tomonidan belgilangan proksi-server orqali.
