Repository: nizomovasadbek/i10n
Catalog: gnome/43/gsettings-desktop-schemas.master.po
Languages: uz

source: Results for applications contained in this list will not be displayed when searching.
uz: Ushbu ro'yxatdagi ilovalar uchun natijalar qachon ko'rsatilmaydi

source: List of desktop file IDs for which the associated default-disabled search provider should be enabled
uz: Ish stoli fayli identifikatorlari ro'yxati, ular uchun standart bo'yicha o'chirilgan qidiruvprovayder yoqilgan bo'lishi kerak

source: Results for applications contained in this list will be displayed when searching.
uz: Ushbu ro'yxatdagi ilovalar uchun natijalar qachon ko'rsatiladi

source: List of desktop file IDs for search providers sort order
uz: Qidiruv provayderlarining tartiblash tartibi uchun ish stoli fayl identifikatorlari ro'yxati

source: Results for applications contained in this list will be displayed in the specified order. Results for applications not specified in this list will be displayed last, sorted alphabetically.
uz: Ushbu ro'yxatdagi ilovalar bo'yicha natijalar ko'rsatiladi.belgilangan tartib. Ushbu ro'yxatda ko'rsatilmagan ilovalar uchun natijalar oxirgi ko'rsatilgan, alifbo tartibida tartiblangan.

source: Time before session is considered idle
uz: Seansdan oldingi vaqt bo'sh hisoblanadi

source: The number of seconds of inactivity before the session is considered idle.
uz: Seans oldidan harakatsizlik soniyalar soni bo'sh hisoblanadi.

source: Session type
uz: Seans turi

source: The name of the session to use. Known value is “gnome”.
uz: Foydalanish uchun sessiya nomi. Ma'lum qiymat “gnome”.

source: Sounds for events
uz: Voqealar uchun tovushlar

source: Whether to play sounds on user events.
uz: Foydalanuvchi hodisalarida tovushlarni o'ynatish kerakmi.

source: The XDG sound theme to use for event sounds.
uz: Voqea tovushlari uchun foydalanish uchun XDG tovush mavzusi.

source: Input feedback sounds
uz: Kiritilgan fikr-mulohaza tovushlari

source: Whether to play sounds on input events.
uz: Kirish hodisalarida tovushlarni o'ynatish kerakmi.

source: Allow volume above 100%
uz: 100% dan yuqori ovoz balandligiga ruxsat berish

source: Whether volume can be set above 100%, using software amplification.
uz: Dasturiy ta'minotni kuchaytirish yordamida ovoz balandligini 100% dan o'rnatish mumkinmi.

source: Maximum age for thumbnails in the cache, in days. Set to -1 to disable cleaning.
uz: Keshdagi eskizlarning maksimal yoshi, kunlarda. O'chirish uchun -1 ga o'rnating tozalash.

source: Maximum size of the thumbnail cache, in megabytes. Set to -1 to disable cleaning.
uz: Eskiz keshining maksimal hajmi, megabaytlarda. O'chirish uchun -1 ga o'rnating tozalash.

source: Disable all external thumbnailers
uz: Barcha tashqi eskizlarni o'chirib qo'ying

source: Set to true to disable all external thumbnailer programs, independent on whether they are independently disabled/enabled.
uz: Barcha tashqi eskiz dasturlarini oʻchirish uchun “rost” qiymatini oʻrnating.Ular mustaqil ravishda o'chirilgan/yoqilgan.

source: List of mime-types for which external thumbnailer programs will be disabled
uz: Tashqi eskiz dasturlari o'chirib qo'yiladigan mim-turlar ro'yxati

source: Thumbnails will not be created for files whose mime-type is contained in the list.
uz: Mime-turi faylida mavjud bo'lgan fayllar uchun eskizlar yaratilmaydi.ro'yxat.

source: Switch to workspace 1
uz: Ish maydoni 1 ga o'tish

source: Switch to workspace 2
uz: Ish maydoni 2 ga o'tish

source: Switch to workspace 3
uz: Ish maydoni 3 ga o'tish

source: Switch to workspace 4
uz: Ish maydoni 4 ga o'tish

source: Switch to workspace 5
uz: Ish maydoni 5 ga o'tish

source: Switch to workspace 6
uz: Ish maydoni 6 ga o'tish

source: Switch to workspace 7
uz: Ish maydoni 7 ga o'tish

source: Switch to workspace 8
uz: Ish maydoni 8 ga o'tish

source: Switch to workspace 9
uz: Ish maydoni 9 ga o'tish

source: Switch to workspace 10
uz: Ish maydoni 10 ga o'tish

source: Switch to workspace 11
uz: Ish maydoni 11 ga o'tish

source: Switch to workspace 12
uz: Ish maydoni 12 ga o'tish

source: Switch to workspace left
uz: Chapdagi ish maydoniga o'tish

source: Switch to workspace right
uz: Ish maydoniga o'ng tomonga o'ting

source: Switch to workspace above
uz: Yuqoridagi ish maydoniga o'ting

source: Switch to workspace below
uz: Quyidagi ish maydoniga o'ting

source: Switch to last workspace
uz: Oxirgi ish maydoniga o'tish

source: Switch windows of an application
uz: Ilova oynalarini almashtirish

source: Reverse switch windows of an application
uz: Ilova oynalarini teskari almashtirish

source: Switch applications
uz: Ilovalarni almashtirish

source: Reverse switch applications
uz: Teskari almashtirish ilovalari

source: Switch windows
uz: Oynalarni almashtirish

source: Reverse switch windows
uz: Teskari oynalarni almashtirish

source: Switch system controls
uz: Tizim boshqaruvlarini almashtirish

source: Reverse switch system controls
uz: Teskari o'tish tizimi boshqaruvlari

source: Switch windows of an app directly
uz: Ilova oynalarini to'g'ridan-to'g'ri almashtiring

source: Reverse switch windows of an app directly
uz: Ilova oynalarini to'g'ridan-to'g'ri teskari o'zgartirish

source: Switch windows directly
uz: Oynalarni to'g'ridan-to'g'ri almashtiring

source: Reverse switch windows directly
uz: To'g'ridan-to'g'ri oynalarni teskari o'zgartirish

source: Switch system controls directly
uz: Tizim boshqaruvlarini to'g'ridan-to'g'ri almashtiring

source: Reverse switch system controls directly
uz: Teskari o'tish tizimi to'g'ridan-to'g'ri boshqaradi

source: Hide all normal windows
uz: Barcha oddiy oynalarni yashiring

source: DEPRECATED: This key is deprecated and ignored.
uz: QO'SHILGAN: Bu kalit eskirgan va e'tiborga olinmagan.

source: Show the run command prompt
uz: Ishga tushirish buyruq satrini ko'rsating

source: Don’t use
uz: Foydalanmang

source: Toggle fullscreen mode
uz: Toʻliq ekran rejimiga oʻtish

source: Toggle maximization state
uz: Maksimallashtirish holatini almashtirish

source: Toggle window always appearing on top
uz: O'chirish oynasi har doim tepada paydo bo'ladi

source: Maximize window
uz: Oynani kattalashtirish

source: Restore window
uz: Qayta tiklash oynasi

source: Toggle shaded state
uz: Soyali holatni almashtirish

source: Minimize window
uz: Oynani minimallashtirish

source: Close window
uz: Oynani yoping

source: Move window
uz: Oynani siljitish

source: Resize window
uz: Oyna hajmini o'zgartirish

source: Toggle window on all workspaces or one
uz: Barcha ish joylarida yoki birida oynani almashtirish

source: Move window to workspace 1
uz: Oynani 1-ish maydoniga o'tkazing

source: Move window to workspace 2
uz: Oynani 2-ish maydoniga o'tkazing

source: Move window to workspace 3
uz: Oynani 3-ish maydoniga o'tkazing

source: Move window to workspace 4
uz: Oynani 4-ish maydoniga o'tkazing

source: Move window to workspace 5
uz: Oynani 5-ish maydoniga o'tkazing

source: Move window to workspace 6
uz: Oynani 6-ish maydoniga o'tkazing

source: Move window to workspace 7
uz: Oynani 7-ish maydoniga o'tkazing

source: Move window to workspace 8
uz: Oynani 8-ish maydoniga o'tkazing

source: Move window to workspace 9
uz: Oynani 9-ish maydoniga o'tkazing

source: Move window to workspace 10
uz: Oynani 10-ish maydoniga o'tkazing

source: Move window to workspace 11
uz: Oynani 11-ish maydoniga o'tkazing

source: Move window to workspace 12
uz: Oynani 12-ish maydoniga o'tkazing

source: Move window to last workspace
uz: Oynani oxirgi ish maydoniga o'tkazing

source: Move window one workspace to the left
uz: Oynani bitta ish joyini chapga siljiting

source: Move window one workspace to the right
uz: Oynani bitta ish joyini o'ngga o'tkazing

source: Move window one workspace up
uz: Oynani bir ish joyiga yuqoriga siljiting

source: Move window one workspace down
uz: Oynani bir ish maydoni pastga siljiting

source: Move window to the next monitor on the left
uz: Oynani chap tarafdagi keyingi monitorga o'tkazing

source: Move window to the next monitor on the right
uz: Oynani o'ngdagi keyingi monitorga o'tkazing

source: Move window to the next monitor above
uz: Oynani yuqoridagi keyingi monitorga o'tkazing

source: Move window to the next monitor below
uz: Oynani quyidagi monitorga o'tkazing

source: Raise window if covered, otherwise lower it
uz: Agar oyna yopiq bo'lsa, uni ko'taring, aks holda uni pastga tushiring

source: Raise window above other windows
uz: Oynani boshqa oynalar ustiga ko'taring

source: Lower window below other windows
uz: Boshqa oynalar ostidagi pastki oyna

source: Maximize window vertically
uz: Oynani vertikal ravishda kattalashtirish

source: Maximize window horizontally
uz: Oynani gorizontal ravishda kattalashtirish

source: Move window to top left corner
uz: Oynani yuqori chap burchakka siljiting

source: Move window to top right corner
uz: Oynani yuqori o'ng burchakka o'tkazing

source: Move window to bottom left corner
uz: Oynani pastki chap burchakka siljiting

source: Move window to bottom right corner
uz: Oynani pastki o'ng burchakka siljiting

source: Move window to top edge of screen
uz: Oynani ekranning yuqori chetiga o'tkazing

source: Move window to bottom edge of screen
uz: Oynani ekranning pastki chetiga o'tkazing

source: Move window to right side of screen
uz: Oynani ekranning o'ng tomoniga o'tkazing

source: Move window to left side of screen
uz: Oynani ekranning chap tomoniga o'tkazing

source: Move window to center of screen
uz: Oynani ekran markaziga o'tkazing

source: Switch input source
uz: Kirish manbasini almashtiring

source: Binding to select the next input source
uz: Keyingi kirish manbasini tanlash uchun ulash

source: Switch input source backward
uz: Kirish manbasini orqaga o'zgartiring

source: Binding to select the previous input source
uz: Oldingi kirish manbasini tanlash uchun ulash

source: Toggle window to be always on top
uz: Har doim tepada bo'lish uchun oynani almashtiring

source: Set or unset window to appear always on top
uz: Oyna har doim tepada ko'rinadigan qilib o'rnating yoki o'chiring

source: Modifier to use for modified window click actions
uz: O'zgartirilgan oynani bosish harakatlari uchun ishlatiladigan modifikator

source: Clicking a window while holding down this modifier key will move the window (left click), resize the window (middle click), or show the window menu (right click). The middle and right click operations may be swapped using the “resize-with-right-button” key. Modifier is expressed as “<Alt>” or “<Super>” for example.
uz: Ushbu modifikator tugmachasini bosib turgan holda oynani bosish oynani siljitadi(chap bosish), oyna hajmini o'zgartirish (o'rta bosish) yoki oyna menyusini ko'rsatish (oʻng tugmasini bosish). Oʻrta va oʻng tugmasini bosish amallari yordamida almashtirilishi mumkin.“o'ng tugmasi bilan o'lchamini o'zgartirish“ tugmasi. Modifikator “<Alt>“ yoki sifatida ifodalanadi.Masalan, “<Super>“.

source: Whether to resize with the right button
uz: O'ng tugma bilan o'lchamini o'zgartirish kerakmi

source: Set this to true to resize with the right button and show a menu with the middle button while holding down the key given in “mouse-button-modifier”; set it to false to make it work the opposite way around.
uz: To'g'ri tugma bilan o'lchamini o'zgartirish va menyuni ko'rsatish uchun “rost“ qiymatini o'rnating.“Sichqoncha-tugma-modifikatorida“ berilgan tugmachani bosib ushlab turganda o'rta tugma;Buning teskari ishlashi uchun uni “yolg'on“ ga qo'ying.

source: Arrangement of buttons on the titlebar
uz: Sarlavha satrida tugmachalarning joylashishi

source: Arrangement of buttons on the titlebar. The value should be a string, such as “menu:minimize,maximize,spacer,close”; the colon separates the left corner of the window from the right corner, and the button names are comma-separated. Duplicate buttons are not allowed. Unknown button names are silently ignored so that buttons can be added in future metacity versions without breaking older versions. A special spacer tag can be used to insert some space between two adjacent buttons.
uz: Sarlavha panelidagi tugmachalarning joylashishi. Qiymat satr bo'lishi kerak, shunday Menyu: ”kichraytirish, kattalashtirish, bo'sh joy, yopish” kabi; yo'g'on nuqta chapni ajratib turadi Oynaning o'ng burchagidan va tugma nomlari vergul bilanajratilgan. Takroriy tugmalarga ruxsat berilmaydi. Noma'lum tugma nomlari tugmalar kelajakda metacity versiyalarida qo'shilishi uchun jimgina e'tiborga olinmaydieski versiyalarni buzmasdan. Qo'shish uchun maxsus spacer tegidan foydalanish mumkin ikki qo'shni tugmalar orasidagi bo'sh joy.

source: Window focus mode
uz: Oyna fokus rejimi

source: The window focus mode indicates how windows are activated. It has three possible values; “click” means windows must be clicked in order to focus them, “sloppy” means windows are focused when the mouse enters the window, and “mouse” means windows are focused when the mouse enters the window and unfocused when the mouse leaves the window.
uz: Oyna fokus rejimi oynalar qanday faollashtirilganligini ko'rsatadi. U uchta mumkin bo'lgan qiymatlar; ”bosing” diqqat markazida bo'lish uchun oynalarni bosish kerakligini anglatadi Ular,”beqaror”, sichqoncha oynaga kirganda, oynalar diqqat markazida bo'lishini anglatadi va ”sichqoncha” sichqoncha oynaga kirganda oynalar fokuslanganligini bildiradi va sichqoncha oynadan chiqib ketganda diqqat markazida bo'lmaydi.

source: Control how new windows get focus
uz: Yangi oynalar qanday fokuslanishini boshqaring

source: This option provides additional control over how newly created windows get focus. It has two possible values; “smart” applies the user’s normal focus mode, and “strict” results in windows started from a terminal not being given focus.
uz: Ushbu parametr yangi yaratilgan oynalarni qanday olishini qo'shimcha nazorat qilishni ta'minlaydifokus. Uning ikkita mumkin bo'lgan qiymati bor; ”aqlli” foydalanuvchining oddiy fokusini qo'llaydi rejim va ”qat'iy” natijada oynalar terminaldan ishga tushirilmaydi E'tibor berilgan.

source: Whether windows should be raised when their client area is clicked
uz: Mijoz maydoni bosilganda oynalar ko'tarilishi kerakmi

source: The default, true, indicates that a window will be raised whenever its client area or its frame is clicked. Setting this to false means that a window will not be raised if it is clicked on the client area. To raise it, one can click anywhere in the window’s frame, or Super-click on any part of the window. This mode is useful if one uses many overlapping windows.
uz: Sukut bo'yicha, rost, oyna qachon ko'tarilishini bildiradimijoz maydoni yoki uning ramkasi bosiladi. Buni rostga o'rnatish Agar mijoz maydoniga bosilsa, oyna ko'tarilmaydi. Uni ko'tarish uchun Oyna ramkasining istalgan joyini bosish yoki istalgan qismini Super-bosish qilish mumkin.oyna. Bu rejim bir-birining ustiga chiqadigan ko'plab oynalardan foydalansa foydali bo'ladi.

source: Action on title bar double-click
uz: Sarlavha satridagi amalni ikki marta bosing

source: This option determines the effects of double-clicking on the title bar. Current valid options are “toggle-shade”, which will shade/unshade the window, “toggle-maximize” which will maximize/unmaximize the window, “toggle-maximize-horizontally” and “toggle-maximize-vertically” which will maximize/unmaximize the window in that direction only, “minimize” which will minimize the window, “shade” which will roll the window up, “menu” which will display the window menu, “lower” which will put the window behind all the others, and “none” which will not do anything.
uz: Ushbu parametr sarlavha satriga ikki marta bosish effektlarini aniqlaydi.Hozirgi amaldagi variantlar ”o'zgaruvchan soya”, bu esa oyna, ”almashtirishni-maksimallashtirish”, bu oynani kattalashtiradi/kattalashtirmaydi, ”o'tish-gorizontal ravishda maksimal darajaga ko'tarish” va ”vertikal o'zgartirish-maksimallashtirish” maksimal darajaga yetadi/Faqat shu yo'nalishdagi oynani kattalashtiring, ”kichraytiring” bu esa kichraytiradi oyna, oynani yuqoriga aylantiradigan ”soya”, ko'rsatiladigan ”menyu” oyna menyusi, ”pastki” bu oynani qolganlarning orqasida qo'yadi, va ”yo'q” hech narsa qilmaydi.

source: Action on title bar middle-click
uz: Sarlavha satrida harakat o'rta tugmachani bosing

source: This option determines the effects of middle-clicking on the title bar. Current valid options are “toggle-shade”, which will shade/unshade the window, “toggle-maximize” which will maximize/unmaximize the window, “toggle-maximize-horizontally” and “toggle-maximize-vertically” which will maximize/unmaximize the window in that direction only, “minimize” which will minimize the window, “shade” which will roll the window up, “menu” which will display the window menu, “lower” which will put the window behind all the others, and “none” which will not do anything.
uz: Ushbu parametr sarlavha satriga bosish effektlarini aniqlaydi.Hozirgi amaldagi variantlar ”o'zgaruvchan soya”, bu esa oyna, ”almashtirishni-maksimallashtirish”, bu oynani kattalashtiradi/kattalashtirmaydi, ”gorizantal”kattalashtirishni almashtirish” va ”vertikal kattalashtirishni almashtirish” maksimal darajaga yetadi/Faqat shu yo'nalishdagi oynani kattalashtiring, ”kichraytirish” bu esa kichraytiradi oyna, oynani yuqoriga aylantiradigan ”soya”, ko'rsatiladigan ”menyu” oyna menyusi, ”pastki” bu oynani qolganlarning orqasida qo'yadi, va ”yo'q” hech narsa qilmaydi.

source: Action on title bar right-click
uz: Sarlavha satrida harakat o'ng tugmachani bosing

source: This option determines the effects of right-clicking on the title bar. Current valid options are “toggle-shade”, which will shade/unshade the window, “toggle-maximize” which will maximize/unmaximize the window, “toggle-maximize-horizontally” and “toggle-maximize-vertically” which will maximize/unmaximize the window in that direction only, “minimize” which will minimize the window, “shade” which will roll the window up, “menu” which will display the window menu, “lower” which will put the window behind all the others, and “none” which will not do anything.
uz: Ushbu parametr sarlavha satrida sichqonchaning o'ng tugmachasini bosish effektlarini aniqlaydi.Hozirgi amaldagi variantlar ”o'zgaruvchan soya”, bu esa oyna, ”almashtirishni-maksimallashtirish”, bu oynani kattalashtiradi/kattalashtirmaydi, ”gorizantal”kattalashtirishni almashtirish” va ”vertikal kattalashtirishni almashtirish” maksimal darajaga yetadi/Faqat shu yo'nalishdagi oynani kattalashtiring, ”kichraytirish” bu esa kichraytiradi oyna, oynani yuqoriga aylantiradigan ”soya”, ko'rsatiladigan ”menyu” oyna menyusi, ”pastki” bu oynani qolganlarning orqasida qo'yadi, va ”yo'q” hech narsa qilmaydi.

source: Automatically raises the focused window
uz: Yo'naltirilgan Oynani avtomatik ravishda ko'taradi

source: If set to true, and the focus mode is either “sloppy” or “mouse” then the focused window will be automatically raised after a delay specified by the auto-raise-delay key. This is not related to clicking on a window to raise it, nor to entering a window during drag-and-drop.
uz: Agar rost ga o'rnatilgan bo'lsa va fokus rejimi ”beqaror” yoki ”sichqoncha” bo'lsa, fokuslangan oyna tomonidan belgilangan kechikishdan keyin avtomatik ravishda ko'tariladi.avtomatik ko'tarish-kechikish kaliti. Bu ko'tarish uchun oynani bosish bilan bog'liq emas uni, sudrab olib tashlash paytida oynaga kirish uchun ham.

source: Delay in milliseconds for the auto raise option
uz: Avtomatik ko'tarish opsiyasi uchun millisekundlarda kechikish

source: The time delay before raising a window if auto-raise is set to true. The delay is given in thousandths of a second.
uz: Agar avtomatik ko'tarish rost bo'lsa, oynani ko'tarishdan oldin kechikish vaqti. kechikish soniyaning mingdan bir qismida beriladi.

source: Current theme
uz: Joriy mavzu

source: The theme determines the appearance of window borders, titlebar, and so forth. DEPRECATED: This key is deprecated and ignored.
uz: Mavzu oyna chegaralari, sarlavha paneli va boshqalarning ko'rinishini belgilaydioldinga. QO'SHILGAN: Bu kalit eskirgan va e'tiborga olinmagan.

source: Use standard system font in window titles
uz: Oyna sarlavhalarida standart tizim shriftidan foydalanish

source: If true, ignore the titlebar-font option, and use the standard application font for window titles.
uz: Agar rost bo'lsa, sarlavha paneli-shrift parametriga e'tibor bermang va standart ilovadan foydalaningOyna sarlavhalari uchun shrift.

source: Window title font
uz: Oyna sarlavhasi shrifti

source: A font description string describing a font for window titlebars. The size from the description will only be used if the titlebar-font-size option is set to 0. Also, this option is disabled if the titlebar-uses-desktop-font option is set to true.
uz: Oyna sarlavhalari uchun shriftni tavsiflovchi shrift tavsifi qatori. Hajmi tavsifdan faqat sarlavha satri-shrift o'lchami parametri bo'lsa ishlatiladi0 ga o'rnatildi. Shuningdek, agar sarlavha paneli-ish stoli-shriftdan foydalansa, bu parametr o'chiriladivariant rostga o'rnatildi.

source: Number of workspaces
uz: Ish joylari soni

source: Number of workspaces. Must be more than zero, and has a fixed maximum to prevent making the desktop unusable by accidentally asking for too many workspaces.
uz: Ish joylari soni. Noldan koʻp boʻlishi kerak va belgilangan maksimal tasodifan juda ko'p so'rash orqali ish stolini yaroqsiz holga keltirmaslik

source: System Bell is Audible
uz: Tizim ovozi eshitiladi

source: Determines whether applications or the system can generate audible “beeps”; may be used in conjunction with “visual bell” to allow silent “beeps”.
uz: Ilovalar yoki tizim ovozli ”signallar”ni ishlab chiqarishi mumkinligini aniqlaydiovozsiz ”signallar”ga ruxsat berish uchun ”vizual ovoz” bilan birgalikda ishlatilishi mumkin

source: Enable Visual Bell
uz: Vizual ovozni yoqing

source: Turns on a visual indication when an application or the system issues a “bell” or “beep”; useful for the hard-of-hearing and for use in noisy environments.
uz: Ilova yoki tizim ko'rsatuvini chiqarganda vizual ko'rsatkichni yoqadi”ovoz” yoki ”signallar”; eshitish qiyin bo'lganlar uchun va shovqinli joylarda foydalanish uchun foydali

source: Visual Bell Type
uz: Vizual ovoz turi

source: Tells the WM how to implement the visual indication that the system bell or another application “bell” indicator has been rung. Currently there are two valid values, “fullscreen-flash”, which causes a fullscreen white-black flash, and “frame-flash” which causes the titlebar of the application which sent the bell signal to flash. If the application which sent the bell is unknown (as is usually the case for the default “system beep”), the currently focused window’s titlebar is flashed.
uz: WMga tizim ovozi yoki ko'rgazmali ko'rsatkichni qanday amalga oshirish kerakligini aytadi.Boshqa ilova ”ovoz” indikatori chalindi. Hozir ikkita to'liq qiymatlar, ”to'liq ekran chirog'i”, bu to'liq ekran oq-qora chiroq va ”ramka-chirog'i” ilovaning sarlavha panelini keltirib chiqaradi.ovoz signalini miltillash uchun yubordi. Agar ovozni yuborgan dastur noma'lum (odatda standart ”tizim signali” uchun bo'lgani kabi), Hozirda yo'naltirilgan oynaning sarlavha paneli miltilladi.

source: Disable misfeatures that are required by old or broken applications
uz: Eski yoki buzilgan ilovalar tomonidan talab qilinadigan nosozliklarni o'chiring
