Repository: nizomovasadbek/i10n
Catalog: gnome/43/gvfs.master.po
Languages: uz

source: (invalid encoding)
uz: (kodlash noto'g'ri)

source: / on %s
uz: / %s da

source: Failure
uz: Muvaffaqiyatsizlik

source: Error creating backup file: %s
uz: Zaxira faylini yaratishda xatolik yuz berdi: %s

source: Value out of range, sftp only supports 32bit timestamps
uz: Qiymat diapazondan tashqarida, sftp faqat 32 bitli vaqt belgilarini qo'llab-quvvatlaydi

source: Invalid attribute type (uint64 expected)
uz: Atribut turi yaroqsiz (uint64 kutilmoqda)

source: Internal Error (%s)
uz: Ichki xato (%s)

source: Windows shares on %s
uz: Windows %s orqali ulashadi

source: Failed to retrieve share list from server: %s
uz: Serverdan ulashishlar roʻyxatini olib boʻlmadi: %s

source: Windows Network File System Service
uz: Windows Network fayl tizimi xizmati

source: Authentication Required Enter password for share “%s” on “%s”:
uz: Autentifikatsiya zarur “%s” orqali “%s”ni almashish uchun parolni kiriting:

source: Authentication Required Enter user and password for share “%s” on “%s”:
uz: Autentifikatsiya zarur “%s” orqali “%s” ni ulashish uchun foydalanuvchi va parolni kiriting:

source: Failed to mount Windows share: %s
uz: Windows ulushini oʻrnatib boʻlmadi: %s

source: Backup file creation failed: %s
uz: Zaxira fayl yaratilmadi: %s

source: Can’t rename file, filename already exists
uz: Fayl nomini oʻzgartirib boʻlmadi, fayl nomi allaqachon mavjud

source: Error deleting file: %s
uz: Faylni oʻchirishda xatolik yuz berdi: %s

source: Error moving file: %s
uz: Faylni koʻchirishda xatolik yuz berdi: %s

source: Error removing target file: %s
uz: Maqsadli faylni oʻchirishda xatolik yuz berdi: %s

source: Can’t recursively move directory
uz: Katalogni rekursiv ko'chirish mumkin emas

source: The trash folder may not be deleted
uz: Chiqindi jildi o'chirilmasligi mumkin

source: Items in the trash may not be modified
uz: Chiqindidagi narsalarni o'zgartirib bo'lmaydi

source: Trash
uz: Chiqindi qutisi

source: Channel blocked
uz: Kanal bloklangan

source: The signing certificate authority is not known.
uz: Imzolovchi sertifikat organi noma'lum.

source: The certificate does not match the identity of the site.
uz: Sertifikat sayt identifikatoriga mos kelmaydi.

source: The certificate’s activation time is in the future.
uz: Sertifikatni faollashtirish muddati

source: The certificate has expired.
uz: Sertifikat muddati tugagan.

source: The certificate has been revoked.
uz: Sertifikat bekor qilindi.

source: The certificate’s algorithm is considered insecure.
uz: Sertifikat algoritmi xavfli deb hisoblanadi.

source: Error occurred when validating the certificate.
uz: Sertifikatni tekshirishda xatolik yuz berdi.

source: Yes
uz: Ha

source: No
uz: Yo'q

source: Identity Verification Failed %s %s Are you really sure you would like to continue?
uz: Shaxsni tasdiqlash amalga oshmadi %s %s Davom etishni xohlayotganingizga ishonchingiz komilmi?

source: Unexpected end of stream
uz: Streamning kutilmagan tugashi

source: Invalid reply
uz: Yaroqsiz javob

source: Failed to create active FTP connection. Maybe your router does not support this?
uz: Faol FTP ulanishini yaratib bo'lmadi. Balki routeringiz qo'llab-quvvatlamaydi bu?

source: Failed to create active FTP connection.
uz: Faol FTP ulanishini yaratib bo‘lmadi.

source: Filename contains invalid characters.
uz: Fayl nomi noto‘g‘ri belgilardan iborat.

source: The FTP server is busy. Try again later
uz: FTP server band. Keyinroq qayta urinib ko‘ring

source: Backend currently unmounting
uz: Backend hozirda uzilmoqda

source: Accounts are unsupported
uz: Hisoblar qo‘llab-quvvatlanmaydi

source: Cannot open data connection. Maybe your firewall prevents this?
uz: Maʼlumot ulanishini ochib boʻlmadi. Balki sizning firewallingiz buni oldini oladi?

source: Data connection closed
uz: Maʼlumot ulanishi yopildi

source: Operation failed
uz: Operatsiya muvaffaqiyatsiz tugadi

source: No space left on server
uz: Serverda bo'sh joy qolmadi

source: Unsupported network protocol
uz: Qo'llab-quvvatlanmaydigan tarmoq protokoli

source: Page type unknown
uz: Sahifa turi noma'lum

source: Invalid filename
uz: Fayl nomi noto‘g‘ri

source: Error seeking in stream
uz: Oqimni qidirishda xatolik yuz berdi

source: Filesystem is read-only
uz: Fayl tizimi faqat o'qish uchun mo'ljallangan

source: Symlinks not supported by backend
uz: Symlinks backend tomonidan qo'llab-quvvatlanmaydi

source: Invalid dbus message
uz: Yaroqsiz dbus xabari

source: %s has been unmounted
uz: %s uzildi

source: Unmounting %s Please wait
uz: %s o'chirilmoqda Iltimos kuting

source: Replace old daemon.
uz: Eski daemonni almashtiring.

source: Don’t start fuse.
uz: Fuseni boshlamang

source: Enable debug output.
uz: Nosozliklarni tuzatish chiqishini yoqish.

source: Show program version.
uz: Dastur versiyasini ko'rsatish.

source: GVFS Daemon
uz: GVFS Demon

source: Main daemon for GVFS
uz: GVFS uchun asosiy daemon

source: Try “%s --help” for more information.
uz: Qoʻshimcha maʼlumot olish uchun “%s --help”ni sinab koʻring.

source: Automount failed: %s
uz: Avtomatik oʻrnatib boʻlmadi: %s

source: The specified location is not mounted
uz: Belgilangan joy o'rnatilmagan

source: The specified location is not supported
uz: Belgilangan joylashuv qo'llab-quvvatlanmaydi

source: Location is already mounted
uz: Joylashuv allaqachon o'rnatilgan

source: Location is not mountable
uz: Joylashuvni o'rnatish mumkin emas

source: Perform file operations
uz: Fayl operatsiyalarini bajarish

source: Authentication is required to run gvfsd-admin daemon
uz: Gvfsd-admin daemonini ishga tushirish uchun autentifikatsiya talab qilinadi

source: Authentication is required to perform file operations
uz: Fayl operatsiyalarini bajarish uchun autentifikatsiya talab qilinadi

source: Can’t find metadata file %s
uz: %s metadata fayli topilmadi

source: Unable to set metadata key
uz: Metamaʼlumotlar kalitini oʻrnatib boʻlmadi

source: Unable to unset metadata key
uz: Metamaʼlumotlar kalitini oʻchirib boʻlmadi

source: Unable to remove metadata keys
uz: Metamaʼlumotlar kalitlarini o'chirib boʻlmadi

source: Unable to move metadata keys
uz: Metamaʼlumotlar kalitlarini koʻchirib boʻlmadi

source: Metadata daemon for GVFS
uz: GVFS uchun metadata daemoni

source: Failed to get org.gnome.OnlineAccounts.Files for %s
uz: %s uchun org.gnome.OnlineAccounts.Files faylini olib bo‘lmadi

source: Invalid credentials for %s
uz: %s uchun hisob maʼlumotlari notoʻgʻri

source: Unsupported authentication method for %s
uz: %s uchun autentifikatsiya usuli qo‘llab-quvvatlanmaydi

source: The given mount was not found
uz: Berilgan o'rnatish topilmadi

source: An operation is already pending
uz: Operatsiya allaqachon kutilmoqda

source: No outstanding mount operation
uz: Ajoyib o'rnatish operatsiyasi yo'q

source: The given volume was not found
uz: Berilgan hajm topilmadi

source: The given drive was not found
uz: Berilgan disk topilmadi

source: Unnamed Drive (%s)
uz: Nomsiz disk (%s)

source: Unnamed Drive
uz: Nomsiz disk

source: Failed to eject medium; one or more volumes on the medium are busy.
uz: Muhitni chiqarib bo'lmadi; muhitda bir yoki bir nechta jild band.

source: One or more programs are preventing the unmount operation.
uz: Bir yoki bir nechta dastur o'chirish jarayoniga to'sqinlik qilmoqda.

source: Eject Anyway
uz: Baribir chiqarib tashlang

source: Operation not supported by backend
uz: Operatsiya backend tomonidan qo'llab-quvvatlanmaydi

source: Timed out running command-line “%s”
uz: “%s” buyruq qatorini ishga tushirish vaqti tugadi

source: Unmounting %s Disconnecting from filesystem.
uz: %s o'chirilmoqda Fayl tizimidan uzilish.

source: Writing data to %s Device should not be unplugged.
uz: %s ga ma'lumotlar yozilmoqda Qurilmani elektr tarmog'idan uzib qo'ymaslik kerak.

source: %s unmounted Filesystem has been disconnected.
uz: %s uzildi Fayl tizimi uzildi.

source: %s can be safely unplugged Device can be removed.
uz: %s-ni elektr tarmog'idan xavfsiz ravishda uzib qo'yish mumkin Qurilmani olib tashlash mumkin.

source: %s Possibly Encrypted
uz: %s Shifrlangan boʻlishi mumkin

source: %s Encrypted
uz: %s shifrlangan

source: %s Volume
uz: %s Hajmi

source: Volume
uz: Hajmi

source: Error storing passphrase in keyring (%s)
uz: Parol iborasini kalitlarga saqlashda xatolik yuz berdi (%s)

source: Error deleting invalid passphrase from keyring (%s)
uz: Kalitlikdan noto‘g‘ri parolni o‘chirishda xatolik yuz berdi (%s)

source: The unlocked device does not have a recognizable file system on it
uz: Qulfdan chiqarilgan qurilmada taniqli fayl tizimi mavjud emas

source: Encryption passphrase for %s
uz: %s uchun shifrlash paroli

source: A passphrase is required to access the volume
uz: Bo'limga o'tish uchun parol talab etiladi

source: Authentication Required A passphrase is needed to access encrypted data on “%s”. The volume might be a VeraCrypt volume as it contains random data.
uz: Autentifikatsiya zarur “%s” shifrlangan maʼlumotlarga kirish uchun parol iborasi zarur. hajm VeraCrypt hajmi bo'lishi mumkin, chunki u tasodifiy ma'lumotlarni o'z ichiga oladi.

source: Authentication Required A passphrase is needed to access encrypted data on “%s”.
uz: Autentifikatsiya zarur “%s” da shifrlangan maʼlumotlarga kirish uchun parol kerak.

source: GVfs UDisks2 Volume Monitor
uz: GVfs UDisks2 hajm monitori
