Repository: nizomovasadbek/i10n
Catalog: gnome/43/gvfs.master.po
Languages: uz

source: Operation not supported, files on different mounts
uz: Amaliyot qo'llab-quvvatlanmaydi, fayllar turli xil o'rnatishlarda"

source: Couldn’t get stream file descriptor
uz: Oqim fayli deskriptorini olib bo‘lmadi

source: Didn’t get stream file descriptor
uz: Oqim fayli deskriptori olinmadi

source: Invalid return value from %s
uz: %s dan noto‘g‘ri qaytish qiymati

source: Could not find enclosing mount
uz: Qoplovchi moslama topilmadi

source: Invalid filename %s
uz: %s fayl nomi noto‘g‘ri

source: Error setting file metadata: %s
uz: Fayl metamaʼlumotlarini sozlashda xatolik yuz berdi: %s

source: can’t open metadata tree
uz: metadata daraxtini ochib bo'lmaydi

source: can’t get metadata proxy
uz: metadata proksi-serverini ololmaydi

source: values must be string or list of strings
uz: qiymatlar satr yoki satrlar ro'yxati bo'lishi kerak

source: Error in stream protocol: %s
uz: Oqim protokolida xatolik: %s

source: End of stream
uz: Oqim oxiri

source: Operation was cancelled
uz: Operatsiya bekor qilindi

source: Seek not supported on stream
uz: Translatsiyada qidiruv qo‘llab-quvvatlanmaydi

source: Truncate not supported on stream
uz: Oqimda kesish qo‘llab-quvvatlanmaydi

source: Error while getting mount info: %s
uz: Oʻrnatish haqida maʼlumot olishda xatolik yuz berdi: %s

source: Permission denied
uz: Ruxsat berilmadi

source: Invalid file info format
uz: Fayl maʼlumot formati notoʻgʻri

source: Error initializing Avahi: %s
uz: Avahini ishga tushirishda xatolik yuz berdi: %s

source: Error resolving “%s” service “%s” on domain “%s”
uz: “%s” domenidagi “%s” xizmatini hal qilishda xatolik yuz berdi.

source: Error resolving “%s” service “%s” on domain “%s”. One or more TXT records are missing. Keys required: “%s”.
uz: “%s” domenidagi “%s” xizmati “%s”ni hal qilishda xatolik yuz berdi. Bir yoki bir nechta TXT yozuvlariyo'q. Kalitlar kerak: “%s”.

source: Timed out resolving “%s” service “%s” on domain “%s”
uz: “%s” domenida “%s” xizmatini hal qilish vaqti tugadi

source: Error initializing Avahi resolver
uz: Avahi yechimini ishga tushirishda xatolik yuz berdi

source: Malformed DNS-SD encoded_triple “%s”
uz: Noto'g'ri tuzilgan DNS-SD encoded_triple “%s”

source: Can’t handle version %d of GVfsIcon encoding
uz: GVfsIcon kodlashning %d versiyasini ishlatib bo‘lmaydi

source: Malformed input data for GVfsIcon
uz: GVfsIcon uchun noto'g'ri kiritilgan ma'lumotlar

source: %s File System Service
uz: %s fayl tizimi xizmati

source: Error: %s
uz: Xato: %s

source: Usage: %s --spawner dbus-id object_path
uz: Foydalanish: %s --spawner dbus-id object_path

source: Usage: %s key=value key=value …
uz: Foydalanish: %s key=value key=value …

source: No mount type specified
uz: O'rnatish turi ko'rsatilmagan

source: mountpoint for %s already running
uz: %s uchun ulanish nuqtasi allaqachon ishlayotgan

source: error starting mount daemon
uz: Mount demonini ishga tushirishda xato

source: The connection is not opened
uz: Ulanish ochilmagan

source: The connection is closed
uz: Ulanish yopiq

source: Host closed connection
uz: Xost yopiq ulanish

source: Connection unexpectedly went down
uz: Ulanish kutilmaganda uzilib qoldi

source: Got unexpected end of stream
uz: Oqim kutilmaganda tugadi

source: The server doesn’t support passwords longer than %d character.
uz: Server %d belgidan uzunroq parollarni qo‘llab-quvvatlamaydi.

source: An invalid username was provided.
uz: Yaroqsiz foydalanuvchi nomi berilgan.

source: Unable to login to the server “%s” with the given password.
uz: Berilgan parol bilan “%s” serveriga kirib bo‘lmadi.

source: Unable to connect to the server “%s”. A communication problem occurred.
uz: “%s” serveriga ulanib bo‘lmadi. Aloqa muammosi yuz berdi.

source: Unable to connect to the server “%s” with the given password.
uz: Berilgan parol bilan “%s” serveriga ulanib bo‘lmadi.

source: The server “%s” doesn’t support anonymous access.
uz: “%s” serveri anonim kirishni qo‘llab-quvvatlamaydi.

source: Unable to connect to the server “%s”. No suitable authentication mechanism was found.
uz: “%s” serveriga ulanib bo‘lmadi. Tegishli autentifikatsiya mexanizmi yo‘q topildi.

source: Unable to connect to the server “%s”. The server doesn’t support AFP version 3.0 or later.
uz: “%s” serveriga ulanib bo‘lmadi. Server AFP versiyasini qo‘llab-quvvatlamaydi 3.0 yoki undan keyingi.

source: Permission denied.
uz: Ruxsat berilmadi.

source: The command is not supported by the server.
uz: Buyruq server tomonidan qo'llab-quvvatlanmaydi.

source: Your password has expired.
uz: Parolingiz muddati tugagan.

source: Your password needs to be changed.
uz: Parolingiz o'zgartirilishi kerak.

source: Authentication Required Enter password for “%s” on “%s”:
uz: Autentifikatsiya zarur “%s” uchun “%s” parolini kiriting:

source: Authentication Required Enter user and password for “%s”:
uz: Autentifikatsiya zarur “%s” uchun foydalanuvchi va parolni kiriting:

source: The password prompt was cancelled.
uz: Parol so'rovi bekor qilindi.

source: Unable to disconnect from the server.
uz: Serverdan uzib bo'lmadi.

source: Unable to connect to the server. A communication problem occurred.
uz: Serverga ulanish imkonsiz. Aloqa muammosi yuz berdi.

source: Identification not found.
uz: Identifikatsiya topilmadi.

source: Got error “%s” from server
uz: Serverdan “%s” xatosi oldi

source: Got unknown error code %d from server
uz: Serverdan %d nomaʼlum xato kodi oldi

source: Volume doesn’t exist
uz: Hajmi mavjud emas

source: Couldn’t load %s on %s
uz: %s ni %sga yuklab bo‘lmadi

source: File doesn’t exist
uz: Fayl mavjud emas

source: File is directory
uz: Fayl - bu katalog

source: Too many files open
uz: Juda koʻp fayllar ochiq

source: Target file is open
uz: Maqsadli fayl ochiq

source: Directory not empty
uz: Jild bo'sh emas

source: Target object is marked as not deletable (DeleteInhibit)
uz: Maqsadli obyekt o'chirilmaydi deb belgilangan (DeleteInhibit)

source: Target object doesn’t exist
uz: Maqsadli obyekt mavjud emas

source: Volume is read-only
uz: Jild faqat o'qish uchun

source: Not enough space on volume
uz: Hajmi yetarli emas bo'sh joy

source: Target file already exists
uz: Maqsadli fayl allaqachon mavjud

source: Ancestor directory doesn’t exist
uz: Ajdodlar katalogi mavjud emas

source: Volume is flat and doesn’t support directories
uz: Hajmi tekis va kataloglarni qo'llab-quvvatlamaydi

source: Target directory already exists
uz: Maqsadli katalog allaqachon mavjud

source: Can’t rename volume
uz: Disk qismini nomini o'zgartirib bo'lmaydi

source: Object with that name already exists
uz: Bunday nomdagi obyekt allaqachon mavjud

source: Target object is marked as not renameable (RenameInhibit)
uz: Maqsadli ob'ekt nomini o'zgartirib bo'lmaydigan deb belgilangan (RenameInhibit)

source: Can’t move directory into one of its descendants
uz: Katalogni uning avlodlaridan biriga ko'chirib bo'lmaydi

source: Can’t move sharepoint into a shared directory
uz: Shartnoma nuqtasini umumiy katalogga koʻchirib boʻlmadi

source: Can’t move a shared directory into the Trash
uz: Umumiy katalogni axlat qutisiga koʻchirib boʻlmaydi

source: Object being moved is marked as not renameable (RenameInhibit)
uz: Ko'chirilayotgan obyekt nomini o'zgartirib bo'lmaydi deb belgilangan (RenameInhibit)

source: Object being moved doesn’t exist
uz: Ko‘chirilayotgan obyekt mavjud emas

source: Server doesn’t support the FPCopyFile operation
uz: Server FPCopyFile operatsiyasini qo'llab-quvvatlamaydi

source: Unable to open source file for reading
uz: Oʻqish uchun manba faylini ochib boʻlmadi

source: Source file and/or destination directory doesn’t exist
uz: Manba fayli va/yoki maqsadli katalog mavjud emas

source: Source file is a directory
uz: Manba fayli katalogdir

source: Range lock conflict exists
uz: Diapazonni qulflashda ziddiyat mavjud

source: Directory doesn’t exist
uz: Katalog mavjud emas

source: Target object is not a directory
uz: Maqsadli obyekt katalog emas

source: File is not open for write access
uz: Fayl yozish uchun ochiq emas

source: File is locked by another user
uz: Fayl boshqa foydalanuvchi tomonidan bloklangan

source: File is not open for read access
uz: Fayl o'qish uchun ochiq emas

source: Operation not supported
uz: Operatsiya qo'llab-quvvatlanmaydi

source: Invalid mount spec
uz: Noto'g'ri o'rnatish spetsifikatsiyasi

source: Internal Apple File Control error
uz: Ichki Apple File Control xatosi

source: The device did not respond
uz: Qurilma javob bermadi

source: The connection was interrupted
uz: Aloqa uzildi

source: Invalid Apple File Control data received
uz: Yaroqsiz Apple File Control maʼlumotlari qabul qilindi

source: Unhandled Apple File Control error (%d)
uz: Ishlov berilmagan Apple File Control xatosi (%d)

source: Listing applications installed on device failed
uz: Qurilmaga oʻrnatilgan ilovalarni roʻyxatga kiritib boʻlmadi

source: Accessing application icons on device failed
uz: Qurilmadagi ilova iconlariga kirish amalga oshmadi

source: Lockdown Error: Invalid Argument
uz: Bloklash xatosi: noto'g'ri argument

source: The device is password protected
uz: Qurilma parol bilan himoyalangan

source: Unable to connect
uz: Ulanib bo‘lmadi

source: User refused to trust this computer
uz: Foydalanuvchi ushbu kompyuterga ishonishdan bosh tortdi

source: The user has not trusted this computer
uz: Foydalanuvchi bu kompyuterga ishonmagan

source: Unhandled Lockdown error (%d)
uz: Ishlov berilmagan blokirovka xatosi (%d)

source: libimobiledevice Error: Invalid Argument
uz: libimobiledevice xatosi: noto'g'ri argument

source: libimobiledevice Error: No device found. Make sure usbmuxd is set up correctly.
uz: libimobiledevice xatosi: hech qanday qurilma topilmadi. usbmuxd sozlanganligiga ishonch hosil qiling to'g'ri.

source: Unhandled libimobiledevice error (%d)
uz: Ishlov berilmagan libimobiledevice xatosi (%d)

source: Try again
uz: Qayta urinib ko'ring

source: Cancel
uz: Bekor qilish

source: Invalid AFC location: must be in the form of afc://uuid:port-number
uz: AFC joylashuvi noto‘g‘ri: afc://uuid:port-number shaklida bo‘lishi kerak

source: Apple Mobile Device
uz: Apple mobil qurilmasi

source: Apple Mobile Device, Jailbroken
uz: Apple mobil qurilmasi, Jailbroken

source: Documents on Apple Mobile Device
uz: Apple mobil qurilmasidagi hujjatlar

source: Documents on %s
uz: Hujjatlar %s

source: Device Locked The device “%s” is locked. Enter the passcode on the device and click “Try again”.
uz: Qurilma qulflangan “%s” qurilmasi qulflangan. Qurilmadagi parolni kiriting va ”Qayta urinib ko'ring” tugmasini bosing.

source: Untrusted Device The device “%s” is not trusted yet. Select “Trust” on the device and click “Try again”.
uz: Ishonchsiz qurilma “%s” qurilmasi hali ishonchli emas. Qurilmada ”Ishonch” ni tanlang va ”Qayta urinish” tugmasini bosing.

source: Can’t open directory
uz: Katalogni ochib bo'lmadi

source: Backups not supported
uz: Zaxira nusxalari qo'llab-quvvatlanmaydi

source: Unsupported seek type
uz: Qo'llab-quvvatlanmaydigan qidiruv turi

source: Not a mountable file
uz: Oʻrnatish mumkin boʻlmagan fayl

source: No hostname specified
uz: Xost nomi belgilanmagan

source: Apple Filing Protocol Service
uz: Apple Filing Protocoli xizmati

source: Can’t copy directory over directory
uz: Katalogdan katalogdan nusxa olib bo‘lmaydi

source: Can’t recursively copy directory
uz: Katalogdan rekursiv nusxa ko'chirish mumkin emas

source: Can’t move directory over directory
uz: Katalogni katalog ustiga ko‘chirib bo‘lmaydi

source: Unable to create temporary file (%s)
uz: Vaqtinchalik fayl yaratib boʻlmadi (%s)

source: The file was externally modified
uz: Fayl tashqaridan o'zgartirildi

source: Invalid attribute type (uint32 expected)
uz: Atribut turi yaroqsiz (uint32 kutilmoqda)

source: %s for %s on %s
uz: %s uchun %s uchun %s

source: No volume specified
uz: Hajmi belgilanmagan

source: / in %s
uz: / %s ichida

source: The file is not a directory
uz: Fayl katalog emas

source: Burn
uz: Kuyish

source: Unable to create temporary directory
uz: Vaqtinchalik katalog yaratib bo‘lmadi

source: No such file or directory
uz: Bunday Fayl yoki katalog mavjud emas

source: Can’t copy file over directory
uz: Faylni katalogga nusxalash mumkin emas

source: CD/DVD Creator
uz: CD/DVD yaratuvchisi

source: File exists
uz: Fayl mavjud

source: Target file exists
uz: Maqsadli fayl mavjud

source: File system is busy
uz: Fayl tizimi band

source: Unmount Anyway
uz: Baribir oʻchirish

source: Volume is busy One or more applications are keeping the volume busy.
uz: Hajmi band Bir yoki bir nechta dastur hajmini band qilmoqda.

source: Cannot create gudev client
uz: gudev mijozini yaratib bo'lmadi

source: No drive specified
uz: Hech qanday drive belgilanmagan

source: Cannot find drive %s
uz: %s diskini topib bo‘lmadi

source: Drive %s does not contain audio files
uz: %s diskida audio fayllar mavjud emas

source: cdda mount on %s
uz: %s da cdda oʻrnatish

source: Audio Disc
uz: Audio disk

source: File system is busy: %d open file
uz: Fayl tizimi band: %d fayl ochiq

source: No such file %s on drive %s
uz: %s diskida bunday %s fayli yo‘q

source: Error from “paranoia” on drive %s
uz: %s diskidagi “paranoia” xatosi

source: Error seeking in stream on drive %s
uz: %s diskidagi oqimni qidirishda xatolik yuz berdi

source: No such file
uz: Bunday fayl yo'q

source: The file does not exist or isn’t an audio track
uz: Fayl mavjud emas yoki audio trek emas

source: Audio CD File System Service
uz: Audio CD fayl tizimi xizmati

source: Computer
uz: Kompyuter

source: File System
uz: Fayl tizimi

source: Can’t open mountable file
uz: Oʻrnatish mumkin boʻlgan faylni ochib boʻlmadi

source: Internal error: %s
uz: Ichki xato: %s

source: Can’t mount file
uz: Faylni ulab bo'lmadi

source: No medium in the drive
uz: Driveda vosita yo'q

source: Can’t unmount file
uz: Faylni uzib boʻlmadi

source: Can’t eject file
uz: Faylni chiqarib boʻlmadi

source: Can’t start drive
uz: Diskni ishga tushirib bo'lmadi

source: Can’t stop drive
uz: Driveni to'xtatib bo'lmaydi

source: Can’t poll file
uz: Soʻrov faylini olib boʻlmadi

source: HTTP Error: %s
uz: HTTP xatosi: %s

source: Could not parse response
uz: Javobni tahlil qilib bo‘lmadi

source: Empty response
uz: Bo'sh javob

source: Unexpected reply from server
uz: Serverdan kutilmagan javob

source: Response invalid
uz: Javob yaroqsiz

source: Authentication Required Enter password for “%s”:
uz: Autentifikatsiya zarur “%s” uchun parolni kiriting:

source: Authentication Required Enter proxy password:
uz: Autentifikatsiya zarur Proksi-server parolini kiriting:

source: Could not find an enclosing directory
uz: Yopuvchi katalog topilmadi

source: Not a WebDAV enabled share
uz: WebDAV yoqilgan ulashish emas

source: Could not create request
uz: So‘rovni yaratib bo‘lmadi

source: Backup file creation failed
uz: Zaxira fayl yaratilmadi

source: Can’t move over directory
uz: Katalog boʻylab harakatlanib boʻlmaydi

source: Local Network
uz: Mahalliy tarmoq

source: Can’t monitor file or directory.
uz: Fayl yoki katalogni kuzatib bo'lmaydi.

source: Network
uz: Tarmoq

source: Password dialog cancelled
uz: Parol bilan muloqot oynasi bekor qilindi

source: Insufficient permissions
uz: Ruxsatlar yetarli emas

source: Can’t move file over directory
uz: Faylni katalogga ko‘chirib bo‘lmaydi

source: Error moving file/folder
uz: Fayl/jildni ko‘chirishda xatolik yuz berdi

source: Shared with me
uz: Men bilan baham ko'rildi

source: Shared drives
uz: Umumiy disklar

source: Error getting data from file
uz: Fayldan maʼlumotlarni olishda xatolik yuz berdi

source: Target file is not a regular file
uz: Maqsadli fayl oddiy fayl emas

source: Invalid reply received
uz: Noto'g'ri javob qabul qilindi

source: File is not a regular file
uz: Fayl oddiy fayl emas

source: Target file is a directory
uz: Maqsadli fayl - bu katalog

source: Error writing file
uz: Fayl yozishda xatolik yuz berdi

source: %s: %d: Directory or file exists
uz: %s: %d: Katalog yoki fayl mavjud

source: %s: %d: No such file or directory
uz: %s: %d: Bunday fayl yoki katalog yo‘q

source: %s: %d: Invalid filename
uz: %s: %d: fayl nomi noto‘g‘ri

source: %s: %d: Not Supported
uz: %s: %d: Qo‘llab-quvvatlanmaydi

source: Digital Camera (%s)
uz: Raqamli kamera (%s)

source: Couldn’t find matching udev device.
uz: Mos keladigan udev qurilmasi topilmadi.

source: Cannot create gphoto2 context
uz: gphoto2 kontekstini yaratib bo'lmadi

source: Error creating camera
uz: Kamera yaratishda xatolik yuz berdi

source: Error loading device information
uz: Qurilma maʼlumotlarini yuklashda xatolik yuz berdi

source: Error looking up device information
uz: Qurilma maʼlumotlarini qidirishda xatolik yuz berdi

source: Error getting device information
uz: Qurilma maʼlumotlarini olishda xatolik yuz berdi

source: Error setting up camera communications port
uz: Kamera aloqa portini sozlashda xatolik yuz berdi

source: Error initializing camera
uz: Kamerani ishga tushirishda xatolik yuz berdi

source: gphoto2 mount on %s
uz: gphoto2 %s qurilmasiga oʻrnatiladi

source: No camera specified
uz: Hech qanday kamera belgilanmagan

source: Error creating file object
uz: Fayl obyektini yaratishda xatolik yuz berdi

source: Error getting file
uz: Faylni olishda xatolik yuz berdi

source: Malformed icon identifier “%s”
uz: “%s” identifikatori noto‘g‘ri

source: Error seeking in stream on camera %s
uz: %s kamerasida oqimni qidirishda xatolik yuz berdi

source: Not a directory
uz: Katalog emas

source: Failed to get folder list
uz: Jildlar roʻyxatini olib boʻlmadi

source: Failed to get file list
uz: Fayllar roʻyxatini olib boʻlmadi

source: Error creating directory
uz: Katalog yaratishda xatolik yuz berdi

source: Name already exists
uz: Nom allaqachon mavjud

source: New name too long
uz: Yangi nom juda uzun

source: Error renaming directory
uz: Katalog nomini o‘zgartirishda xatolik yuz berdi

source: Error renaming file
uz: Fayl nomini oʻzgartirishda xatolik yuz berdi

source: Directory “%s” is not empty
uz: “%s” katalogi bo‘sh emas

source: Error deleting directory
uz: Katalogni oʻchirishda xatolik yuz berdi

source: Error deleting file
uz: Faylni oʻchirishda xatolik yuz berdi

source: Can’t write to directory
uz: Katalogga yozish mumkin emas

source: Cannot allocate new file to append to
uz: Qo'shish uchun yangi faylni ajratib bo'lmadi

source: Cannot read file to append to
uz: Qo'shish uchun faylni o'qib bo'lmaydi

source: Cannot get data of file to append to
uz: Qo'shish uchun fayl ma'lumotlarini olish imkonsiz

source: Not supported (not same directory)
uz: Qo'llab-quvvatlanmaydi (bir xil katalog emas)

source: Not supported (the source is a directory, the destination is a directory too)
uz: Qo'llab-quvvatlanmaydi (manba - katalog, maqsad ham katalog)

source: Not supported (the source is a directory, but the destination is an existing file)
uz: Qo'llab-quvvatlanmaydi (manba - katalog, lekin maqsad mavjudfayl)

source: Not supported (the source is a file, but the destination is a directory)
uz: Qo'llab-quvvatlanmaydi (manba fayl, lekin maqsad katalogdir)

source: HTTP Client Error: %s
uz: HTTP mijoz xatosi: %s

source: Directory notification not supported
uz: Katalog xabarnomasi qo'llab-quvvatlanmaydi

source: Storage (%X)
uz: Xotira (%X)

source: Unknown error.
uz: Noma'lum xato.

source: libmtp error: %s
uz: libmtp xatosi: %s

source: No device specified
uz: Hech qanday qurilma belgilanmagan

source: No MTP devices found
uz: Hech qanday MTP qurilmasi topilmadi

source: Unable to connect to MTP device
uz: MTP qurilmasiga ulanib bo'lmadi

source: Unable to allocate memory while detecting MTP devices
uz: MTP qurilmalarini aniqlashda xotirani ajratib bo'lmadi

source: Generic libmtp error
uz: Umumiy libmtp xatosi

source: Unable to open MTP device “%03u,%03u”
uz: “%03u,%03u” MTP qurilmasini ochib bo‘lmadi

source: Device not found
uz: Qurilma topilmadi

source: File not found
uz: Fayl topilmadi

source: Target is a directory
uz: Maqsad - bu katalog

source: Can’t merge directories
uz: Kataloglarni birlashtirib bo'lmaydi

source: Cannot make directory in this location
uz: Bu joyda katalog yaratib bo‘lmaydi

source: Not a regular file
uz: Oddiy fayl emas

source: Cannot write to this location
uz: Bu manzilga yozish mumkin emas

source: No thumbnail for entity “%s”
uz: “%s” obyekti uchun eskiz yo‘q

source: File Sharing
uz: Fayl almashish

source: Remote Login
uz: Masofadan kirish

source: Windows Network
uz: Windows tarmog'i

source: Network Location Monitor
uz: Tarmoq joylashuvi monitori

source: Mount point does not exist
uz: O'rnatish nuqtasi mavjud emas

source: Permission denied: Perhaps this host is disallowed or a privileged port is needed
uz: Ruxsat rad etildi: Ehtimol, bu xostga ruxsat berilmagan yoki imtiyozli portkerak

source: Unable to create temporary file
uz: Vaqtinchalik fayl yaratib bo‘lmadi

source: Invalid attribute type
uz: Atribut turi yaroqsiz

source: The recent folder may not be deleted
uz: Oxirgi jild o'chirilmasligi mumkin

source: Recent
uz: Yaqinda

source: Connection failed
uz: Ulanish amalga oshmadi

source: Hostname not known
uz: Xost nomi noma'lum

source: No route to host
uz: Xostga yo'l yo'q

source: Connection refused by server
uz: Ulanish server tomonidan rad etildi

source: Host key verification failed
uz: Xost kaliti tasdiqlanmadi

source: Too many authentication failures
uz: Haqiqiylikni tekshirishda xatolik yuz berdi

source: Unable to spawn SSH program
uz: SSH dasturini yaratib bo'lmadi

source: Unable to spawn SSH program: %s
uz: SSH dasturini yaratish imkonsiz: %s

source: Timed out when logging in
uz: Tizimga kirish vaqti tugadi

source: Log In Anyway
uz: Tizimga kiring

source: Cancel Login
uz: Kirishni bekor qilish

source: Login dialog cancelled
uz: Kirish dialogi bekor qilindi

source: Can’t send host identity confirmation
uz: Xost identifikatori tasdiqlovini yuborib bo‘lmadi

source: Authentication Required Enter passphrase for secure key for “%s” on “%s”:
uz: Autentifikatsiya zarur “%s” da “%s” uchun xavfsiz kalit uchun parol iborasini kiriting:

source: Authentication Required Enter passphrase for secure key for “%s”:
uz: Autentifikatsiya zarur “%s” uchun xavfsiz kalit uchun parol iborasini kiriting:

source: Can’t send password
uz: Parol yuborilmadi

source: Enter verification code for %s on %s
uz: %s da %s uchun tasdiqlash kodini kiriting

source: Enter verification code for %s
uz: %s uchun tasdiqlash kodini kiriting

source: Identity Verification Failed Verifying the identity of “%s” failed, this happens when you log in to a computer the first time. The identity sent by the remote computer is “%s”. If you want to be absolutely sure it is safe to continue, contact the system administrator.
uz: Shaxsni tasdiqlash amalga oshmadi “%s” identifikatorini tekshirish amalga oshmadi, bu siz tizimga kirganingizda sodir bo'ladikompyuter birinchi marta. Masofaviy kompyuter tomonidan yuborilgan identifikator “%s”. Agar bo'lishni istasangiz Davom etish xavfsiz ekanligiga ishonchingiz komil, tizim administratoriga murojaat qiling.

source: Identity Verification Failed The host key for “%s” differs from the key for the IP address “%s” If you want to be absolutely sure it is safe to continue, contact the system administrator.
uz: Shaxsni tasdiqlash amalga oshmadi “%s” uchun xost kaliti “%s” IP manzili kalitidan farq qiladi Agar davom etish xavfsiz ekanligiga ishonch hosil qilishni istasangiz, tizim bilan bog'laning

source: The connection is closed (the underlying SSH process exited)
uz: Ulanish yopildi (asosiy SSH jarayoni tugadi)

source: Internal error: Unknown Error
uz: Ichki xato: noma'lum xato

source: Protocol error
uz: Protokol xatosi

source: Unable to find supported SSH command
uz: Qo'llab-quvvatlanadigan SSH buyrug'ini topib bo'lmadi

source: Unknown reason
uz: Noma'lum sabab
