Repository: nizomovasadbek/i10n
Catalog: gnome/43/hitori.main.po
Languages: uz

source: Play the Hitori puzzle game
uz: Hitori jumboq o'yinini o'ynang

source: puzzle;game;logic;grid;
uz: boshqotirma;o‘yin;mantiq;to‘r;

source: Hitori is a logic game similar to the popular game of Sudoku.
uz: Hitori - mashhur sudoku o'yiniga o'xshash mantiqiy o'yin.

source: You play the game against the clock, aiming to eliminate all the duplicate numbers in each row and column in the fastest time. Multiple sizes of game board are supported, and you can place markers on cells to help work out the solution. If you get stuck, the game can give you a hint.
uz: Siz barcha dublikatlarni yo'q qilishni maqsad qilib, soatga qarshi o'ynaysizHar bir satr va ustundagi raqamlar eng tez vaqtda. O'yinning bir nechta o'lchamlari taxta qo'llab-quvvatlanadi va siz hujayralarga markerlarni joylashtirishingiz mumkinYechim. Agar qiynalib qolsangiz, o'yin sizga maslahat berishi mumkin.

source: The GNOME Project
uz: GNOME loyihasi

# shortcut window
source: Start a new game
uz: Yangi o'yinni boshlang

# shortcut window
source: Tag a cell
uz: Hujayrani belgilang

# shortcut window
source: Undo your last move
uz: Oxirgi harakatingizni bekor qiling

# shortcut window
source: Redo a move
uz: Harakatni takrorlang

# shortcut window
source: Get a hint for your next move
uz: Keyingi harakatingiz uchun maslahat oling

# shortcut window
source: Show Help
uz: Yordam ko'rsatish

# shortcut window
source: Show Keyboard Shortcuts
uz: Klaviatura yorliqlarini ko'rsatish

# shortcut window
source: Quit
uz: Chiqish

# shortcut window
source: Toggle Menu
uz: Menyuni almashtirish

source: _New Game
uz: _Yangi o'yin

source: Board _Size
uz: Kengash _Hajmi

source: _Keyboard Shortcuts
uz: _Klaviatura yorliqlari

source: _Help
uz: _Yordam

source: _About Hitori
uz: Hitori haqida

source: Undo your last move
uz: Oxirgi harakatingizni bekor qiling

source: Redo a move
uz: Harakatni takrorlang

source: Get a hint for your next move
uz: Keyingi harakatingiz uchun maslahat oling

source: Board size
uz: Kengash o'lchami

source: The size of the board, in cells.
uz: Oynaning maksimal holati

source: Whether the window is maximized.
uz: Oyna kattalashtirilganmi yoki yo'qmi.

source: Window position
uz: Oyna holati

source: Window position (x and y).
uz: Oyna holati (x va y).

source: Window size
uz: Oyna o'lchami

source: Window size (width and height).
uz: Oyna hajmi (kengligi va balandligi).

source: The help contents could not be displayed
uz: Yordam mazmunini ko‘rsatib bo‘lmadi

source: Copyright © 2007–2010 Philip Withnall
uz: Mualliflik huquqi © 2007–2010 Philip Withnall

source: A logic puzzle originally designed by Nikoli
uz: Dastlab Nikoli tomonidan ishlab chiqilgan mantiqiy boshqotirma

source: Hitori Website
uz: Hitori veb-sayti

source: Enable debug mode
uz: Nosozliklarni tuzatish rejimini yoqing

source: Seed the board generation
uz: Kengash avlod

source: - Play a game of Hitori
uz: - Hitori o'yinini o'ynang

source: Command line options could not be parsed: %s
uz: Buyruqlar qatori parametrlarini tahlil qilib boʻlmadi: %s

source: Do you want to stop the current game?
uz: Hozirgi o'yinni to'xtatmoqchimisiz?

source: Keep _Playing
uz: _O'ynashda davom eting

source: You’ve won in a time of %02u:%02u!
uz: Siz %02u:%02u vaqt ichida g‘alaba qozondingiz!

source: _Quit
uz: _Chqish

source: _Play Again
uz: Qayta o'ynang
