Repository: nizomovasadbek/i10n
Catalog: gnome/43/json-glib.master.po
Languages: uz

source: Prettify output
uz: Prettify chiqish

source: Indentation spaces
uz: Chiziq bo'shliqlari

source: SPACES
uz: JOYLAR

source: Output file
uz: Chiqish fayli

source: FILE
uz: FAYL

source: FILE…
uz: FAYL…

source: %s: %s: error opening file: %s
uz: %s: %s: faylni ochishda xatolik: %s

source: %s: %s: error parsing file: %s
uz: %s: %s: faylni tahlil qilishda xatolik: %s

source: %s: %s: error writing to stdout
uz: %s: %s: stdout-ga yozishda xatolik

source: %s: %s: error closing: %s
uz: %s: %s: yopilish xatosi: %s

source: Format JSON files.
uz: JSON fayllarini formatlash.

source: json-glib-format formats JSON resources.
uz: json-glib-format formatlari JSON resurslari.

source: Error parsing commandline options: %s
uz: Buyruqlar qatori parametrlarini tahlil qilishda xatolik yuz berdi: %s

source: Try “%s --help” for more information.
uz: Qoʻshimcha maʼlumot olish uchun “%s --help”ni sinab koʻring.

source: %s: missing files
uz: %s: yetishmayotgan fayllar

source: Validate JSON files.
uz: JSON fayllarini tasdiqlang.

source: json-glib-validate validates JSON data at the given URI.
uz: json-glib-validate berilgan URI da JSON ma'lumotlarini tasdiqlaydi.

source: Expecting a JSON object, but the root node is of type “%s”
uz: JSON obyekti kutilmoqda, lekin root element “%s” turiga ega

source: Unexpected type “%s” in JSON node
uz: JSON elementida kutilmagan “%s” turi

source: Missing elements in JSON array to conform to a tuple
uz: Kortejga mos keladigan JSON massivida eytishmayotgan elementlar

source: Missing closing symbol “)” in the GVariant tuple type
uz: GVariant korteji turidagi yopish belgisi “)” yetishmayapti

source: Unexpected extra elements in JSON array
uz: JSON massivida kutilmagan qo'shimcha elementlar

source: Invalid string value converting to GVariant
uz: Yaroqsiz satr qiymati GVariantga aylantirilmoqda

source: A GVariant dictionary entry expects a JSON object with exactly one member
uz: GVariant lug'at yozuvi aynan bitta a'zoga ega JSON obyektini kutadi

source: GVariant class “%c” not supported
uz: GVariant klassi “%c” qo‘llab-quvvatlanmaydi

source: Invalid GVariant signature
uz: GVariant imzosi yaroqsiz

source: JSON data is empty
uz: JSON maʼlumotlari boʻsh

source: %s:%d:%d: Parse error: %s
uz: %s:%d:%d: Tahlil xatosi: %s

source: JSON data must be UTF-8 encoded
uz: JSON maʼlumotlari UTF-8 bilan kodlangan boʻlishi kerak

source: Only one root node is allowed in a JSONPath expression
uz: JSONPath ifodasida faqat bitta root elementiga ruxsat berilgan

source: Root node followed by invalid character “%c”
uz: Root elementidan keyin yaroqsiz “%c” belgisi

source: Missing member name or wildcard after . character
uz: dan keyin aʼzo nomi yoki wildcard belgisi yoʻq. xarakter

source: Malformed slice expression “%*s”
uz: “%*s” slice ifodasi noto‘g‘ri

source: Invalid set definition “%*s”
uz: “%*s” taʼrifi notoʻgʻri

source: Invalid slice definition “%*s”
uz: “%*s” Massiv indeksiga ko'rsatma berishda xatolik

source: Invalid array index definition “%*s”
uz: “%*s” Massiv indeksini ko'rsatishda xatolik

source: Invalid first character “%c”
uz: “%c” birinchi belgisi noto‘g‘ri

source: The current node is of type “%s”, but an array or an object was expected.
uz: Joriy element “%s” turida, lekin massiv yoki obyekt kutilgan edi.

source: The index “%d” is greater than the size of the array at the current position.
uz: “%d” indeksi joriy pozitsiyadagi massiv hajmidan kattaroq.

source: The index “%d” is greater than the size of the object at the current position.
uz: “%d” indeksi hozirgi vaqtda obyekt hajmidan kattaroq

source: No node available at the current position
uz: Joriy holatda hech qanday element mavjud emas

source: The current position holds a “%s” and not an array
uz: Joriy pozitsiya massiv emas, balki “%s” ni egallaydi

source: The current node is of type “%s”, but an object was expected.
uz: Joriy element ”%s” turida, lekin obyekt kutilgan edi.

source: The member “%s” is not defined in the object at the current position.
uz: “%s” aʼzosi joriy holatda obyektda aniqlanmagan.

source: The current position holds a “%s” and not an object
uz: Joriy pozitsiya obyekt emas, balki ”%s” ni egallaydi

source: The current position holds a “%s” and not a value
uz: Joriy pozitsiyada qiymat emas, balki “%s” mavjud

source: The current position does not hold a string type
uz: Joriy pozitsiya string turiga ega emas
