Repository: nizomovasadbek/i10n
Catalog: gnome/43/libadwaita.libadwaita-1-2.po
Languages: uz

source: GNU General Public License, version 2 or later
uz: GNU General Public litsenziyasi, 2 yoki undan keyingi versiya

source: GNU General Public License, version 3 or later
uz: GNU General Public litsenziyasi, 3 yoki undan keyingi versiya

source: GNU Lesser General Public License, version 2.1 or later
uz: GNU Lesser General Public litsenziyasi, 2.1 yoki undan keyingi versiya

source: GNU Lesser General Public License, version 3 or later
uz: GNU Lesser General Public litsenziya, 3 yoki undan keyingi versiya

source: BSD 2-Clause License
uz: BSD 2-Clause litsenziyasi

source: The MIT License (MIT)
uz: MIT litsenziyasi (MIT)

source: GNU General Public License, version 2 only
uz: GNU General Public litsenziyasi, faqat 2-versiya

source: GNU General Public License, version 3 only
uz: GNU General Public litsenziyasi, faqat 3-versiya

source: GNU Lesser General Public License, version 2.1 only
uz: GNU Lesser General litsenziyasi, faqat 2.1 versiyasi

source: GNU Lesser General Public License, version 3 only
uz: GNU Lesser General Public litsenziyasi, faqat 3-versiya

source: GNU Affero General Public License, version 3 or later
uz: GNU Affero General Public litsenziyasi, 3 yoki undan keyingi versiya

source: GNU Affero General Public License, version 3 only
uz: GNU Affero General Public litsenziyasi, faqat 3-versiya

source: BSD 3-Clause License
uz: BSD 3-Clause litsenziyasi

source: Apache License, Version 2.0
uz: Apache litsenziyasi, 2.0 versiyasi

source: Mozilla Public License 2.0
uz: Mozilla Ommaviy litsenziyasi 2.0

source: This application comes with absolutely no warranty. See the <a href="%s">%s</a> for details.
uz: Ushbu ilova mutlaqo hech qanday kafolat bilan birga bo'lmaydi. <a href= yoki ...

source: This Application
uz: Ushbu dastur

source: Version %s
uz: % S versiyasi

source: Unable to parse release notes:
uz: Eslatma yozuvlari tahlil qilib bo'lmadi:

source: Line: %d, character: %d
uz: Chiziq:% d, belgi:% d

source: Copied to clipboard
uz: Clipboardga ko'chirilgan

source: Unable to save debugging information
uz: Nosozlik ma'lumotlarini saqlab bo'lmadi

source: Close
uz: Bekor qilish

source: Save debugging information
uz: Nosozlik ma'lumotlarini saqlang

source: _Save
uz: _Saqlash

source: _Cancel
uz: _Bekor qilish

source: About
uz: Haqida

source: _What’s New
uz: _Nima yangiliklar

source: _Details
uz: _Tafsilotlar

source: _Website
uz: _Veb-sayt

source: _Support Questions
uz: _Yordam savollari

source: _Report an Issue
uz: _Muammo haqida xabar berish

source: _Troubleshooting
uz: Muammolarni bartaraf etish

source: _Credits
uz: _Kreditlar

source: _Legal
uz: _Huquqiy

source: _Acknowledgements
uz: _Tasdiqlash

source: What’s New
uz: Nima yangiliklar

source: Back
uz: Orqaga

source: Details
uz: Tafsilotlar

source: Troubleshooting
uz: Muammolarni bartaraf qilish

source: To assist in troubleshooting, you can view your debugging information. Providing this information to the application developers can help diagnose any problems you encounter when you report an issue.
uz: Muammolarni bartaraf etishda yordam berish uchun siz nosozliklarni tuzatish ma'lumotlarini ko'rishingiz mumkin.Ushbu ma'lumotni dastur ishlab chiquvchilariga taqdim etish tashxis qo'yishga yordam beradiMuammo haqida xabar berganingizda duch keladigan har qanday muammolar.

source: _Debugging Information
uz: _Nosozliklarni tuzatish ma'lumotlari

source: Legal
uz: Huquqiy

source: Acknowledgements
uz: Minnatdorchilik

source: Debugging Information
uz: Nosozliklarni tuzatish ma'lumotlari

source: _Copy Text
uz: _Matnni nusxalash

source: _Save as…
uz: _Saqlash…

source: Apply
uz: Qo'llash

source: No Preference
uz: Afzallik yo'q

source: Prefer Dark
uz: Qora afzal

source: Prefer Light
uz: Yorug' afzal

source: System Appearance
uz: Tizim ko'rinishi

source: Override settings for this application. They will be reset upon closing the inspector.
uz: Ushbu ilova uchun sozlamalarni bekor qilish. Ular tekshiruvchi.

source: System Supports Color Schemes
uz: Tizim rang sxemalarini qo'llab-quvvatlaydi

source: Preferred Color Scheme
uz: Afzal rang sxemasi

source: High Contrast
uz: Yuqori kontrast

source: Hide Text
uz: Matnni yashirish

source: Show Text
uz: Matnni ko'rsatish

source: Caps Lock is on
uz: Caps Lock yoqilgan

source: _Show Text
uz: _Matnni ko'rsatish

source: Untitled page
uz: Sarlavhasiz sahifa

source: Preferences
uz: Afzalliklar

source: Search
uz: Qidiruv

source: No Results Found
uz: Hech qanday natija topilmadi

source: Try a different search.
uz: Boshqa qidiruvni sinab ko'ring.

source: Close Tab
uz: Tabni yopish
