Repository: nizomovasadbek/i10n
Catalog: gnome/43/libgtop.master.po
Languages: uz

source: read %d byte
uz: %d baytni o‘qish

source: read %lu byte of data
uz: %lu bayt maʼlumotni oʻqish

source: wrote %d byte
uz: %d bayt yozgan

source: Enable debugging
uz: Nosozliklarni tuzatishni yoqish

source: Enable verbose output
uz: Batafsil chiqishni yoqish

source: Don’t fork into background
uz: Orqa fonga o'tmang

source: Invoked from inetd
uz: inetd dan chaqirilgan

source: Run “%s --help” to see a full list of available command line options.
uz: Mavjud buyruq qatori opsiyalarining toʻliq roʻyxatini koʻrish uchun “%s --help” ilovasini ishga tushiring.

source: Interrupt
uz: To'xtatish

source: Quit
uz: Chiqish

source: Illegal instruction
uz: Noqonuniy ko'rsatma

source: Abort
uz: Bekor qilish

source: EMT error
uz: EMT xatosi

source: Floating-point exception
uz: Suzuvchi nuqtadan istisno

source: Kill
uz: Uzish

source: Bus error
uz: Bus xatosi

source: Segmentation violation
uz: Segmentatsiyaning buzilishi

source: Bad argument to system call
uz: Tizim chaqiruviga yomon argument

source: Broken pipe
uz: Buzilgan quvur

source: Alarm clock
uz: Uyg'otuvchi soat

source: Termination
uz: Tugatish

source: Urgent condition on socket
uz: Socketdan shoshilinch holat

source: Keyboard stop
uz: Klaviatura to'xtatilishi

source: Continue
uz: Davom eting

source: Child status has changed
uz: Childning holati o'zgargan

source: Background read from tty
uz: tty dan o'qilgan fon

source: Background write to tty
uz: tty ga fon yozish

source: I/O now possible
uz: Endi I/U mumkin

source: CPU limit exceeded
uz: CPU chegarasidan oshib ketdi

source: File size limit exceeded
uz: Fayl hajmi chegarasidan oshib ketdi

source: Virtual alarm clock
uz: Virtual budilnik

source: Profiling alarm clock
uz: Budilnikni profillash

source: Window size change
uz: Oyna hajmini o'zgartirish

source: Information request
uz: Ma'lumot so'rovi

source: User defined signal 1
uz: Foydalanuvchi tomonidan belgilangan signal 1

source: User defined signal 2
uz: Foydalanuvchi tomonidan belgilangan signal 2
