Repository: nizomovasadbek/i10n
Catalog: gnome/43/libgdata.main.po
Languages: uz

source: Batch operations are unsupported by this service.
uz: Bu xizmat tomonidan ommaviy operatsiyalar qo‘llab-quvvatlanmaydi.

source: This entry does not support comments.
uz: Ushbu yozuv sharhlarni qo'llab-quvvatlamaydi.

source: Comments may not be added to this entry.
uz: Ushbu yozuvga sharhlar qo'shilmasligi mumkin.

source: This comment may not be deleted.
uz: Bu fikr oʻchirilmasligi mumkin.

source: Invalid seek request
uz: Noto'g'ri qidiruv so'rovi

source: The server returned a malformed response.
uz: Server noto‘g‘ri shakllangan javobni qaytardi.

source: Access was denied by the user or server.
uz: Kirish foydalanuvchi yoki server tomonidan rad etilgan.

source: Error parsing XML: %s
uz: XMLni tahlil qilishda xatolik yuz berdi: %s

source: Empty document.
uz: Bo'sh hujjat.

source: Error parsing JSON: %s
uz: JSONni tahlil qilishda xatolik yuz berdi: %s

source: Outermost JSON node is not an object.
uz: Eng tashqi JSON tugun ob'ekt emas.

source: A %s element was missing required content.
uz: %s elementda kerakli kontent yo‘q edi.

source: The content of a %s element (‘%s’) was not in ISO 8601 format.
uz: %s elementining (‘%s’) tarkibi ISO 8601 formatida emas edi.

source: The value of the %s property of a %s element (‘%s’) was unknown.
uz: %s elementining (‘%s’) %s xususiyatining qiymati noma’lum edi.

source: The content of a %s element (‘%s’) was unknown.
uz: %s elementining (‘%s’) mazmuni noma’lum edi.

source: A required property of a %s element (%s) was not present.
uz: %s elementning (%s) talab qilinadigan xususiyati mavjud emas edi.

source: Values were present for properties %s and %s of a %s element when only one of the two is allowed.
uz: Qiymatlar faqat bitta %s elementning %s va %s xususiyatlari uchun mavjud bo'lganida mavjud ediikkisidan ruxsat berilgan.

source: A required element (%s) was not present.
uz: Kerakli element (%s) mavjud emas edi.

source: A singleton element (%s) was duplicated.
uz: Singleton element (%s) takrorlandi.

source: A ‘%s’ element was missing required content.
uz: “%s” elementida kerakli kontent yo‘q edi.

source: The content of a ‘%s’ element (‘%s’) was not in ISO 8601 format.
uz: “%s” elementining (“%s”) tarkibi ISO 8601 formatida emas edi.

source: Invalid JSON was received from the server: %s
uz: Serverdan noto‘g‘ri JSON qabul qilindi: %s

source: The content of a %s element (‘%s’) was not in hexadecimal RGB format.
uz: %s elementining (‘%s’) tarkibi o‘n oltilik RGB formatida emas edi.

source: Cannot connect to the service’s server.
uz: Xizmat serveriga ulanib bo'lmadi.

source: Cannot connect to the proxy server.
uz: Proksi-serverga ulanib bo'lmadi.

source: Invalid request URI or header, or unsupported nonstandard parameter: %s
uz: Yaroqsiz so‘rov URI yoki sarlavhasi yoki qo‘llab-quvvatlanmaydigan nostandart parametr: %s

source: Authentication required: %s
uz: Autentifikatsiya talab qilinadi: %s

source: The requested resource was not found: %s
uz: Soʻralgan manba topilmadi: %s

source: The entry has been modified since it was downloaded: %s
uz: Yozuv yuklab olinganidan beri oʻzgartirildi: %s

source: Error code %u when authenticating: %s
uz: Haqiqiylikni tekshirishda xato kodi %u: %s

source: Error code %u when querying: %s
uz: So‘rov paytida xato kodi %u: %s

source: Error code %u when inserting an entry: %s
uz: Yozuvni kiritishda xato kodi %u: %s

source: Error code %u when updating an entry: %s
uz: Yozuvni yangilashda xato kodi %u: %s

source: Error code %u when deleting an entry: %s
uz: Yozuvni oʻchirishda xato kodi %u: %s

source: Error code %u when downloading: %s
uz: Yuklab olishda xato kodi %u: %s

source: Error code %u when uploading: %s
uz: Yuklashda xato kodi %u: %s

source: Error code %u when running a batch operation: %s
uz: Ommaviy operatsiyani bajarishda xato kodi %u: %s

source: Invalid redirect URI: %s
uz: Qayta yoʻnaltirish URI notoʻgʻri: %s

source: The entry has already been inserted.
uz: Kirish allaqachon kiritilgan.

source: Error received from server after uploading a resumable upload chunk.
uz: Davomiy yuklash boʻlagi yuklangandan soʻng serverdan xatolik yuz berdi.

source: Stream is already closed
uz: Oqim allaqachon yopilgan

source: You have made too many API calls recently. Please wait a few minutes and try again.
uz: Siz yaqinda juda koʻp API qoʻngʻiroq qildingiz. Iltimos, bir necha daqiqa kuting va urinib koʻringyana.

source: You must be authenticated to do this.
uz: Buni amalga oshirish uchun siz autentifikatsiyadan o'tishingiz kerak.

source: You must be authenticated to query all calendars.
uz: Barcha kalendarlarni so'rash uchun autentifikatsiyadan o'tishingiz kerak.

source: You must be authenticated to query your own calendars.
uz: O'z kalendarlaringizni so'rash uchun autentifikatsiyadan o'tishingiz kerak.

source: You must be authenticated to download documents.
uz: Hujjatlarni yuklab olish uchun autentifikatsiyadan o'tishingiz kerak.

source: Unknown or unsupported document export format ‘%s’.
uz: Noma’lum yoki qo‘llab-quvvatlanmaydigan hujjat eksport formati “%s”.

source: Invalid visibility: unrecognized value ‘%s’
uz: Yaroqsiz ko‘rinish: tan olinmagan “%s” qiymati

source: You must be authenticated to query documents.
uz: Hujjatlarni so'rash uchun autentifikatsiyadan o'tishingiz kerak.

source: You must be authenticated to query drives.
uz: Drayvlarni so'rash uchun siz autentifikatsiyadan o'tishingiz kerak.

source: You must be authenticated to upload documents.
uz: Hujjatlarni yuklash uchun autentifikatsiyadan o'tishingiz kerak.

source: The document has already been uploaded.
uz: Hujjat allaqachon yuklangan.

source: You must be authenticated to update documents.
uz: Hujjatlarni yangilash uchun siz autentifikatsiyadan o'tishingiz kerak.

source: The content type of the supplied document (‘%s’) could not be recognized.
uz: Taqdim etilgan hujjatning kontent turini ('%s') tanib bo'lmadi.

source: You must be authenticated to copy documents.
uz: Hujjatlarni nusxalash uchun autentifikatsiyadan o'tishingiz kerak.

source: Parent folder not found
uz: Asosiy jild topilmadi

source: You must be authenticated to insert or move documents and folders.
uz: Hujjatlar va jildlarni qo'shish yoki ko'chirish uchun siz autentifikatsiyadan o'tishingiz kerak.

source: You must be authenticated to move documents and folders.
uz: Hujjatlar va papkalarni ko'chirish uchun siz autentifikatsiyadan o'tishingiz kerak.

source: You must specify a username or be authenticated to query a user.
uz: Siz foydalanuvchi nomini ko'rsatishingiz yoki foydalanuvchini so'rash uchun autentifikatsiya qilingan bo'lishingiz kerak.

source: Query parameter not allowed for albums.
uz: Albomlar uchun so'rov parametriga ruxsat berilmagan.

source: You must specify a username or be authenticated to query all albums.
uz: Barcha albomlarni so'rash uchun foydalanuvchi nomini ko'rsatishingiz yoki autentifikatsiya qilingan bo'lishingiz kerak.

source: The album did not have a feed link.
uz: Albomda tasma havolasi yo'q edi.

source: You must be authenticated to upload a file.
uz: Faylni yuklash uchun autentifikatsiyadan o'tishingiz kerak.

source: The album has already been inserted.
uz: Albom allaqachon kiritilgan.

source: You must be authenticated to insert an album.
uz: Siz albomni qo'shish uchun siz tasdiqlashingiz kerak.

source: You must be authenticated to query all tasklists.
uz: Barcha vazifalarga so'rov yuborish uchun siz tasdiqlashingiz kerak.

source: You must be authenticated to query your own tasks.
uz: O'zingizning vazifalaringizni so'rash uchun siz tasdiqlashingiz kerak.

source: You have exceeded your entry quota. Please delete some entries and try again.
uz: Siz kirish kvotangizni oshirdingiz. Iltimos, ba'zi yozuvlarni o'chirib tashlang va qaytadan urining.

source: Your Google Account must be associated with a YouTube channel to do this. Visit %s to create one.
uz: Sizning Google hisobingiz buni amalga oshirish uchun YouTube kanali bilan bog'liq bo'lishi kerak.HIsob yaratish uchun %s ga tashrif buyuring.

source: You must be authenticated to upload a video.
uz: Videoni yuklash uchun haqiqiylashtirishingiz kerak.
