Repository: nizomovasadbek/i10n
Catalog: gnome/43/libgnome-games-support.master.po
Languages: uz

source: Congratulations!
uz: Tabriklaymiz!

source: High Scores
uz: Yuqori ball

source: Best Times
uz: Eng yaxshi vaqtlar

source: No scores yet
uz: Hozircha ball yo'q

source: Play some games and your scores will show up here.
uz: Bir necha oʻyin oʻynang va ballaringiz shu yerda koʻrinadi.

source: Rank
uz: Daraja

source: Score
uz: Hisob

source: Time
uz: Vaqt

source: Player
uz: O'yinchi

source: _Done
uz: _Bajarildi

source: %ld second
uz: %ld soniya

source: Your score is the best!
uz: Sizning ballingiz eng yaxshisidir!

source: Your score has made the top ten.
uz: Sizning ballingiz kuchli o'nlikka kirdi.
