Repository: nizomovasadbek/i10n
Catalog: gnome/43/libpanel.main.po
Languages: uz

source: Open Pages
uz: Ochiq sahifalar

source: Frame
uz: Ramka

source: Move Page _Left
uz: Sahifani _chapga siljiting

source: Move Page _Right
uz: Sahifani _o‘ngga siljiting

source: Move Page _Up
uz: Sahifani _yuqoriga siljiting

source: Move Page _Down
uz: Sahifani _pastga siljiting

source: Close Frame
uz: Ramkani yopish

source: Restore panel to previous location
uz: Panelni avvalgi joyiga tiklang

source: (new)
uz: (yangi)

source: The draft “%s” has not been saved. It can be saved or discarded.
uz: “%s” qoralama saqlanmadi. Uni saqlash yoki tashlab yuborish mumkin.

source: Save or Discard Draft?
uz: Qoralama saqlansinmi yoki bekor qilinsinmi?

source: _Discard
uz: _O'chirish

source: _Save As…
uz: _Boshqa saqlash…

source: “%s” contains unsaved changes. Changes can be saved or discarded.
uz: “%s” saqlanmagan oʻzgarishlarni oʻz ichiga oladi. O'zgarishlar saqlanishi yoki o'chirilishi mumkin.

source: Save or Discard Changes?
uz: O'zgarishlar saqlansinmi yoki o'chirilsinmi?

source: _Save
uz: _Saqlash

source: Open documents contain unsaved changes. Changes can be saved or discarded.
uz: Ochiq hujjatlar saqlanmagan o'zgarishlarni o'z ichiga oladi. O'zgarishlarni saqlash yoki o'chirish mumkin.

source: Only _Save Selected
uz: Faqat _Tanlanganni saqlash

source: Save All
uz: Hammasini saqlash

source: Discard All
uz: Hammasini bekor qiling

source: _Cancel
uz: _Bekor qilish

source: Follow system style
uz: Tizim uslubiga rioya qiling

source: Light style
uz: Yorug' uslub

source: Dark style
uz: Qorong'i uslub
