Repository: nizomovasadbek/i10n
Catalog: gnome/43/libsoup.master.po
Languages: uz

source: Network stream unexpectedly closed
uz: Tarmoq oqimi kutilmaganda yopildi

source: Failed to completely cache the resource
uz: Resursni to‘liq keshlash amalga oshmadi

source: Output buffer is too small
uz: Chiqish buferi juda kichik

source: Connection terminated unexpectedly
uz: Ulanish kutilmaganda uzildi

source: Invalid seek request
uz: Noto'g'ri qidiruv so'rovi

source: Cannot truncate SoupBodyInputStream
uz: SoupBodyInputStreamni kesib bo‘lmadi

source: Operation would block
uz: Operatsiya bloklanadi

source: Could not parse HTTP response
uz: HTTP javobini tahlil qilib boʻlmadi

source: Unrecognized HTTP response encoding
uz: Noma'lum HTTP javob kodlash

source: Operation was cancelled
uz: Operatsiya bekor qilindi

source: Header too big
uz: Sarlavha juda katta

source: Could not import existing socket:
uz: Mavjud socketni import qilib bo'lmadi:

source: Can’t import unconnected socket
uz: Ulanmagan socketni import qilib bo‘lmadi

source: Can’t create a TLS server without a TLS certificate
uz: TLS sertifikatisiz TLS serverini yaratib boʻlmaydi

source: Location header is missing or empty in response headers
uz: Javob sarlavhalarida joylashuv sarlavhasi yo‘q yoki bo‘sh

source: Invalid URI “%s” in Location response header
uz: Joylashuvga javob sarlavhasida yaroqsiz URI “%s”

source: Too many redirects
uz: Yo‘naltirishlar juda ko‘p

source: Message was restarted too many times
uz: Xabar juda koʻp marta qayta ishga tushirildi

source: Message is already in session queue
uz: Xabar allaqachon sessiya navbatda

source: The server did not accept the WebSocket handshake.
uz: Server WebSocket suhbatini qabul qilmadi.

source: No public-suffix list available.
uz: Umumiy qo'shimchalar ro'yxati mavjud emas.

source: Invalid hostname
uz: Yaroqsiz xost nomi

source: Hostname is an IP address
uz: Xost nomi - bu IP manzil

source: Hostname has no base domain
uz: Xost nomida asosiy domen yo'q

source: Not enough domains
uz: Domenlar yetarli emas

source: Server requested unsupported extension
uz: Server qo‘llab-quvvatlanmaydigan kengaytmani so‘radi

source: Incorrect WebSocket “%s” header
uz: Noto‘g‘ri WebSocket “%s” sarlavhasi

source: Server returned incorrect “%s” key
uz: Server noto‘g‘ri “%s” kalitini qaytardi

source: Duplicated parameter in “%s” WebSocket extension header
uz: “%s” WebSocket kengaytmasi sarlavhasida takrorlangan parametr

source: Server returned a duplicated parameter in “%s” WebSocket extension header
uz: Server “%s” WebSocket kengaytmasi sarlavhasida takrorlangan parametrni qaytardi

source: WebSocket handshake expected
uz: WebSocket bilan ulanish kutilmoqda

source: Unsupported WebSocket version
uz: WebSocket versiyasi qo'llab-quvvatlanmaydi

source: Invalid WebSocket key
uz: Yaroqsiz WebSocket kaliti

source: Unsupported WebSocket subprotocol
uz: Qo'llab-quvvatlanmaydigan WebSocket subprotocol

source: Server rejected WebSocket handshake
uz: Server WebSocket suhbatini rad etdi

source: Server ignored WebSocket handshake
uz: Server WebSocket ulanishni e'tiborsiz qoldirdi

source: Server requested unsupported protocol
uz: Server qo'llab-quvvatlanmaydigan protokolni so'radi
