Repository: nizomovasadbek/i10n
Catalog: gnome/43/lightsoff.master.po
Languages: uz

source: _Restart
uz: _Qayta ishga tushirish

source: _Help
uz: _Yordam

source: _About Lights Off
uz: _Chiroqlar oʻchirilgani haqida

source: _First puzzle
uz: _Birinchi jumboq

source: _Previous puzzle
uz: _Oldingi jumboq

source: Ne_xt puzzle
uz: _Keyingi jumboq

source: _Change Puzzle
uz: _ Jumboqni o'zgartirish

source: Lights Off
uz: Chiroqlar oʻchirilgan

source: Turn off all the lights
uz: Barcha chiroqlarni o'chiring

source: Lights Off is a collection of light switch puzzles. Clicking on a light toggles it either on or off, but also toggles all the surrounding lights, too. Your objective is simple: turn off all the lights!
uz: Chiroqlar o'chirilgan - bu yorug'likni o'zgartirish jumboqlari to'plami. Chiroqni bosish uni yoqadi yoki o'chiradi, lekin atrofdagi barcha chiroqlarni o'zgartiradiShuningdek. Maqsadingiz oddiy: barcha chiroqlarni o'chiring!

source: Players who delight in turning off lights will enjoy the huge number of levels.
uz: Chiroqlarni o'chirishdan zavqlanadigan o'yinchilar juda ko'p

source: game;logic;board;tiles;adjacent;puzzle;
uz: o'yin;mantiq;taxta;plitkalar;qo'shni;jumboq;

source: The current level
uz: Hozirgi daraja

source: The users’s most recent level.
uz: Foydalanuvchilarning eng oxirgi darajasi.

source: The width of the window
uz: Oynaning kengligi

source: The width of the main window in pixels.
uz: Asosiy oynaning piksellardagi kengligi.

source: The height of the window
uz: Oynaning balandligi

source: The height of the main window in pixels.
uz: Asosiy oynaning piksellardagi balandligi.

source: A flag to enable maximized mode
uz: Kattalashtirilgan rejimni yoqish uchun bayroq

source: If “true”, the main window starts in maximized mode.
uz: Agar ”to'g'ri” bo'lsa, asosiy oyna maksimallashtirilgan rejimda boshlanadi.

source: Display version number
uz: Versiya raqamini ko'rsatish

source: Failed to parse command-line arguments.
uz: Buyruqlar qatori argumentlarini tahlil qilib bo‘lmadi.

source: Page on GNOME wiki
uz: GNOME wiki-dagi sahifa

source: Turn off all the lights!
uz: Barcha chiroqlarni o'chiring!

source: Puzzle %d
uz: Boshqotirma %d
