Repository: nizomovasadbek/i10n
Catalog: gnome/43/xdg-desktop-portal-gnome.main.po
Languages: uz

source: Select an Image
uz: Rasmni tanlang

source: Cancel
uz: Bekor qilish

source: Select
uz: Tanlang

source: Clear
uz: Toza

source: Images
uz: Tasvirlar

source: Share your personal information with %1$s? %2$s
uz: Shaxsiy maʼlumotlaringizni %1$s bilan baham koʻringmi? %2$s

source: Share your personal information with the requesting application? %s
uz: Shaxsiy maʼlumotlaringizni soʻrov yuborayotgan ilova bilan baham koʻrasizmi? %s

source: Share Details
uz: Tafsilotlarni almashish

source: _Cancel
uz: _Bekor qilish

source: _Share
uz: _Ulashish

source: Name
uz: Ism

source: Username
uz: Foydalanuvchi nomi

source: Failed to start Software
uz: Dasturiy ta'minotni ishga tushirib bo'lmadi

source: Choose an application to open the file “%s”.
uz: “%s” faylini ochish uchun ilovani tanlang.

source: Choose an application.
uz: Ilovani tanlang.

source: No apps installed that can open “%s”. You can find more applications in Software
uz: “%s”ni ochadigan ilovalar o‘rnatilmagan. Dasturiy ta'minot bo'limida ko'proq ilovalarni topishingiz mumkin

source: No suitable app installed. You can find more applications in Software.
uz: Hech qanday mos ilova oʻrnatilmagan. Dasturiy ta'minot bo'limida ko'proq ilovalarni topishingiz mumkin.

source: Open With…
uz: Ochish…

source: _Open
uz: _Ochiq

source: No Apps available
uz: Hech qanday ilova mavjud emas

source: _Find More in Software
uz: _Dasturiy taʼminot boʻlimida koʻproq maʼlumot toping

source: “%s” is running in the background
uz: “%s” fonda ishlamoqda

source: This might be for a legitimate reason, but the application has not provided one. Note that forcing an application to quit might cause data loss.
uz: Bu qonuniy sababga ko'ra bo'lishi mumkin, ammo ilova buni taqdim etmagan. Ilovani o'chirishga majburlash ma'lumotlar yo'qolishiga olib kelishi mumkinligini unutmang.

source: Force quit
uz: Chiqishga majburlash

source: Allow
uz: Ruxsat bering

source: Background activity
uz: Fon faoliyati

source: Find out more
uz: Batafsil ma'lumot oling

source: Create Web Application
uz: Veb-ilova yaratish

source: Create Application
uz: Ilova yaratish

source: C_reate
uz: Yaratmoq

source: _Select
uz: _Tanlash

source: _Save
uz: _Saqlash

source: Open files read-only
uz: Fayllarni faqat o'qish uchun oching

source: Remote desktop
uz: Masofaviy ish stoli

source: Allow remote interaction
uz: Masofaviy aloqaga ruxsat bering

source: Screen Share
uz: Ekranni ulashish

source: Select monitor to share with %s
uz: %s bilan ulashish uchun monitorni tanlang

source: Select window to share with %s
uz: %s bilan baham ko‘rish uchun oynani tanlang

source: Select monitor to share with the requesting application
uz: Soʻrov yuborayotgan ilova bilan baham koʻrish uchun monitorni tanlang

source: Select window to share with the requesting application
uz: Soʻrov yuborayotgan ilova bilan baham koʻrish uchun oynani tanlang

source: Single Window
uz: Yagona oyna

source: Remember this selection
uz: Ushbu tanlovni eslang

source: Entire Screen
uz: Butun ekran

source: Share this screenshot with %s?
uz: Ushbu skrinshot %s bilan ulashilsinmi?

source: Share this screenshot with the requesting application?
uz: Ushbu skrinshot soʻralayotgan ilova bilan baham koʻrilsinmi?

source: Screenshot
uz: Skrinshot

source: _Options…
uz: _Tanlovlar…

source: Take _Screenshot
uz: _Skrinshotni oling

source: Take Screenshot
uz: Skrinshot oling

source: Grab the whole sc_reen
uz: To'liq ekranni oling

source: Grab the current _window
uz: Joriy oynani ushlang

source: Select _area to grab
uz: Qabul qilish uchun _maydonni tanlang

source: Grab after a _delay of
uz: _kechiktirilgandan keyin oling

source: seconds
uz: soniya

source: Effects
uz: Effektlar

source: Include _pointer
uz: _pointerni qo'shing

source: Include the window _border
uz: _border oynasini qo'shing

source: Requested setting not found
uz: Talab qilingan sozlama topilmadi

source: Set Background
uz: Fonni o'rnatish

source: Set
uz: Oʻrnatish

source: Failed to load image file
uz: Tasvir fayli yuklanmadi

source: Activities
uz: Faoliyatlar
